[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey mate. Nice work. Good that you have been able to find some time to get some work done.",
        "ts": "1585298666.000800",
        "username": "Dave Edwardz (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-27\/1017821154418_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I’ve been pretty busy trying to adapt to working from home. In some ways it has been busier for me than at the office.",
        "ts": "1585298721.000900",
        "username": "Dave Edwardz (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-27\/1030099323652_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Overall, I think your model is coming along nicely. Keep going with it. Here are some suggestions though:",
        "ts": "1585298753.001000",
        "username": "Dave Edwardz (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-27\/1017824002146_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "The horns coming out of the side of his face are fine, but you may need to do more to either indicate they are horns or change some of the other facial structure so that it makes sense from an anatomical point of view. If you look at Hellboy, while his horns are cut off, the rest of his face, is far more primal and heavy featured than a normal face. We thus, visually understand that this is a creature that grows horns. Currently if feels as though this is a man’s head with some horns. So think about incorporating some other structural elements in. Without the rest of the body as well, it is hard to know they are horns, its fine if you want to go that way, but definitely explore lengthening them. Hellboy’s horns are cut off for a story reason.",
        "ts": "1585298973.001100",
        "username": "Dave Edwardz (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-27\/1020569452369_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Also a couple of anatomical tips. When looking at your nose front on, the bottom of it is very flat. Noses are actually quite complex in shape, and the bottom of them actually comes down and tapers into the top lip. Do a google search. I often use pinterest and type things like “nose anatomy” and you will find a lot of great drawing \/ sculptural advice. Regarding my earlier comment regarding additional creature features, you could also change the nose to some sort of creature’s nose, which could help to explain the horns. If this is something that appeals to you, I would look at creatures that grow horns, and then find a snout \/ nose that matches.",
        "ts": "1585299177.001200",
        "username": "Dave Edwardz (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-27\/1032491419670_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Last tip. From the side of the face, your placement of the horns is getting very close to the edge of the jawline. Not only does this make it a little less effective design wise, but also less structurally sound. I would move the horn more central into the jaw line because it would need to be as strong as possible.",
        "ts": "1585299267.001300",
        "username": "Dave Edwardz (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-27\/1020578477649_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Ok. Good stuff mate. Keep creating, and looking forwards to whatever you do next. Stay safe :slightly_smiling_face:",
        "ts": "1585299293.001400",
        "username": "Dave Edwardz (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-27\/1032638242423_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]