[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey mate. The background doesn’t bother me as that is not the focus. I would focus on the main character. It probably needs more anatomy around the face area. Your pose is quite flat, and your left leg looks like it is disappearing ",
        "ts": "1580999523.003500",
        "username": "Dave Edwardz (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-06\/939540783268_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Potentially you could defoliant the background somewhat of it is bothering you. In low light, the aperture would have to be open creating less depth of field. ",
        "ts": "1580999575.003600",
        "username": "Dave Edwardz (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-06\/942206993718_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "What the fall off in your light too. It feels too sharp",
        "ts": "1580999594.003700",
        "username": "Dave Edwardz (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-06\/942207528806_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "There is something scarier about the first image that is monochrome. Think about that when you do your next pass",
        "ts": "1580999621.003800",
        "username": "Dave Edwardz (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-06\/928530274035_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Good luck",
        "ts": "1580999626.003900",
        "username": "Dave Edwardz (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-06\/929846797857_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "This was inspired by resident evil specially the resident evil 7, that game usually have a lot zombies running towards the player and due to the nature of the game the lighting is very minimal so the player has a torch out all the time. So that is what I was going for with this hence why the leg is falls into darkness\n\nWith the face, yes I understand the anatomy isnt fully human which is what I was going for, I had this idea of the creature being a human first then turing into a zombie which mutates certain features ie the face with the missing jaw and having a vertical slit as a mouth instead of a traditional mouth. There is a creature similar to this in the games they are called lickers, which have the same idea of them being humans once who turned into mutated zombies.\n\nps. I know I should explain what is it that I am sending instead of just sending an image. I will do that next time.",
        "ts": "1581011828.004000",
        "username": "Hannan Hanid (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-06\/939979192852_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Hannan. I understand all of that, but it’s the execution I’m talking about. I can see this is a zombie, but even zombies have more structure to their bodies. If you look at any of the games you are referencing, you will see what I’m talking about. You need to think about it as a human that has decomposed. The base form of the human needs to be correct and you need to be specific regarding how the character has been modified. Whether it is decomposition or a growth on the human to become a zombie. If you do a slit, you would still need to imply how that has formed from the original form, rather than just putting the slit on there. Regarding the pose, in low light you can still pose your character better to indicate it’s silhouette. By pulling its leg out slightly, you will be able to make it read better. ",
        "ts": "1581013261.004100",
        "username": "Dave Edwardz (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-06\/940502068677_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "The thing about the light is that it looks like a CG light. It looks like a single spotlight with a falloff that is not photographically accurate",
        "ts": "1581013315.004200",
        "username": "Dave Edwardz (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-06\/940029213396_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "If you shine a torch, the light is not emanating from a single point as it does in CG. It is usually light emanating from a source then bouncing around before it comes out. Because of that, the falloff is usually softer and there are more variation in the light that appears. You will often sees rings, and usually some sort of hotspot. The light won’t be a single color either. These are the types of detail that you need to think about, and look for if you want to take it to the next level. Game engines that you are referencing actually build this stuff in, and so naturally look better than most CG renders",
        "ts": "1581013562.004300",
        "username": "Dave Edwardz (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-06\/940036985604_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thank you and yes I understand what you are saying, I will be more mindful of these things next time",
        "ts": "1581024078.004400",
        "username": "Hannan Hanid (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-06\/943024314678_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]