[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Ok no worries. If that is the case, I can understand how difficult it would be to repose. We usually spend a lot of time on pushing our poses and making them as readable as possible, so it is good to get used to analyzing this in your work. Usually you want all parts of your figure to be readable somehow (even if it’s a slither) so that we understand the form of the character. You could lower the foot slightly and as long as you can see how it’s connected to the body, it will be the same pose, but more readable. Even in animation when a character is moving, we usually go through our in betweens and try to enhance the readability. When working with real life actors you often pick the most readable poses too. Additionally, if you look at this current pose, it is fairly flat to the camera with head, shoulders and hips in a straight line. You can get a lot more dynamism in your poses by simply looking for opposing angles between them. This goes for up and down, as well as towards \/ away from camera. Also consider the angle of the head, as more angle would help. Zombies particularly are visualized with their heads leading the poses (because they are trying to eat people!), so it makes sense to have it more forwards, ahead of the body. You may not want to incorporate all this in your current image, but think about it at least for your next piece. This is the type of feedback that I will give to my artists multiple times a day when critiquing what they are producing. ",
        "ts": "1581497448.004700",
        "username": "Dave Edwardz (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-12\/936912450323_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I do value this type of feedback, in fact I prefer if someone is direct and tells me what I am doing wrong and how I can correct myself rather than someone being \"nice\" to me, because this will help me grow.\n\nSecondly I have gotten a bit occupied with my family as my brother is coming to visit and we are planning a family outing so sorry for not letting you know why I just ghosted. With that said I will say that you may not see much work from me as I am busy with my family but whatever I can finish I will send that you way.\n\nAgain thank you for all your help and I do appreciate the feedback even tho it seems like I am annoyed with it, I am not I just dont talk much henc the short messages I send (except for this one)",
        "ts": "1581547743.004800",
        "username": "Hannan Hanid (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-12\/949362397972_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]