[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I found at the beginning of my career I learnt more at the smaller companies than I did at the big companies, but that is personal preference! Thats great you are getting your work out there and seen. That will help your confidence if you show as many people as you can and get used to listening to feedback. What makes a really good artist is listening to the feedback and adapting those changes. I started my career at Jellyfish when they were a lot smaller, I still hear that it is a really nice company!",
        "ts": "1543843966.000100",
        "username": "Emma Braney (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-03\/493771961235_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I cant comment on the film team but the TV department are very close, I think it helps as we are a smaller team so we know everyone. It is a little harder in film as artists tend to come and go a lot due to the turnaround of projects. It is a great to sit in a room with a lot of talented people and bounce ideas off of each other, especially when problem solving.",
        "ts": "1543844093.000200",
        "username": "Emma Braney (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-03\/493875992882_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I keep in contact with a few people from my uni, but tbh a lot of them moved to Vancouver a few years back. But I do keep in contact with a lot of ex colleagues as you find you end up working with them again a few years later at a different company! Its always good to make and keep as many contacts as you can in this industry, I have got most of my jobs from people I knew!",
        "ts": "1543844180.000300",
        "username": "Emma Braney (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-03\/494077023413_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "In terms of grades , no, we look at showreels, we look at the work, if there is anything that stands out or if there is anything we are looking for in particular. For example, if we know we have a show coming up with a city environment we might look for showreels that feature cities so we know the artist has worked on that before. Or we might look at showreels that show lots of variety so we know that artist can pick up anything!",
        "ts": "1543844321.000400",
        "username": "Emma Braney (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-03\/494930469255_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I studied at Bournemouth , not sure if it is the same, but we had to write a report on our short film. Not quite a dissertation but still a big essay. We also had to write an innovations report, research our studies and produce a film at the end. So not quite so easy! Haha!",
        "ts": "1543844467.000500",
        "username": "Emma Braney (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-03\/493277208673_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "How is your final year going? Have you started to look at companies you are interested in ? Have you thought about a showreel?",
        "ts": "1543844525.000600",
        "username": "Emma Braney (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-03\/494081743909_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]