[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "So, I studied Computer Visualisation and Animation at Bournemouth University, before that I studied A levels and completed an art foundation course. I did not really know what I wanted to do I just knew that I preferred watching the behind the scenes on films more than the film themselves! After graduating I completed a few work experience stints at smaller companies and then finally got my break working at MPC . Yes, its a lot harder to get into the industry now, but a lot of companies now offer internships where you get to spend three months learning the pipeline and working along side artists in the industry. I was very lucky and landed a junior role at a smaller company where I learnt a lot on the job and was able to experience every discipline. I also know some of the smaller companies offer work experience or allow you in for a few days, I know Jellyfish offer this . Its also about keeping your contacts and meeting as many people as you can, most of my jobs have come from people I know. The creatures we are working on at the moment are mainly fantasy creatures. I know the animation department are having a lot of fun with them! I cant comment too much on the animation department in dneg film or dneg feature, but I know in TV we have a little bit more flexibility. A lot  of the time the client does not not really know what they want so they can be creative. There is also a quicker turnaround in TV so its a test to see how quickly they can produce high quality animation!",
        "ts": "1543504195.002000",
        "username": "Emma Braney (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-29\/491270541666_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "The industry is competitive but add as many recruiters as you can on linkedin , keep a close eye on the internships offered and also look at the smaller companies. Have you looked at Blue Zoo? They are a great small company that focus on animation",
        "ts": "1543504300.002100",
        "username": "Emma Braney (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-29\/491272573042_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yeah, I've been told that its best to do internships from smaller companies to later work yourself up. I just have that fear of my work not being good enough, you know? I have great friends in my class that encourage me and push me to talk to people in the industry, like BFX job fairs and 'bring your own animation' meetups. I've met a few talented people in the animation industry and they gave me feedback on my work (which I am currently working on now). Oh, Jellyfish and Bluezoo recently came to our school and gave us a talk on their pipeline and their work, it was super inspiring and I was thinking of looking more into those two as well as Passion and Red Knuckle. Would you describe that your team is like your family? I just love the idea of surrounding yourself with people that inspire and motivate you in your team, do you keep in contact from previous co-workers from past studios you worked at as well as classmates from uni? Im so excited to mingle and work in a team with amazing people I see everyday.",
        "ts": "1543527997.002200",
        "username": "Leanne cheuk (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-29\/491107810209_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "sidenote, from your perspective, do you ever look at grades? because im not really great in the writing department and i have to write a dissertation which contributes to my overall final grade. I have a few friends at Bournemouth and they are super lucky they dont need to write one",
        "ts": "1543528158.002300",
        "username": "Leanne cheuk (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-29\/491612097923_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]