[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "oh, I love getting feedback on work, it totally makes sense when someone explains whats wrong with a certain pose, or if the timing and weight is off too! Wait so in film there is constantly a different team of people? I guess it would make sense if there was different styles for the film.\nThis might sound like that typical annoying question that everyone asks, but whats your pipeline like and roughly how many people are in each department? I can only imagine it being very similar to other departments too. Out of curiosity, would working in TV constantly be 'working\/collaborating for a client' (unless the company produces their own content).\nI was actually talking to a few people about showreels. Because my school encourages you to stick to one specialism, so I chose 3D character animation, but it would have been good to be more of a generalist like in Bournemouth. I look at showreels from people that graduated from Bournemouth and i low key want to die because they have a bit of everything like character modelling, vfx, environment modelling. But I guess there is pros and cons to both specialism and generalist aspects.\nI think third year is going smoothly (except for the dissertation part which is due right after new year). We basically have a portfolio unit (which is this term) and it making work so we can add it onto our showreel. For FMP which is next term my friends and I have planned to make a short film and im super hyped about it!\nIve started to put my work together and I was possibly wondering if you can have a look at it just to know what you think? its not super refined but im a little stuck in terms of if you should add writing on the bottom left or clarify your role or add it in the beginning text under your name (if you get me).\nIm planning to apply for internships like bluezoo, so for now I just wanted to slap on the work and worry about refining it later on.",
        "ts": "1544109844.000700",
        "username": "Leanne cheuk (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-06\/496655945873_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "<https:\/\/vimeo.com\/304840535>",
        "ts": "1544112604.000800",
        "username": "Leanne cheuk (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-06\/496576903456_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "Vimeo",
                "service_url": "https:\/\/vimeo.com\/",
                "title": "Leanne Cheuk Winter Showreel 2018",
                "title_link": "https:\/\/vimeo.com\/304840535",
                "author_name": "Leanne Cheuk",
                "author_link": "https:\/\/vimeo.com\/leannec",
                "thumb_url": "https:\/\/i.vimeocdn.com\/video\/744173376_295x166.jpg",
                "thumb_width": 295,
                "thumb_height": 166,
                "text": "Still more updates and refining to come.",
                "fallback": "Vimeo Video: Leanne Cheuk Winter Showreel 2018",
                "video_html": "<iframe src=\"https:\/\/player.vimeo.com\/video\/304840535?autoplay=1&app_id=122963\" width=\"400\" height=\"225\" frameborder=\"0\" title=\"Leanne Cheuk Winter Showreel 2018\" allow=\"autoplay; fullscreen\" allowfullscreen><\/iframe>",
                "video_html_width": 400,
                "video_html_height": 225,
                "from_url": "https:\/\/vimeo.com\/304840535",
                "service_icon": "https:\/\/a.slack-edge.com\/bfaba\/img\/unfurl_icons\/vimeo.png",
                "id": 1,
                "original_url": "https:\/\/vimeo.com\/304840535"
            }
        ]
    }
]