[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "You did forensic photography?! That is a completely different path. Is that what got you interested in photography or did that come later when you started learning more about compositing?",
        "ts": "1576947649.000100",
        "username": "Qudrat Olayonwa (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-21\/883146270053_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Oooh. Living next to the sea sounds sounds beautiful, my dream is to have a holiday in the middle of mountains so i can be surrounded by nature, but i’m also scared of animals so hopefully I can find something similar.",
        "ts": "1576947832.000200",
        "username": "Qudrat Olayonwa (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-21\/872887355249_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I haven’t had any experience with actual compositing as i’ve only experimented with modelling and adobe software so this may sound quite naive. The truth is I became interested in VFX because I watched Blade Runner and Altered Carbon and really liked the tone that the movie had throughout because even though it’s distinctly cyberpunk, every scene in the movie\/tv show belonged to a completely world that I’m living in yet still looked realistic as it was it’s own world. I didn’t use to like watching movies (although I’ve started watching a lot more from last year) so i never realised how good the visual effects are in movies. When I researched different roles I found that the compositor is the person who puts together the assets to make them look realistic and I want to be able to make final scenes.",
        "ts": "1576948801.000300",
        "username": "Qudrat Olayonwa (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-21\/870360796082_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I’ve also really enjoyed the photography assignment that I had to do as part of my university module which I’ve been told is beneficial in compositing. However, i won’t be sure until i start practising my compositing skills as right now i’m trying to learn as much as i can from photoshop and illustrator.",
        "ts": "1576948987.000400",
        "username": "Qudrat Olayonwa (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-21\/871676655875_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Also sorry i keep replying so late, the notification didn’t appear on the slack app so I figured you were busy preparing for the end of the year.",
        "ts": "1576949056.000500",
        "username": "Qudrat Olayonwa (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-21\/885004608855_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Also I was wondering if you would be ok with looking at some of my photography work and give me some advice on how i could improve. Only if possible though:)",
        "ts": "1576949242.000600",
        "username": "Qudrat Olayonwa (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-21\/882689507348_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]