[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Had a look through your designs, the production bible and pre-visualisation. Love the characters and bible very presentable!\n\nI definitely have a bunch of things to start helping you with and giving you advise on - but you know your project more than me so it will always be about you sifting through and reflecting on what I say and putting things into practise the best way you see fit. I think this project can be very meaningful and beautiful!\n\nFirst of all:\nI think that 6 minutes is wayy too long for the time you have. To reach industry standards (or the closest you can to it) I would suggest finding the core essence of your story or picking one scene and thinking of that movement and visual storytelling - and make that the most meaningful and beautiful you can. It can be so much shorter and say so much more! I know you are far down the road and no doubt attached to a few things but in terms of having two months left to not only animate, but animate well and complete post production well is a hefty job in my purely honest opinion. You can always tell a longer version in the future, but quality is always important.\n\nSecond of all (and potentially off topic):\nSell yourself more in the production bible. Your first page’s wording describes being out of ideas and your Nan not being a suitable subject - pretty much. This is a form of marketing. Make yourself and your ideas, family, etc, sound as interesting as possible! Which it will be! My advise is really to try and always put across the most compelling story and put the best spin on any situation. This feeds into everything including your filmmaking and animation practise - it is all storytelling.\n\nLet’s get chatting in a bit more detail, but please let me know your thoughts on having a look at your pre-vis and storyboard in some detail. From there, I see doing a quick schedule as something key to get right for you going forward.",
        "ts": "1551559350.001500",
        "username": "Fraser (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-03-02\/565573961250_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "And, yes, a bit about me: I am working on the VFX of a few short films at the moment, in development on some film projects, doing workshops and working day-to-day on productions on set or in studio in VFX. My weeks and days can be very varied - part of being self-employed I think! I worked on a few series a few months back: Shetland, Sex Education, Bounty Hunters, Widow, Outlander - to name a few titles! Where are you studying, by the way?",
        "ts": "1551559569.001600",
        "username": "Fraser (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-03-02\/565900641973_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I agree 6 minutes is too long, me and my lecturer have been working to get this down, the latest version I have of my pre viz is the link below (sound is no where near what I want it to be - I’m working with a composer so that will be the main sound), my lecturer has commented the changes I need to make which you can see, I think I’m almost there with it so I was gonna make these changes to the real deal… I’ve updated it 17 times so far… haha…\n\n<https:\/\/parisanimationarts.blogspot.com\/2019\/02\/a-time-apart-pre-viz-progress-17.html>\n\nI’m not a touchy\/egotistical person when it comes to advice and feedback, I know a few people who take umbrage to feedback and become very pessimistic - I can’t stand it and strive to be the total opposite so don’t worry about my feelings too much, I can handle it and I’m always open to new ideas.\n\nI’d like to use the fact you’re new to my project to my advantage and from your opinion what’s the minimum I need to get the story across. I’m not overly attached to the film, in fact I’m becoming quite numb with it and struggle to judge it with fresh eyes. I don’t mind swapping parts or cutting bits out, except for the letter posting scene and the milk bottle scene which I know are true facts of what happened. I didn’t know my Grandad well and I lost my Nan last year who I was very close too, the milk bottle scene was her input which is why I’m attached and determined to keep that bit - not that anyone has tried to take that bit out, it’s a plot device that leads to Doris - his sister - finding him.\n\nAre there any bits you think I could\/should cut even further?\n\nMy art of, I will change it to be as interesting as possible - I’ll include a short bit about my Nan’s experience because it was interesting to hear and she loved talking about it. I plan on having it published when it’s done and taking it with me to interviews. In the first week of July my course exhibit at a show called New Designers in London, I plan to have my book printed then too alongside my characters in 3D. Only 10 people are selected to go and have to at least achieve a 2:1, I like to think I will be one of the lucky 10 - fingers crossed.\n\n\nI study Computer Animation Arts at the University for the Creative Arts (UCA) Rochester.",
        "ts": "1551562552.001700",
        "username": "Paris (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-03-02\/565588058178_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "title": "A Time Apart: Pre Viz Progress 17",
                "title_link": "https:\/\/parisanimationarts.blogspot.com\/2019\/02\/a-time-apart-pre-viz-progress-17.html",
                "text": "After a tutorial today with Phil we further discussed my pre viz and I feel like I'm the closest I've ever been to being finished with my pr...",
                "fallback": "A Time Apart: Pre Viz Progress 17",
                "image_url": "https:\/\/lh4.googleusercontent.com\/proxy\/8mw9AqQFWvGJmTJs613aPneTnnOeUnmFPhCO22B6snfp3-NqF0ga9zOj_VoOiKidkvzKB7uvL-1Z1mvbryC3LSbWOaw=w1200-h630-n-k-no-nu",
                "from_url": "https:\/\/parisanimationarts.blogspot.com\/2019\/02\/a-time-apart-pre-viz-progress-17.html",
                "image_width": 333,
                "image_height": 250,
                "image_bytes": 7585,
                "service_icon": "https:\/\/parisanimationarts.blogspot.com\/favicon.ico",
                "service_name": "parisanimationarts.blogspot.com",
                "id": 1,
                "original_url": "https:\/\/parisanimationarts.blogspot.com\/2019\/02\/a-time-apart-pre-viz-progress-17.html"
            }
        ]
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Oh and by the way - thank you for becoming my mentor and taking the time to help me - I really appreciate it :slightly_smiling_face:",
        "ts": "1551562706.001900",
        "username": "Paris (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-03-02\/565914339781_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]