[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Definitely makes sense to specialise in that later then. And if you can, even make sure that this film has helped serve that interest and take you forward in that area. Really important to get used to the standards in the industry and work at getting there.\nHow is your schedule going in pulling the film together? Are you putting your latest animated and \/ or rendered shots into your animatic as you go along?",
        "ts": "1554291837.000500",
        "username": "Fraser (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-03\/599629312023_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "This film has helped me get so much better at modelling, I’m very aware that I am still quite amateur. I’m going to apply for Blue Zoo’s modelling internship - bit of a long shot but I’m trying anyway, I’ve got 3 blue zoo connections on LinkedIn who I can get reel advice from once it’s done - I’m rendering my characters and their props at the moment. Their deadline is before my film’s deadline, after my deadline I’ll be applying to more around London. I tried making a schedule but I’m not very good at sticking to it I’m just trying to do as much as I can possible. I want Act 1 animated by the end of the week :crossed_fingers::skin-tone-2:\n\nI’ve been told I don’t have to render my film for submission just playblasts\/post viz and render 1 frame from every shot\/scene in a pdf to prove we have lit our scenes. The reason for this is because of New Designers (I’m not sure if I’ve mentioned this before - it’s our graduation show). There are 2 versions of our films, submission film (May 10th) and new designers film (first week of July), after May we have until New Designers to improve our films and render them at their best for New Designers",
        "ts": "1554293609.000600",
        "username": "Paris (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-03\/589866787393_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Have you ever worked as a 3D Modeller???",
        "ts": "1554300481.000700",
        "username": "Paris (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-03\/596342594352_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Excellent :+1: no I’ve never worked as a 3D modeller. I’ve worked as a generalist and done small amounts of modelling but I specialised in compositing so that’s been a main visual effects role I’ve had - along with being a data wrangler on sets. So, unfortunately I don’t have specific modelling advice. My role as creative director of full videos \/ short films is something I’m trying to use my experience on for giving you advice.",
        "ts": "1554300975.000800",
        "username": "Fraser (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-03\/599853725735_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Fair enough :blush: hopefully by Sunday I will have Act 1 animated and edited together for you to see",
        "ts": "1554306238.000900",
        "username": "Paris (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-03\/599422024709_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Awesome! Look forward to it ",
        "ts": "1554313858.001000",
        "username": "Fraser (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-03\/599643660533_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]