[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I actually wanted to get into film production originally, as I'd been making crappy films with my friends since the age of 12 and editing them together, I really enjoyed that stuff. I followed that drive through high school and tried to learn more about the general field, and through that I discovered after effects, where I realised I was having a lot of fun! I realised when I was about 16 that visual effects was where my true passion was and I went full on into learning about it. Then for a couple years I was messing around and having fun with it and decided to pursue it at University, so I found the best course I could in the UK (University of Hertfordshire) and applied, and I managed to get a place :slightly_smiling_face: Then it was 3 years of super hard work (as i'm sure you know very well) and I got onto an internship in my 2nd year summer at MPC. Then when I graduated I got a comp job at a TV\/Commercial studio in London and worked there for a year and a half, now I'm here at ILM!",
        "ts": "1568363870.002300",
        "username": "Liam Barlow (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-13\/759113530965_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I'd say that one of the biggest things for me getting to where I got was the fact that I spent so much time during uni learning in my spare time and practicing comp stuff and just trying to nail it down as much as I could on my own so that I could try to stand out from the massive wave of the same coursework that recruiters would see coming out of our course, so by the end of uni I had a fairly decent reel that I was proud of :slightly_smiling_face:",
        "ts": "1568363982.002400",
        "username": "Liam Barlow (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-13\/759108459104_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]