[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yea so Buildbox is mostly for a mobile side of things. It’s like kind of a mini game engine to quickly make prototypes. The Houdini thing came from my first class I took over at gnomon. I’m actually taking classes over there for the most part currently for Houdini. Right now I wonder if you know one of my teachers he works over at The Mill too! His name is Peter Claes. You hangout with anyone outside the 3D modeling department like Vfx and Animation?  \n\nOverall I do like to be able to make more creative decisions game design related, but I also like working in a smaller teams to gear more ideas and collaborations too. \n\nYea my website is pretty outdated I still haven’t put the new stuff from the indie game I worked on last year, but thank you I’ll def. make sure to add more break downs and work flows! \n\nI saw on your profile from the program here your also learning like real time vfx and real time game engine type stuff too?  ",
        "ts": "1566228451.004600",
        "username": "NicholasKim (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-19\/733131683430_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "This industry is definitely a small world! I'm good friends with Peter!! He's an excellent teacher\/supervisor and I would highly recommend following any instructions or advice he has! I really respect him and hope that when I'm a supervisor one day I can learn to follow his examples he sets for his team. He's honest and about the industry works so don't hesitate to ask him questions.\n\nI always try to hang out with other people outside of modeling\/texturing. I'm good friends with a lot of people in lighting, FX, compositing, production, and even a few of the guys in the finance department. lol You always want to talk to everyone, even if they aren't in the same department because you never know when you'll have to work with each other :slightly_smiling_face: And having an establishing friendship makes working a lot more fun. Do you talk with other students at Gnomon as well?\n\nYeah keep your website updated with any new stuff you make! It shows employers that you are constantly doing things, even if they aren't paid projects and just personal projects that shows you're eager to work. :slightly_smiling_face: Breakdowns help show how your work looks and helps judge on what could be improved and what you're good at! Also consider maybe having a bit higher resolution images to your website if possible! Like 1080p renders\/images would be perfect to have up.\n\nI'm trying to learn more real time game engine things as well! So maybe you can help me with advice on how to get started on that? lol I'm considering learning Unreal and making a short film in it. Real time engine is definitely heading to the way of the future with VFX and I want to make sure I get a good start on learning how to do it. I know real time engine is definitely a different method of working compared to VFX so I'm eager to learn it lol",
        "ts": "1566240996.004700",
        "username": "Samantha (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-19\/733415061734_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]