[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Good news finals are over so now I can focus on personal projects again lols. How have you been doing? Hope your project is going well!\n\nI’m trying to work my way back into the game industry to learn more about game design work. Although I feel to actually have my foot back into the door need to work back up my 3D portfolio. It’s fairly odd which i feel I’m split in time in working how to design with unity while also trying to come up with portfolio projects for 3D work. Do you think at this point I should be focusing more on learning game development more or 3D portfolio work more? I figure I should choose one in order to get to where I want to more quickly than to jungle between the two. Thou I guess maybe in one respect I might use his to my advantage to implement very small micro games with 3D art to kill two birds with one stone... \n\nHave you ever heard of the Indonesian company called HeartMachine? They’re the people that did HyperLightDrifter. I actually applied there last week, but I’m also trying to look into other smaller studios to get a better hands on approach to game design too. Would you know any studios here in LA that are like that? ",
        "ts": "1568311082.000100",
        "username": "NicholasKim (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-12\/745611527506_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Lols not Indonesian sorry indie ",
        "ts": "1568311104.000200",
        "username": "NicholasKim (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-12\/751979811153_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yay congrats on finishing your finals!! I hope you get excellent grades on them! :slightly_smiling_face: I've been busy unfortunately, been working at least 65 hour weeks for the past 2 or 3 weeks so I'm pretty beat. But almost at the end! We deliver this job next Tuesday, then I have a week and a half of vacation! :slightly_smiling_face:\n\nHrmmm I see your dilemma. You want to work on game design more but you want some to work up your 3D portfolio more as well. For games is it normal for game designers to do 3D work as well? Or are they two entirely different roles? I guess it would depend on the game studio. If it's a small studio of a handful of people then you need to wear different hats and be able to do both. But if it's a bigger studio, they may want people to be mostly specialized in one role or another. I'd say take a look at a few job postings and see what most companies are looking for. Even if it's not a company you'd personally work at, just look at what they are expecting for certain roles and decide whether you want to work on one or the other, or you can do small micro games with 3D work as well!",
        "ts": "1568319067.000300",
        "username": "Samantha (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-12\/758571075120_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Not sure if you've come across this yourself but I found this site which lists all game studios in Los Angeles along with number of employees and job positions that are open. <https:\/\/gamejobhunter.com\/local-video-game-companies-los-angeles-area\/>",
        "ts": "1568319072.000400",
        "username": "Samantha (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-12\/758578042997_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "GameJobHunter",
                "title": "Local Video Game Companies - Los Angeles Area - GameJobHunter",
                "title_link": "https:\/\/gamejobhunter.com\/local-video-game-companies-los-angeles-area\/",
                "text": "Discover video game companies in Los Angeles, Irvine, and Orange County, see which studios are hiring. LA\/OC is one of the largest game dev hubs in the US!",
                "fallback": "GameJobHunter: Local Video Game Companies - Los Angeles Area - GameJobHunter",
                "thumb_url": "https:\/\/gamejobhunter.com\/wp-content\/uploads\/2017\/10\/henning-witzel-38848-e1508331560484.jpg",
                "from_url": "https:\/\/gamejobhunter.com\/local-video-game-companies-los-angeles-area\/",
                "thumb_width": 1296,
                "thumb_height": 864,
                "service_icon": "https:\/\/gamejobhunter.com\/wp-content\/uploads\/2018\/11\/cropped-600px-180x180.png",
                "id": 1,
                "original_url": "https:\/\/gamejobhunter.com\/local-video-game-companies-los-angeles-area\/"
            }
        ]
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I haven't heard of that indie company, but the game looks really fun and beautiful!! Good luck on the application! I actually have a friend that's working at a mobile game company, I don't remember which one though. I can hit him up and ask him what company he is at and if there are others like it!",
        "ts": "1568319188.000600",
        "username": "Samantha (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-12\/745799124386_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Ah he works at this place called Jam City! They have several locations and see to have quite a bit of openings on their website. The studio was also listed on that website I sent you.\n<https:\/\/www.jamcity.com\/careers\/#openings>",
        "ts": "1568319395.000700",
        "username": "Samantha (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-12\/758578021968_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "title": "Jam City",
                "title_link": "https:\/\/www.jamcity.com\/careers\/#openings",
                "text": "Jam City connects people around the world through great games.",
                "fallback": "Jam City",
                "image_url": "https:\/\/jamcity-corp.akamaized.net\/wp-content\/uploads\/open_graph.jpg",
                "from_url": "https:\/\/www.jamcity.com\/careers\/#openings",
                "image_width": 250,
                "image_height": 250,
                "image_bytes": 163623,
                "service_icon": "http:\/\/jamcity-corp.akamaized.net\/wp-content\/themes\/sgn_2014_06_01\/images\/jc_thumbnail.png?v=52",
                "service_name": "jamcity.com",
                "id": 1,
                "original_url": "https:\/\/www.jamcity.com\/careers\/#openings"
            }
        ]
    }
]