[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yea speaking of which how are vfx pipelines integrating real time engines for? As far as what I know in terms of rendering there is only like a hand full of AOVs or passes you can get in real-time like unreal and unity? Is it more or a pre viz kind of thing?  ",
        "ts": "1566891672.000100",
        "username": "NicholasKim (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-27\/741457818822_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Ah well at the mill we have a separate department that's using real time engine for things, like the latest one was a music video for an artist called Cashmere Cat. I wasn't involved in the project but I can ask some of the people who were on it if there was a pipeline for it! As far as I know there really isn't a lot of AOVs or passes to use for Unreal at least so a lot of it has to be just in engine, kind of difficult to work as a pipeline in it. I did an AR project for a movie and it was kind of how do you say it... like the wild wild west lol No established pipeline, we were just told to updated a certain file whenever we had model updates.",
        "ts": "1566931046.000200",
        "username": "Samantha (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-27\/741911451831_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Lols yea I was wondering if then the real time engine would just finish all the renders or render those passes of which ever kind and finish comping with Nuke or something of the like. I was really interested in how to work with AR can I see what you did? ",
        "ts": "1566961646.000300",
        "username": "NicholasKim (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-27\/740518745888_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]