[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yeah it's a tough one. Personally I would rather live somewhere else but there's not enough work to support it. Freelance especially would be very difficult anywhere but London unless you have a regular clients who don't mind remote working.",
        "ts": "1574953279.003400",
        "username": "Jamie Harris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-28\/852969765824_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "So mainly we have had a couple of big turnovers this week, which is a delivery of shots from the client consisting of raw plates along with all the metadata, elements and production information we need to successfully carry out the VFX work that Milk has bid for (not sure if you would have heard the phrase turnover before, apologies if you have).",
        "ts": "1574953890.003500",
        "username": "Jamie Harris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-28\/852982137728_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That means a lot of downloading, ingesting plates into the system, checking and outputting materials for the artists.",
        "ts": "1574953917.003600",
        "username": "Jamie Harris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-28\/852992212757_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Editorial is very data heavy so a lot of logistics of what needs to go where and sending &amp; receiving deliveries, packages, turnovers, whatever the client likes to call it.",
        "ts": "1574953998.003700",
        "username": "Jamie Harris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-28\/852993678901_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Though we also drive reviews, dailies and client screenings along with anything else that one of the team might like to review in one of our screening rooms.",
        "ts": "1574954043.003800",
        "username": "Jamie Harris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-28\/852985077312_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Other departments work on a shot by shot sort of way. They will be assigned a certain number of shots via Shotgun (a browser based production tracking tool, dunno if you know it or not?) then have a deadline to reach certain stages, receive notes, make amendments etc.",
        "ts": "1574954126.003900",
        "username": "Jamie Harris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-28\/852529224212_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "One nice thing about Editorial is we are involved in every step of the process and get to see everything and interact with clients, directors etc. The main drawback is probably lack of direct creative input. Though we do cut reels and promotional materials, I also do a fair bit of MGFX when I can.",
        "ts": "1574954218.004000",
        "username": "Jamie Harris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-28\/852997995861_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "As for CVs, they are definitely very important. I think almost all studios will ask for a CV when you apply, though whether they will want a reel depends on the role and also varies between companies. I will send a draft of my CV on here if I can, once I have redacted some personal details. Though everybody's CV looks different and I couldn't say whether mine has been effective or not though I am currently employed so I guess that's a good thing.\n\nNetworking is very useful though quite difficult when starting out and mainly seems down to chance whether it will be of any help. I was really bad at networking when I was looking for my first job, I did bump into someone who forwarded my CV on but not sure how much that helped in the end. It gets easier once you have been working for a while as it's not a big industry so you will bump into people you've worked with before. Also makes it easier to find more work as you get more experienced which is an annoying catch 22.",
        "ts": "1574955057.004100",
        "username": "Jamie Harris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-28\/841536433187_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]