[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Charlotte, how's it going? Nice to e-meet you. Not sure what you know about me already but I'll do a quick summary just in case.\n\nI've been working in Animation and VFX for about 5 years, starting out as runner\/edit assistant at a studio called Jellyfish Pictures and moving up as Assistant Editor across a couple of different animated TV series. I then returned as a freelance Series Editor about 18 months ago. Now I am a VFX Editor at Milk, a high end VFX studio, working across various TV series and feature films.",
        "ts": "1574430831.001600",
        "username": "Jamie Harris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-22\/834064167603_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I got a copy of your application from Prospela, in which you mention wanting to learn more about the VFX industry. I'd be happy to answer any questions you might have about the industry, what roles there are and which skills to develop, so ask away. :slightly_smiling_face:",
        "ts": "1574431046.001700",
        "username": "Jamie Harris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-22\/832753869250_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Jamie, great to meet you! Thanks for the summary of your career thus far - that's very useful in itself. \n\nI do not want to bombard you with questions, so maybe you could tell me a little about your education background? Do you think it was important in getting your first job at Jellyfish Pictures?\n\nCurrently I am trying to make my first step into the VFX industry. I am coming from a predominantly fine art background, specialising in moving-image, so navigating the VFX industry from the outside is quite limiting. I'm just trying to figure out how my skills fit into the industry, and how to present my skills to potential employers.\n\nThank you for your time!\n\nCharlotte",
        "ts": "1574456587.001800",
        "username": "Charlotte Cook (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-22\/846233526069_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]