[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Glad that wall of text was useful! Yeah, I think using your CV and making sure you have a good point for everything listed, how it shows you would be a good fit for the role, would be very helpful in giving you lots of ammunition\/things to talk about in interview.\n\nI haven't seen many portfolios for anyone other than illustrators\/story artists however if you feel it would be helpful then it might be good to prepare something. It's certainly not a bad thing that you have material to demonstrate the points that you raise and gives you something to talk about. I think the only thing I would think about would be how relevant that material is, also not to focus on it too much or get bogged down and stick to talking about the role being offered and why you are a great candidate.\n\nA showreel may be more useful (and more relevant for TV &amp; Film studios). This can be an effective, quick way of showing your work and your skills and impress the interviewer. I've noted some tips on reels for you below, as with everything they are just my opinions:\n\n• Make sure everything on your reel is relevant to your field and the role you are applying for. Don't be afraid to recut your reel for each application or have role specific reels.\n• Keep it short, around 60 to 90 seconds is a good length IMO. This is totally subjective and depends on where you're applying to, though anything over this could cause the viewer to get bored, switch off or move on to the next application.\n• Similarly, start with your best work. Grab their attention and then show more examples of what you can do however the first thing they see is likely to set their impression of you. \n• Finally keep it simple. No flashy titles or graphics unless that is directly relevant to the role you are applying for. \nLet me know if any of that is useful or if it's just really obvious ha, apologies if it is.",
        "ts": "1580921789.000200",
        "username": "Jamie Harris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-05\/937821732804_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]