[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Here's some interview tips for you, some stuff I have found useful in the past. I think a lot of it is down to you as a person so these may or may not be helpful for you. If you feel like some of it just doesn't work for you then no worries.\n\nOne of the things I do is take my CV and bullet point the key points into an order which best fits the way I want to talk about my experience &amp; skills. For me the best way to do this is chronological so I start at the beginning of my career and run through my experience up to this point. Trying to stay as relevant as possible for role I'm interviewing for, whilst picking out what I think are key skills and knowledge gained from each experience. For you this might be the start of your studies or around when you first started to think about working in the creative industries but your experience is different so a different order may work better for you. Find a way which works for you and how you like to present yourself.\n\nGenerally I try to make sure that I don't talk about any big things that aren't on my CV as this may catch the interviewer off guard so make sure all the key points you want to discuss are included. It's sort of an agenda for your interview although you can go into more detail on things and definitely try and elaborate on any skills, experience etc that you think they will be looking for. Also try and find out about the company and role beforehand so you know about their work. Might not apply for ScreenSkills but for other studios etc. make sure to watch some of their work so you can comment on it if asked. A lot of companies will ask you what you know about them so good to have a couple of things on hand to talk about rather than not be able to answer.\n\nThis might be the most obvious point ever but try to relax. I used to get extremely nervous and anxious about interviews and a couple of things really helped me out. Firstly I would always find a cafe or park (weather dependent) near where the interview was taking place and get there about half an hour to an hour early, take a book and try to relax for 15 minutes, not thinking about the interview. Knowing I was there in plenty of time helped alleviate some of worries I would have about trains being delayed, running late etc. Another thing was thinking of it as a chance to interview the interviewer; having my own questions prepared and re-framing the interview in my head so it was more of a meeting between equals, rather than the interviewer holding all the power with me being desperately trying to say the right thing. \"Is this the right job for me?\" rather than \"Am I the right person for the job?\" This helped me feel a lot more relaxed and confident whilst focusing on what I wanted to get from the interview allowed me to stay on track and get my points across.\n\nOf course this is what works for me and might sound like it's totally wrong for you but I hope it helps. I'll try and think of some more things and send them when I can.",
        "ts": "1579710837.000300",
        "username": "Jamie Harris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-22\/907166539473_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]