[
    {
        "type": "message",
        "text": "<@U61PV8VEW> \n*SCHOOL'S OUT FOR SUMMER! :sunny::sunny::sunny: Today is the last day of our pilot e-mentoring programme!*\nAs mentioned, be sure to finish up your conversations \/ Career Plans with your E-Mentors by 11:59pm this evening as we'll be pulling the data for our _final leaderboards_ then and we can't guarantee your E-Mentors will be available beyond that. You'll still be able to access the platform until mid-next week when we'll be sharing the final leaderboards and prizes!\n&gt; Feel free to exchange details with your E-Mentors if you'd like to continue the conversation.\n\n&gt; Otherwise, THANK YOU so much for being part of our *very first* Prospela pilot!! We wouldn't have been able to do any of this without your impressive efforts &amp; commitment and are truly flattered that you gave up your precious time to be part of it - so thank you! We hope you learned something and made a few new professional connections along the way that you can build upon. Hope to see you at our next (larger scale) programme in Sept\/Oct!! :hero::clapping::clapping::hero:\n\n&gt; P.S If you have a LinkedIn profile, be sure to add your Prospela experience to it! Also you can find me (Emma Sullivan) and Dexter Boyce on LinkedIn if you'd like to add us as connections and follow Prospela here on LinkedIn: <https:\/\/uk.linkedin.com\/company\/prospela> and Twitter: <https:\/\/twitter.com\/ProspelaCo>",
        "user": "U4V22C6A1",
        "ts": "1500642807.848737",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "52b8fca5eefd",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-20\/200807858901_52b8fca5eefdbb8ad2b9_72.jpg",
            "first_name": "Emma",
            "real_name": "Emma",
            "display_name": "emma-prospela",
            "team": "T4UUTPV18",
            "name": "emma-prospela",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "title": "Prospela (@ProspelaCo) | Twitter",
                "title_link": "https:\/\/twitter.com\/ProspelaCo",
                "text": "The latest Tweets from Prospela (@ProspelaCo). A professional network for school &amp; university students, allowing on-demand access to employee E-Mentors for career discovery, live insights &amp; action planning. London, England",
                "fallback": "Prospela (@ProspelaCo) | Twitter",
                "from_url": "https:\/\/twitter.com\/ProspelaCo",
                "service_icon": "https:\/\/abs.twimg.com\/icons\/apple-touch-icon-192x192.png",
                "service_name": "twitter.com",
                "id": 1
            }
        ]
    }
]