[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Patrick,\nsorry for the late reply. I'm super busy at work right now since I'm working on the main hero character for our newest big creature show. So I'll mostly reply late at night or on the weekend :sweat_smile:\n\nI see you have done a variety of assets already! That's great! Always good to have that down.\nAlso good call to attend the VES pub night. Usually I go there as well, I just missed it this month because of work. Most people there are super relaxed and it's easy to get to know new people that might be relevant to you in the future. As long as you don't go there with the sole purpose of promoting yourself. People tend to get annoyed when someone is clearly trying to talk to them because he wants them to get him a job :stuck_out_tongue: Just going there and having fun usually works best :wink:\n\nHow do you want to approach this mentorship? Is there anything specific you want my advice on? Would you like me to have a look at some of your work and see if we can improve upon it?\n\nI understand you are in third year so I imagine you want to break into the industry soon. Is there any specific position or company you would like to work in?\n\nOne of Us is a really nice place to be. I started there last year in June and since then the company has more than doubled in size and changed a few of their core workings significantly. They used to do mostly outsourcing work for some of the bigger studios but for 2-3 years now they have been getting very good chunks on some of the really big shows as well. They generally manage to balance everything quite well. Meaning they try to only take on work they are genuinely excited to do and don't try to handle a volume of work that they can't handle. So usually it's smaller but really cool parts on big shows. However, since they started expanding so much we have been getting bigger chunks and sometimes even whole films to do the VFX for by ourselves.\nThey also care about their employees and do a lot to build\/maintain a comfortable work environment, unlike some of the bigger studios. That is one of the advantages of a smaller studio where you actually know the CEO by name :wink:",
        "ts": "1583003516.001500",
        "username": "Alexander Breitfeld (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-29\/975664714965_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]