[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hello Alex,",
        "ts": "1583250134.001600",
        "username": "Patrick Paguio (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-03\/966804763298_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hello Alex,\nIt's all good don't worry! :d Best of luck with your main hero character! Yeah I just realised that before as well at my first VFX pub night and it's best to just chill and have fun. In regards to mentoring, I would really appreciate it if I get feedback on some of my works and how I can improve it more? Any tips or advice on what to think, how to prepare assets for production work, etc? The companies I'm aiming for are ILM, DNEG, Framestore, Cinesite, or companies in other countries like Image Engine, Scanline VFX, Blur Studios, Blizzard Cinematics, and more. But for now, I want to focus on Films and TV. If I managed to get into Advertising, that's perfect for me as well like ETC and The Mill. I am applying for a modelling, texturing and look development position. At the moment, I want to go to texturing and look development pipeline, and I wouldn't mind a modelling position either if I managed to get into one of the big companies.",
        "ts": "1583250687.001700",
        "username": "Patrick Paguio (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-03\/979160196724_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "It seems that you're really having fun at the company and that's really nice :)) I just wonder what's the culture like? How intense the work can be and how long do you guys take to final work for clients? Are there any training services?",
        "ts": "1583250792.001800",
        "username": "Patrick Paguio (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-03\/969518936769_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]