[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Alright, so you want to go for high end VFX then. That's great! I know everyone wants to go work at ILM coming straight out of Uni, But actually I have found smaller studios to be very accessible in order to set foot in the industry. Working at thos big studios like, ILM, Weta, Framestore, etc. gets a lot easier once you have worked in the industry for about 3 years. That is usually when you move from Junior to mid level artist and it opens up a lot of doors.",
        "ts": "1583367608.001900",
        "username": "Alexander Breitfeld (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/971243404995_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Don't get me wrong, I know a bunch of people who went to MPC or DNeg right after graduating but it's great that you are open about where you want to work. Every studio has it's up and downsides. A lot of times a studio will also feel very different depending on the show you are working on. So you might work at a great company but the one show you are working on is just particularly chaotic and it's not the norm.",
        "ts": "1583367942.002000",
        "username": "Alexander Breitfeld (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/984579490039_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "As long as the general company culture supports  that you integrate well into your department it's all fine. Having a good atmosphere and people you like to work with around you is the most important to me. Even when crunch time hits your whole team and there are a couple of rough weeks, doing it together with your friend and pulling it off in the end feels pretty rewarding :wink:",
        "ts": "1583368160.002100",
        "username": "Alexander Breitfeld (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/984583488231_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "In my experience overtime and stress level is also very dependent on the department you work in. Everything shot related is usually linked to more overtime as it is directly affected by trailer deadlines etc. So comp and lighting are the worst offenders when it comes to overtime :confused: I have definitely noticed the shift since I transitioned from lighting to groom. Switching from shot work to assets I do very little overtime. It's a lot more relaxed because the assets are build a lot more in advance. Sometimes even before you even get the plates they shot.",
        "ts": "1583368360.002200",
        "username": "Alexander Breitfeld (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/969937317538_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "So modeling, texturing, shading, groom, etc. is usually rather relaxed. Of course you  have the occasional deadline and maybe a bit of crunch but not much, Most times the assets need to be adjusted as soon as they are being used in a shot anyways and then you get more time to to the tweaks",
        "ts": "1583368535.002300",
        "username": "Alexander Breitfeld (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/969940643346_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I'm not at home this weekend so I may not get to it that quickly but I'll try to have a look at your reel on Sunday evening or early next week and give you some feedback :smile:",
        "ts": "1583368631.002400",
        "username": "Alexander Breitfeld (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/982748534101_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]