[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Nathanel. My first job was using max actually, I preferred it to maya for a while but eventually Maya copied most of what was good about it for animation! Ever since then every 3D job I've had (which is most of them) has used Maya, it's the standard. Although know a few places that are moving away from it in favour of Blender. Not sure if Max is still used a lot in games as that's not my area but I've seen a lot of behind the scenes at studios like Naughty Dog that are animating in Maya. What made you decide to learn Max? Ultimately in animation the tools are all transferrable whatever software you use. It's great that you are developing your art skills, that'll really help with animatoin particularly if you get good at strong poses.",
        "ts": "1579863044.000300",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-24\/922353369847_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "My animation inspiration was definitely Wallace and Gromit, the 3 first short films came out when I was between about 6 and 10 years old so I was always filming little plasticine animations.",
        "ts": "1579863143.000400",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-24\/920512787109_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I love the technical side though so when we got our first computer I got into CG animation and kept making things that way. We're talking around 1999-2000ish so it wasn't easy to find information on all that stuff. I envy anyone starting now, it's so easy to find information now!",
        "ts": "1579863285.000500",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-24\/922705611862_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]