[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "As I haven’t been on such a path, I find it difficult to answer that from direct experience. My roles have always been within organisations and never entrepreneurial. I have lead many projects but nothing as revolutionary as amazon Alexa :). I don’t want to give you waffle, or just generic notes, so my advice would be to thoroughly write up your ideas, always, and keep networking and to try to talk to people who’ve been through that path. Alternatively, there are a lot of published biographies of famous entrepreneurs which might help. I know a few people who really find those inspirational. Or ask @dexter to see if there’s anyone else on this platform who might be able to give advice from direct experience. Is this a general question or do you need help with a specific project?",
        "ts": "1553241278.003000",
        "username": "Daffer Al-Faiadh (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-03-22\/586236047318_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I don't nessesarily need it, but I have modelled several 3D concepts of tech items I feel could be of use",
        "ts": "1553241734.003100",
        "username": "Ra'ed (Mentee)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-03-22\/576225976305_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Have you looked at sites like the google science fair or the princes trust innovate uk? Just a quick google around and I found these which seem to give advice or guidance. I haven’t personally used or deeply looked into either so I cannot tell you from experience. But, there seems to be a few platforms out there which should be able to support you.",
        "ts": "1553243307.003200",
        "username": "Daffer Al-Faiadh (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-03-22\/584705868915_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Funny you say that, turns out I am 5 years young to enter the google science fair haha",
        "ts": "1553279875.003300",
        "username": "Ra'ed (Mentee)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-03-22\/585343315315_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]