[
    {
        "type": "message",
        "text": "*Just over 1 week left of our pilot programme* <!channel>\n:grin::flushed::scream:\nWe wrap up our pilot e-mentoring programme on the 21st July, so be sure to make the most of your E-Mentors!\n\n*This could be your last chance to enjoy relaxed, unbiased and frank conversation with real employers before you enter the workforce*. Ask all of those _juicy_ questions about work life that you've wanted to know as well as soak up the tips and secrets that your mentors have learned throughout their years of experience!\n\n:point_right:*Your challenge for this week* is to complete the 3rd and final section of your career plan with your E-Mentors by Wed 19th July. Now that you've discovered a bit about what you'd like to do and what work life of your E-Mentor is like, use the last section to lay out the road ahead and the steps you can start taking today to get you where you need to be! As before, use the question prompts we've listed to get the answers you need from your E-Mentor! \n\nMake the most of your E-Mentors whilst they are still ready and waiting to help you through the Prospela platform!\n:muscle::muscle::muscle:",
        "user": "U4VR52RQE",
        "ts": "1500028360.742917",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "d730c1e93535",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-20\/201542361287_d730c1e93535ae06c852_72.png",
            "first_name": "Dexter",
            "real_name": "Dexter",
            "display_name": "dexter-prospela",
            "team": "T4UUTPV18",
            "name": "dexter-prospela",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "edited": {
            "user": "U4VR52RQE",
            "ts": "1500029234.000000"
        }
    },
    {
        "type": "message",
        "text": "*Just over 1 week left of our pilot programme* <!channel>\n:grin::flushed::scream:\nWe're wrapping up our pilot E-Mentoring programme on the 21st July. *This could be your Mentee's last chance to enjoy relaxed, unbiased and frank conversation with real employees like you before they enter the workforce*. So be sure to use this last week to point them in the right direction and try to complete the Career Plan with them which will last long after the pilot finishes.\n\n:point_right:*Your challenge for this week* is to help your Mentee(s) complete the 3rd and final section of their Career Plan by Wed 19th July. Now that you've discovered a bit about them and they have seen what your working life is like, use the last section to lay out the road ahead and the steps they can start taking today to get them where they need to be! As before, you can use the question prompts we've listed to aid the discussion.\n\nDon't forget to provide them with a generous sprinkle of #employerskills - we've had great feedback from students saying that this really does help them understand how to display skills employers value. \n\nAnd of course we will be having our final leaderboards at the back end of next week :clapping:\n\nSo let's Go!\n:muscle::muscle::muscle:",
        "user": "U4VR52RQE",
        "ts": "1500030414.326423",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "d730c1e93535",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-20\/201542361287_d730c1e93535ae06c852_72.png",
            "first_name": "Dexter",
            "real_name": "Dexter",
            "display_name": "dexter-prospela",
            "team": "T4UUTPV18",
            "name": "dexter-prospela",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "edited": {
            "user": "U4VR52RQE",
            "ts": "1500031398.000000"
        }
    },
    {
        "type": "message",
        "text": "here are some personal stats on you and your conversation with your mentor. Thanks a million for your involvement so far! The mentors have been really enjoying their conversation with you all and have given some great feedback :ok_hand:. We hope the stats also give you an idea of the interaction you have been having and provide plenty of fuel for conversation over the remainder of the programme up to the 21st July. :thinking_face: At the end of the programme we will of course have a another prize giving! But also have many more stats to share on performance and progression so keep your eyes peeled :laughing:",
        "user": "U4VR52RQE",
        "ts": "1500058046.516354",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "d730c1e93535",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-20\/201542361287_d730c1e93535ae06c852_72.png",
            "first_name": "Dexter",
            "real_name": "Dexter",
            "display_name": "dexter-prospela",
            "team": "T4UUTPV18",
            "name": "dexter-prospela",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    }
]