[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hello Ida, sorry for the late response, I my notifications on here don't always work so I miss a lot of messages.",
        "ts": "1554463520.000200",
        "username": "Neal Patel (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-05\/601559382996_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I started as a graphic designer, so was not always into VFX. I worked at Sky in their graphics and motion graphics teams and didn't really know much aobut VFX at all. The VFX department next to ours and so that's how I found out about it and when they had an opening for a junior compositor, I thought it would be interesting to try. I saw the cool work coming out of the department and wanted to be apart of it. I had not even heard of Nuke, so in short, no i didn't always want to work in VFX but I enjoyed it once I was doing it",
        "ts": "1554463742.000300",
        "username": "Neal Patel (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-05\/592867891665_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I terms of the director, I don't really work closely with them. Once we finish our shots, it gets get to the client who presents it to the director. We then get feedback notes from him\/her so there is rarely direct communication. They may pop into the office now and again however, would generally deal with the owners of the company rather than the artists",
        "ts": "1554463879.000400",
        "username": "Neal Patel (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-05\/599182474656_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]