[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi there Jess, nice to meet you! Thanks for your interest in talking to us at access vfx and for putting all this effort into studying animation by yourself!\n I hope I can help you with any questions you have! I'll try and answer you as well as I can based on my experiences, but if we come across some subject I'm not well aware I can search some resources for you to look into.\nIt's been 8 months I'm working in the UK, before that I had been living and working in Brazil, where I'm from. I have worked on several stages of animation productions, but especially with storyboards and 2d traditional and cut out animation. I'm currently doing animation on a new tv series called It's Pony that just launched this january on nickelodeon.",
        "ts": "1583926983.001900",
        "username": "Marcelo Perin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-11\/993377418304_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Before I came to the UK I had been storyboarding for animation for 5 years. It's sometimes hard to do only only thing in animation because you never know what's next and what shows will be in production. I've started in animation, but moved to storyboard and I'm back to animation now. I really like storiboarding though, mostly because I get to draw free hand (since most productions are cut out animation now) and also because you usually get to do a whole episode by yourself, and I like the idea and the process of reading a script and translating it in its entirety to schemes, shots and acting.",
        "ts": "1583927031.002000",
        "username": "Marcelo Perin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-11\/981911440595_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]