[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Nili- Sorry! In all this madness I thought I'd sent my comments...anyway firstly, From Up High is a lovely understated and emotive piece, and a great 'calling card'. Your layout pieces and characters are well composed. Have you already sent emails to the likes of BlueZoo\/Beakus\/Karrot etc? In terms of Character animation, I'd suggest that you consider some animated studies of character- what I mean is that your piece From Up High rightly has a subtle range of animated gestures (rightly, due to the nature of the emotive impact) but a recruiter might want to know you have a wider range of poses and motivation you can handle. Characters jumping obstacles, reacting with surprise etc - big emotions that recruiters handling commercial outputs might want to see. It maybe in your back catalogue you already have a study\/exercise you can brush of and modify? A tip is to look at an a trailer from a company you'd like to work at, and tailor your exercise to make it look like it would fit into their reel in terms of action.",
        "ts": "1586850267.000200",
        "username": "Saint John Walker (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-14\/1060732703555_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Secondly, have you entered your piece into festivals? Its worth it even if you dont win anything.",
        "ts": "1586850332.000300",
        "username": "Saint John Walker (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-14\/1060734980435_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Lastly, get yourself out there- start a dialogue with those companies (if you havent already- I know Steve R. has lots of contacts). It would be useful to know where you are with this- if you haven't 'launched' yourself yet then we can talk about this. If you have but got little response we can talk about this too. Let me know! i'll try to keep a beady eye on this thread now! Apologies again for my invisibility, but things are stabilising now so I should be more available- here's hoping you are ok and are able to keep creative, best wishes, Saint",
        "ts": "1586850671.000400",
        "username": "Saint John Walker (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-14\/1067000347316_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hello, Saint, \nLovely to hear from you! \nYes, im compiling a new animation reel and will send that over to you as a link once I'm done with it. How does that sound? Though, my interest lies in pre-production work and art! Is it still necessary to have more animation? \nI was thinking of applying to internships like blue zoo's. Is it advisable to apply for internships with a portfolio like mine?",
        "ts": "1586855202.000500",
        "username": "Nili B. (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-14\/1060918109843_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yes, I have submitted my film to a few festivals and I received a positive response from two already but most of them are delayed because of covid related issues, haha. The ones that it got selected in announced results before the outbreak but they might not be very reputed.",
        "ts": "1586855339.000600",
        "username": "Nili B. (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-14\/1054817844230_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "And I haven't 'launched' myself just yet! I did apply for a few internships last year but back then I did not have an online website or as much work as I do now. I will start work on building a resume soon as well. Any tips for the same?",
        "ts": "1586855524.000700",
        "username": "Nili B. (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-14\/1083508955616_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "&gt; &gt;&gt;Is it advisable to apply for internships with a portfolio like mine?         Yes, the rule is you let them make the decision! Remember, they will see things that you may not even be aware of, so by putting yourself 'on the list' you at least have a chance...as long as you want an internship of course!",
        "ts": "1586867407.000800",
        "username": "Saint John Walker (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-14\/1073265337073_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "&gt; &gt;&gt;my interest lies in pre-production work and art! Is it still necessary to have more animation?   No, bigger companies tend to want more specific roles, whereas tinier ones are looking for generalists. So, by having a range on a reel you open up the kind of conversations like \"we've got no layout artist roles right now, but I see you do character work? Would you be interested in...\"",
        "ts": "1586867623.000900",
        "username": "Saint John Walker (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-14\/1047190219703_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]