[
    {
        "type": "message",
        "text": "Hey apologies for the delayed response! Been very busy with work recently! \n\nOh right, well I think most uni courses will involve seminars or lectures\/lessons as that's just part of education really! But as long as it's not all that? But really it sounds like you want to be able to start working\/ apprenticeship kind of thing if that's how you learn best? \n\nOkay well that sounds like like it should be interesting! Sounds like a good choice for you then! \n\nAh good question! <@U5XTUA3HT>\/curiosity. So basically as a recruitment consultant, it is my job to find companies people to work for them. They give me a specification of their ideal candidate, and i go out and find the right candidates and 'headhunt' people. This involves interviewing them all and then setting up interviews with my clients (the companies I recruit for) and then (hopefully) placing them into the job. I wasn't actually looking for this job, I was just looking for a sales job. But this came about and it's a sales job by working to targets to make a certain amount of money etc, I guess I have got to where I am now by working really hard, learning what I could, when I could. A lot of resilience needed for the job as I get a lot of rejection when cold calling and that but it's great fun when I place people into jobs, and plus I get commission for each person so that makes it a lot better too! ",
        "user": "U5WRFMCCA",
        "ts": "1498600048.150129",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "fe9db945c7f4",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-20\/201684935670_fe9db945c7f4b64a40b9_72.png",
            "first_name": "Elliot",
            "real_name": "Elliot",
            "display_name": "elliot0520",
            "team": "T4UUTPV18",
            "name": "elliot0520",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    },
    {
        "type": "message",
        "text": "Hope that makes sense, can't explain it that easy in a message without writing an essay! Lol ",
        "user": "U5WRFMCCA",
        "ts": "1498600176.183426",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "fe9db945c7f4",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-20\/201684935670_fe9db945c7f4b64a40b9_72.png",
            "first_name": "Elliot",
            "real_name": "Elliot",
            "display_name": "elliot0520",
            "team": "T4UUTPV18",
            "name": "elliot0520",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    },
    {
        "type": "message",
        "text": "Yes, I learn best by doing things which means actually working. I've also thought about doing an apprenticeship but i haven't looked really deep into it. (Plus i love working, doing things, keeping active. Yes I know it sounds a bit crazy, but i actually find working quite fun. I work in a hotel so it's always kind of busy and there's always something to do.)\n\nYes i understood what you meant, don't worry :joy: but between all of that do you like your job? Would you ever change career if you could? And if you did what would it be?",
        "user": "U5XTUA3HT",
        "ts": "1498600689.314016",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "6e7733bd8445",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-22\/201181455952_6e7733bd8445ebf2c0bb_72.png",
            "first_name": "Ivanna",
            "real_name": "Ivanna",
            "display_name": "ivannagioia",
            "team": "T4UUTPV18",
            "name": "ivannagioia",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    },
    {
        "type": "message",
        "text": "Yeah exactly it seems like an apprenticeship could be a good idea, perhaps you should probably look into it? There's loads of different ones so could be a good idea! Ah that's not crazy I like working too! Haha, oh cool what's your job there? \n\nOkay good! Yeah I definitely like my job, there's times where it's stressful and can be hard work, but it's actually a career and teaching me a lot and that's really valuable so I really appreciate that I have the opportunity to have a job like this. I'm not quite sure what I would want to do if I changed jobs, I would probably stay in a sales role, like a client facing role, as I now have a lot of experience in that area, but apart from that I haven't got many ideas what I could get into, as I've always wanted to be in a role like this really! \n\nDo you think you would ever enjoy having a job like recruitment?",
        "user": "U5WRFMCCA",
        "ts": "1498601482.504431",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "fe9db945c7f4",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-20\/201684935670_fe9db945c7f4b64a40b9_72.png",
            "first_name": "Elliot",
            "real_name": "Elliot",
            "display_name": "elliot0520",
            "team": "T4UUTPV18",
            "name": "elliot0520",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    }
]