[
    {
        "type": "message",
        "text": "Oh really? To be honest I get the exact same, I actually used to get quite bad anxiety around a lot of people, going to events, even parties etc, the more I surrounded myself with those environments and getting out my comfort zone the more it went away. I totally get what you're saying haha but yeah the more you do things out of your comfort zone the easier it gets, trust! :grinning: \n\nAh okay wel what about the photographical aspect of film? That ever interested you as your interested in photography?  But yes it is a very competitive industry. \n\nHahah that's very kind of you, neither of us have degrees, we just worked hard to get to it!\n\nApologies for being so slow at replying this last week, I have been In barcelona all week! How have things been with you? Have you been thinking more about future careers and jobs etc? I hope our conversations have helped you! \n\n",
        "user": "U5WRFMCCA",
        "ts": "1500627997.154204",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "fe9db945c7f4",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-20\/201684935670_fe9db945c7f4b64a40b9_72.png",
            "first_name": "Elliot",
            "real_name": "Elliot",
            "display_name": "elliot0520",
            "team": "T4UUTPV18",
            "name": "elliot0520",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    },
    {
        "type": "message",
        "text": "The photography aspect of it? As in the camera crew? Filming and etc...\n\nThings have been going great, I'm out of school for 6 weeks, which is great!\nI've taken a break of thinking what I'm going to do, or what job I'll would like to have in the future, or what Uni or apprenticeship i want to do. \nI've been stressing a lot in that aspect. So I'm trying to not think about it for just a few days.\n\nYes our conversations have helped me lots, thank you!\nAlso i just wanted to thank you for helping me get a better view of what other things i could do, I know you are not an expert in the subject that i want to do; but still you have helped me a lot, so thank you. And also for replying i know you are a very busy man, so thank you for taking time out of your day to reply and help me with my future.",
        "user": "U5XTUA3HT",
        "ts": "1500628599.353543",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "6e7733bd8445",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-22\/201181455952_6e7733bd8445ebf2c0bb_72.png",
            "first_name": "Ivanna",
            "real_name": "Ivanna",
            "display_name": "ivannagioia",
            "team": "T4UUTPV18",
            "name": "ivannagioia",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    },
    {
        "type": "message",
        "text": "Not just filming, but they have to know where to take the shot, the lighting, the after effects including like the colouring of the shots etc, there's loads of different aspects to it! \n\nAh nice 6 weeks is a good bit of time out! (I'm jealous haha) okay I understand that, the fact that it's stressed you out means that you care about it though which is good, don't loose that! Passion for what you want to do in the future, and just in life is really important. Anything that interests you, look into it more and see what kinds of jobs you could do. It's difficult for anyone to know what they want to do, but to get into an industry you have passion in, no matter what the job is, and to immerse yourself in it is so important. You won't always love your job, I certainly don't all of the time but that's just working life I think! Haha there's always some stress, but again that just means you care about it all. \n\nThat's great to hear, I hope so! You're very welcome, it's been my pleasure! :) I just hope that I gave some useful advice, remember you don't have to know exactly what you want to do but just don't leave it, just go for it :) and wel I'm glad you understand!!\n\nHave you got much planned for this summer then??",
        "user": "U5WRFMCCA",
        "ts": "1500629187.544247",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "fe9db945c7f4",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-20\/201684935670_fe9db945c7f4b64a40b9_72.png",
            "first_name": "Elliot",
            "real_name": "Elliot",
            "display_name": "elliot0520",
            "team": "T4UUTPV18",
            "name": "elliot0520",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    }
]