[
    {
        "type": "message",
        "text": "Oh nice, yeah I don't think there are many photography courses for kids either to be fair! \n\nOh okay so was it the theory and reading music etc? I was the same I never liked exams but enjoyed the practical side of things, so I totally understand that.\n\nYeah she enjoys it a lot! And okay well you may not think you're the best at that but you could explore different kinds of jobs within industries you have a passion for, like theatre and weddings, music etc. \n\nYeah I guess for a lot of subjects there is quite a bit of classroom type learning etc, but there would be some that are less of it. I have friends who have taken degrees in music production who had to write a bit but mainly were producing different styles of music as their coursework etc. You should look into the kinds of roles you are interested in and see what kind of education is needed in them?",
        "user": "U5WRFMCCA",
        "ts": "1498509833.538300",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "fe9db945c7f4",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-20\/201684935670_fe9db945c7f4b64a40b9_72.png",
            "first_name": "Elliot",
            "real_name": "Elliot",
            "display_name": "elliot0520",
            "team": "T4UUTPV18",
            "name": "elliot0520",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    },
    {
        "type": "message",
        "text": "I went to an open day (for a Uni) and they were talking about what the course involved, what we were going to do in the lessons and they also said that once in a while they were going to have seminars. That kind of put me off because i really don't like sitting around and listening to people talk, I much prefer to be active and being practical. (It was a photography course by the way)\nOn the 5th of July the school it's going to take us to an open day and we had to pre choose what course 'talk' we want to attend to, and there was an option of Musical Theatre so now i need to see how that goes.\n\nYou said your job is a senior Recruitment Consultant; what exactly is your job about? And how did you get to where you are now?",
        "user": "U5XTUA3HT",
        "ts": "1498511910.165504",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "6e7733bd8445",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-22\/201181455952_6e7733bd8445ebf2c0bb_72.png",
            "first_name": "Ivanna",
            "real_name": "Ivanna",
            "display_name": "ivannagioia",
            "team": "T4UUTPV18",
            "name": "ivannagioia",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    }
]