[
    {
        "type": "message",
        "text": "Ah okay so you will be doing quite a bit of photography over summer? How long have you been into photography for?\n\nOh okay no worries! I only ask I did music GCSE and it was very heavy on music theory (I play a few instruments by ear, and can't read music either) and despite getting A's in the composition and performances, I still got a bad grade as I couldn't read music, so maybe you would have to speak to the person in charge and find out how much it is based on music theory, if that makes sense! \n\nOkay you say 'apparently' do you not agree with them? Yeah you should look into wedding planning jobs as well, my mum plans weddings but for the party's at the end and designs the tables with centre pieces etc, so you could still look at roles in that industry but that don't have to be with textiles?",
        "user": "U5WRFMCCA",
        "ts": "1498414094.547624",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "fe9db945c7f4",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-20\/201684935670_fe9db945c7f4b64a40b9_72.png",
            "first_name": "Elliot",
            "real_name": "Elliot",
            "display_name": "elliot0520",
            "team": "T4UUTPV18",
            "name": "elliot0520",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    },
    {
        "type": "message",
        "text": "Have you got any plans for when you finish year 13?",
        "user": "U5WRFMCCA",
        "ts": "1498414151.550736",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "fe9db945c7f4",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-20\/201684935670_fe9db945c7f4b64a40b9_72.png",
            "first_name": "Elliot",
            "real_name": "Elliot",
            "display_name": "elliot0520",
            "team": "T4UUTPV18",
            "name": "elliot0520",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    },
    {
        "type": "message",
        "text": "Well I've been into photography since i was about 8 or 9 years old but back then i was living in another country and there weren't any type of course you could take or that I knew of.\n\nI also did music for GCSE I would have gotten a good grade if it wasn't for the exam (I'm not good at written exams or any type of exam that involves learning by reading or listening. I'm a more practical person, I learn by doing things or people teaching me how to do it.) \n\nI say 'apparently' because I don't really  know if she's saying the truth. I mean she is talking about MY work, which means obviously I will have doubts about it; because she's the teacher and I'm the student.\n\nYour mum's job sounds so fun! Decorating for the after party of the wedding! \nI'm not good at decorating places (making things look nice,kind of thing) but I'm good at making things :joy:\n\nWell I have my doubts if I should go to UNI or not, because usually its more academically based and learning things by listening or reading instead of doing. If that makes sense!\nBut I also need to think about more jobs now a days require a degree or a diploma of some sort. So i really don't know what to do.",
        "user": "U5XTUA3HT",
        "ts": "1498428489.275234",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "6e7733bd8445",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-22\/201181455952_6e7733bd8445ebf2c0bb_72.png",
            "first_name": "Ivanna",
            "real_name": "Ivanna",
            "display_name": "ivannagioia",
            "team": "T4UUTPV18",
            "name": "ivannagioia",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    }
]