[
    {
        "type": "message",
        "text": "Ah great news, did you have to go to a lecture on it? What excited you more about musical theatre than Photography?  \n\nHow come the apprenticeship didn't seem to relate to the subject? \n\nYes it's an important decision going to university and you want to try and be sure on it. Have you explored any subjects at university or apprenticeships that aren't musical theatre or photography?\n\n",
        "user": "U5WRFMCCA",
        "ts": "1499689239.896508",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "fe9db945c7f4",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-20\/201684935670_fe9db945c7f4b64a40b9_72.png",
            "first_name": "Elliot",
            "real_name": "Elliot",
            "display_name": "elliot0520",
            "team": "T4UUTPV18",
            "name": "elliot0520",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    },
    {
        "type": "message",
        "text": "It was more like a talk about what's the subject about and what we are going to be doing if we joined the course.\nI think what excited me most about musical theatre than photography was , the sense of community you could feel between the teachers and the students, plus the musical theatre course\/community (kind of thing) they are a small group of people which i work my best at (i cant handle meeting a large group of people in one day and also if there's a lot of people in one classroom and they ask questions, i wont be able to answer or ask questions myself because I'll get to nervous)\n\nI was looking at musical theatre apprenticeships and i literally didn't find anything.\n\nNo i haven't explored other subjects other than them two because i really don't know what else I'll choose or study. What other subjects do you think I might also be interested in?",
        "user": "U5XTUA3HT",
        "ts": "1499719315.625307",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "6e7733bd8445",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-22\/201181455952_6e7733bd8445ebf2c0bb_72.png",
            "first_name": "Ivanna",
            "real_name": "Ivanna",
            "display_name": "ivannagioia",
            "team": "T4UUTPV18",
            "name": "ivannagioia",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    }
]