[
    {
        "type": "message",
        "text": "No i don't do music outside school at the moment, but I've been looking for classes that do singing,drama and dancing; and I found this place kind of close to where I live, but the problem is that they only do lessons in school terms and there is only three weeks left until the summer holidays (the lessons are once a week for 3 hours)\nSo basically I'll be going for only 3 days and then I'll have to wait until September.\n\nI am doing photography for A levels, but sadly i was not able to do music because there were not enough people that wanted to do the subject. For  year 13 I was thinking of doing Drama for one year and if they decide to add music again I'll take it (music its a BTEC course in my school)",
        "user": "U5XTUA3HT",
        "ts": "1498290148.999480",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "6e7733bd8445",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-22\/201181455952_6e7733bd8445ebf2c0bb_72.png",
            "first_name": "Ivanna",
            "real_name": "Ivanna",
            "display_name": "ivannagioia",
            "team": "T4UUTPV18",
            "name": "ivannagioia",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    },
    {
        "type": "message",
        "text": "Oh okay, is that something you have wanted to do? (Like perform infront of people or with a band etc?) oh right I see, that's annoying you can only do it in term time, is there no other summer type ones available in your area? Or that do it all year?\n\nThat's good you're taking photography, how has it been going? Do you do much photography outside of school like your own projects or anything? That's a shame they didn't have enough people doing music for you to take it, can you read music? ",
        "user": "U5WRFMCCA",
        "ts": "1498309978.348552",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "fe9db945c7f4",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-20\/201684935670_fe9db945c7f4b64a40b9_72.png",
            "first_name": "Elliot",
            "real_name": "Elliot",
            "display_name": "elliot0520",
            "team": "T4UUTPV18",
            "name": "elliot0520",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    },
    {
        "type": "message",
        "text": "If you had to look at other types of jobs outside of the areas you have interest in have you got any idea the kinds of jobs you would look at? ",
        "user": "U5WRFMCCA",
        "ts": "1498310006.350811",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "fe9db945c7f4",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-20\/201684935670_fe9db945c7f4b64a40b9_72.png",
            "first_name": "Elliot",
            "real_name": "Elliot",
            "display_name": "elliot0520",
            "team": "T4UUTPV18",
            "name": "elliot0520",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    },
    {
        "type": "message",
        "text": "Yes, performing in front of an audience or behind a camera or with a group of people. \nI haven't found one that does all three at once, but I'll be looking into it some time this week.\n\nSo far the course it has been good, enjoying it and being creative. Right at this moment I don't have time to do my on photography projects buts this summer I am going to go out an explore the streets and take pictures of anything that I find interesting. \n\nWhen I was about 5 or 6 I took music lessons and I was able to read music, but then about a year later I had to drop out the lessons, then I forgot how to read music. So no, I am not able to read music.\n\nNo one has ever ask me that question...(It actually took me a lot of time to think about that) Well I also do textiles as an A level and my teacher had told me \"apparently\" I'm really good at it; and i also love all things to do with weddings, but mainly wedding dresses. So maybe design and produce my own line of wedding dresses or work for a company that does things with weddings. ",
        "user": "U5XTUA3HT",
        "ts": "1498333342.208902",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "6e7733bd8445",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-22\/201181455952_6e7733bd8445ebf2c0bb_72.png",
            "first_name": "Ivanna",
            "real_name": "Ivanna",
            "display_name": "ivannagioia",
            "team": "T4UUTPV18",
            "name": "ivannagioia",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    }
]