[
    {
        "type": "message",
        "text": "Hey Ivanna, apologies for the late responses, absolutely slammed at work I hope you do understand!  \n\nAh okay that makes sense! Oh so it seemed that everyone was closer and got on better then?? Oh nice that means you would have a much closer relationship with them then which is good!  How come you don't like meeting large group of people? But I totally understand the questions bit, that good you are keen and thinking of things like that, I wouldn't have thought of that! Do you get quite nervous infront of lots of people then? \n\nOh really? Yeah I think they probably will be quite hard to find as apprenticeships are quite hands on and it's like working with someone doing the job and I guess musical theatre is quite specialist! Photography apprenticeships could be great though? I'm sure you could learn so much from that! :grinning:\n\nThat's fair enough I get that! It's so tricky thinking about the future and what you want. Well have you ever looked at working in film? Just because musical theatre and acting obviously is relevant in film industry and photography etc is a big part in it as well. My brother is head of London at a big visual effects film company in central London and constantly works on huge movies, he's been in credits for probably about 30 Hollywood films. He dropped out of uni and got a job as a 'runner' which is like an entry level role and worked his way up. 7 years later is at an integral part of this business and has been given a great opportunity to work with these big films. Have you ever thought about the film industry before? There are plenty of roles that involve being involved in filming, photography, colouring etc. Maybe you could look at types of roles in that industry?",
        "user": "U5WRFMCCA",
        "ts": "1499873236.658431",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "fe9db945c7f4",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-20\/201684935670_fe9db945c7f4b64a40b9_72.png",
            "first_name": "Elliot",
            "real_name": "Elliot",
            "display_name": "elliot0520",
            "team": "T4UUTPV18",
            "name": "elliot0520",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    }
]