[
    {
        "type": "message",
        "text": "I work as a waitress (because I've always wanted to try the that job) in the restaurant on the breakfast section because I'm not allowed in the afternoon because they work with alcohol. I can't explain to you enough how much i like my job, there's always something to do always busy and i get to talk with the guests. Obviously sometimes it's hard because some of the guests are rude or I'm not having a good day but it's always good to work there. I've got very nice colleagues, even thou I am literally the youngest they still treat me like one of them so it's good because we make a great team when we work. We do each other favours when one of us is busy and visa versa, which is extremely helpful because we get the job done. (Wow just wrote an essay without realising it, lol)\nThis week the school made us do a Work Experience and i choose to do it in the hotel because i wanted to learn about the other departments. I actually really liked the Reception, and i was thinking to swap to the reception area and maybe work in the restaurant some days and other days work in reception. (But i need to speak with the manager)\n\n\nI have never thought about it but it would be fun to try it out, maybe do a work Experience and see how it goes.\n\nIn your day to day job what do you do? (Eg: go on meetings, phone calls, paper work, computer work.)",
        "user": "U5XTUA3HT",
        "ts": "1498680347.875987",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "6e7733bd8445",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-22\/201181455952_6e7733bd8445ebf2c0bb_72.png",
            "first_name": "Ivanna",
            "real_name": "Ivanna",
            "display_name": "ivannagioia",
            "team": "T4UUTPV18",
            "name": "ivannagioia",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    },
    {
        "type": "message",
        "text": "<@U5WRFMCCA> ",
        "user": "U5XTUA3HT",
        "ts": "1498680371.884179",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "6e7733bd8445",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-22\/201181455952_6e7733bd8445ebf2c0bb_72.png",
            "first_name": "Ivanna",
            "real_name": "Ivanna",
            "display_name": "ivannagioia",
            "team": "T4UUTPV18",
            "name": "ivannagioia",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    }
]