[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Andrew sorry for taking a while to respond been a bit hectic. yeah absolutely, different areas of specify fields are something is amazing, but in most cases in modeling or lighting or any fields can drive you a bit crazy. it depends on the technicality of what you could be trying to figure out rather than the job your doing.  Maya is tricky tool because as a student you have support but more online support, in companies we are fortunate to have it guys and pipeline TD they really help us figure issues out or they have modified how maya is treated in each studio that you have less issues which is handy.  because it can delay work and we dont want that.  yeah im currently learning more substance then moving onto mari but im trying to learn lighting so i can light my scenes or models better :slightly_smiling_face: Make it look more lush? lol",
        "ts": "1585402736.000100",
        "username": "Angel (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-28\/1035050141014_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Absolutely, uni can sometimes drag and its frustrating that you spend more on something you dont like than what you enjoy, but its good to spend a good few hours a week doing your own stuff improving and then when it comes to the weekend spend longer, i always do personal projects after work. its healthy and its like a refresher. thats really good, get involved in competition will help you feel more confident and give you that more level of understanding whats out there. Terms of software besides the ones you have mentioned, houdini is very popular and arnold is improving a lot with its speed in rendering and capabilities. its ideal to understand maya and learn how to use it. Maya has been embedded into a lot of studios and if you lack in maya it will be harder for you to work around that, its a good advantage to know a lot in maya, and you will be able to troubleshoot bugs. In the industry for film and television unsure for games but pipelines have structured maya a lot and would be insane if they changed it for something else, due to project show issues and problems with switching and more. Really depends what you enjoy going into and really putting your passion into it as well. For me i am constantly looking to improve as most people even at the industry artist still look at stuff to learn and its good. helps the industry grow as a whole. :slightly_smiling_face: hope your dealing with the current situation okay, and ill be more active on here if you have other questions. have a lovely weekend.",
        "ts": "1585403220.000200",
        "username": "Angel (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-28\/1023146532529_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]