[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Patricia! Nice to meet you! I'm so happy you are helping me with my first steps into this industry. It sounds as you still enjoy working in the vfx industry :slightly_smiling_face:.",
        "ts": "1544092622.001800",
        "username": "Eva (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-06\/498074132439_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I'm currently doing the 12 weeks short course at Escape studios, but I feel like I need some advise from someone working in the industry for my Reel, I hope you can help me out with that?",
        "ts": "1544092717.001900",
        "username": "Eva (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-06\/496920730067_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "To be honest, I have never done a reel for myself (!); it's going to be fun collating 15 years worth of work when I do... But I have seen plenty, and made quite a few breakdowns for the Framestore company reel over the years.",
        "ts": "1544093690.002000",
        "username": "Patricia Llaguno (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-06\/496431962465_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I can offer you advice on the most important aspects of putting the reel together, namely go for quality rather than quantity; be selective with what you include as your reel will be your calling card and it is highlighting to the employer what YOU think is a significant showcase of your skills. I have seen lots of reels that include shots which, although pretty, are very repetitive in terms of the breadth of skills displayed. If you have a couple of keys in your reel shots that's enough to show you can key, despill and colour correct to integrate green or blue screen work into your environment. If you have keys in other shots that are showcasing additional skills, like dmp projections, CG grading and integration, some particularly cool lensing effect, particles, etc (not that you need examples of all this, or even the knowledge, to get into a paint department), then it is of course OK to keep the keying work in; but keep the breakdowns, if any, short and relevant.",
        "ts": "1544094096.002100",
        "username": "Patricia Llaguno (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-06\/496871504228_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "The aim of the reel is to get your through the door, so you can explain your experience, aims and vision in person. Technical knowledge is, of course, helpful as you start off -and essential as you progress-, but every senior member of a comp department will tell you that a good eye for colour and composition, a proactive disposition to problem solving and good communication skills are the gold nuggets they will look for in aspiring compers. You will learn the ins and outs of the software as you work on projects (much, much faster and more efficiently than in courses, which offer a helpful overview), but the software will be applied differently across companies. The larger companies like Framestore, ILM, MPC and Dneg have extensive pipeline tools developed in-house over the years; these modify and enhanced the toolset that packages like Nuke offer and the only way to learn them is to work in thoise companies. So in a way, there is an expectation that a certain amount of technical know-how will always need to be acquired by new employees, whether they are starting out their careers or seasoend veterans from other companies",
        "ts": "1544094651.002200",
        "username": "Patricia Llaguno (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-06\/496309204704_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "What they most care about is perceived attitude, aptitude and the potential to grow and learn quickly.",
        "ts": "1544094749.002300",
        "username": "Patricia Llaguno (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-06\/496945332883_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Most importantly, never forget that most people at the company have sat where you sit; be confident even if you feel you have much to learn. Most senior artists have been exactly in your position once, and know that the only way to learn is to get given a break and jump in at the deep end.",
        "ts": "1544094975.002400",
        "username": "Patricia Llaguno (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-06\/496312836736_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "But I'm going on a bit now!",
        "ts": "1544095013.002500",
        "username": "Patricia Llaguno (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-06\/496882185492_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Do ask me any specific questions you might be thinking about, or do stop me if I get boring :wink:",
        "ts": "1544095044.002600",
        "username": "Patricia Llaguno (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-06\/496948655955_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thanks for the advice!",
        "ts": "1544109628.002700",
        "username": "Eva (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-06\/498656454102_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I actually have a specific question: what is a good shot for a clean up? Do you know any examples? I'm having troubles here, because I don't like the footage here and I don't know how to make a good clean up shot.",
        "ts": "1544109787.002800",
        "username": "Eva (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-06\/498310137303_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]