[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Lasma, happy Monday :upside_down_face:\n\nI really enjoyed my time at Escape studios. It is a great place to learn some new skills through a course or just to attend some of their hosted events.\n\nI was working a full time job whilst I was studying so I went to an evening class. It took longer obviously and they were very long days! But in the end if you put the effort in, it really does pay off.\n\nI think that this is true for a lot of careers but definitely for VFX. If you are determined and willing to put in the effort, you will be able to get where you want to go :slightly_smiling_face:",
        "ts": "1574671404.002300",
        "username": "Jonathan Atkins (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-25\/839779638017_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "You’re internship sounds really great. You seem to be getting a lot of experience doing different things.  Is the internship through the university?",
        "ts": "1574671525.002400",
        "username": "Jonathan Atkins (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-25\/847251114852_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "It’s difficult to compare TV and film work. Not long ago, they were quite different but increasingly they are becoming similar. It used to be that film was much more scrutinised and everything had to be perfect and you could get away with certain things in TV. However, with the rise of streaming services, high quality TV is now the norm therefore a lot more is expected. Unfortunately, it is still true that you don’t get as much time for TV projects as you do with film so sometimes this can make an approaching deadline particularly... tight.\n\nOverall, I think I prefer TV at the moment. The projects move a lot quicker and you’re able to work on more projects in a shorter amount of time. Do you have a preference on what you would rather work on? Is there a particular film\/TV show that inspired you to get into VFX?",
        "ts": "1574671933.002500",
        "username": "Jonathan Atkins (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-25\/839789296769_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I’ve given your showreel a watch. It’s looking great so far! I’ll come back to you with some feedback shortly.",
        "ts": "1574672101.002600",
        "username": "Jonathan Atkins (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-25\/847719490688_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]