[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey sorry it’s taking so long to get back to you. Christmas makes everything so busy!\n\nFxphd is great. It’s always worth learning new things and brushing up on things you might already know. That sounds like a really good idea. Also, if you are able to shoot your own green screen, that would be great! It will look good in your showreel and obviously be material that employers have never seen before :+1::skin-tone-2:\n\nYeah, London is expensive. I meant that you might be able to get onto some projects for free whilst you continue your internship. If there are opportunities of course... \n\nFor me it’s been a bit of a windy road to be honest. Once I finished studying at Escape it took a while to land my first contract position as a roto artist. But it all really depends on how much work there is in London and also what time of year you are looking. There are big hiring rounds usually in the spring and autumn in London.\n\nI am still working various positions and getting new skills to progress through mid and then senior levels. It’s important to keep learning new skills and challenging yourself :slightly_smiling_face: I had to work for a while in roto\/paint departments before I could progress in compositing but that isn’t the case for all artists.\n\nIt is important to shoot for where you want to go but also to think about the stepping stones that you need to go across to get there. It might be that you need to get some experience in different departments before going into DMP.\n\nI hope you have a really nice holiday time and are able to rest and relax! I’ll message you after the holidays :slightly_smiling_face:",
        "ts": "1577222535.000100",
        "username": "Jonathan Atkins (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-24\/885133015732_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]