[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Lasma, sorry for the delay.\n\nYeah, Union has some excellent environment and DMP stuff. Their department is great. I haven’t seen Mamma Mia 2 but I have seen the breakdowns. It is very impressive.\n\nEveryone here is very friendly and welcoming. It is also a really good studio because they care about their artist’s wellbeing which is increasingly important in our industry. They are being very proactive with the whole Coronavirus situation which is comforting to see. Who knows how everything will be affected in the end :man-shrugging::skin-tone-2:",
        "ts": "1584090831.000900",
        "username": "Jonathan Atkins (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-13\/998138078288_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "In regards to your question about starting in July, I don’t think it will affect your chances necessarily. But you do need to remember that things happen very fast in regards to getting contracts. By that I mean that most studios won’t look to hire someone more than a month before they are needed. Usually just a few weeks. \n\n\nSo it might be good to contact as many studios as possible with your showreel and info and availability and then they can add you to their system that way. It is most likely that studios will want to interview you around two weeks before you are available. But this all depends on the studio and how much work they have coming in. With Union, I had this contract sorted a month or so before I was available whereas it’s been days before in the past for me...",
        "ts": "1584091088.001000",
        "username": "Jonathan Atkins (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-13\/985358045954_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Unfortunately, especially with your first contract, it can take a little time to get it. Don’t be disheartened though, it will come. It just might take longer than you want it to :+1::skin-tone-2:",
        "ts": "1584091164.001100",
        "username": "Jonathan Atkins (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-13\/985360215682_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yeah, your master’s shot should definitely be left in your showreel. It’s impressive :+1::skin-tone-2:\n\nAnd what you did with the other shot is great. That’s exactly what you would be doing in a DMP department. It’s great that you can show lighting, 3D work and comp!",
        "ts": "1584116704.001200",
        "username": "Jonathan Atkins (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-13\/989017799505_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]