[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Lasma, I hope the weather is brightening up for you as much as it is in London. It’s still cold but like you say, Summer isn’t far away!\n\nI’ve just started yesterday at Union VFX. The great thing about the VFX industry is that on the whole, most artists and production people are super friendly and welcoming. :blush: Plus it’s a small community and you often meet the same people as you go between various studios.\n\nI completely understand that you would want to be by the coast for the Summer! It would work well for you to get something at Outpost. Honestly, the big hiring periods have traditionally been in late winter and early spring (around now) and around September-October. However, that is definitely changing. It’s an exciting time to be coming into the VFX world because Netflix\/Amazon etc have created LOTS more work for us :+1::skin-tone-2:",
        "ts": "1583225733.000500",
        "username": "Jonathan Atkins (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-03\/978480997844_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I’ve just had a look at your showreel! Your new shots are looking really good! I think your first shot especially is excellent. A really good example of paint work and comp as well. For the second shot did you build the back wall yourself? I can really see how much time you have put into it!\n\nI know you said you are going to replace the other shots but the last lamp shot I think could be good to include. You might want to include a little slow dust hit when the lamp hits the stone? And as you mentioned, update the breakdown but it’s looking very good.",
        "ts": "1583226227.000600",
        "username": "Jonathan Atkins (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-03\/968848094225_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Jon,\nBournemouth isn't too bad atm, but saying that weather here changes so often it's hard to keep track :sweat_smile: \n\nOhh, that's great! I love VFX Union dmp work, their Mama Mia 2 showreel is one of my favorites. I saw the film but had no idea most of the film was greenscreen till I saw the reel in BFX last fall. Shame they don't have entry level jobs for dmp. Probably too soon to ask but how do you like it there?\n\n July is coming really fast and it's both exciting and terrifing :see_no_evil: I'll probably end up starting to apply in start of June and see how it goes.. Possibly a weird question but do you think, if I'd get a interview and say in it that I can only start in a specific time (say end of July) would that ruin my chances of getting the job? I'm thinking of visiting family after the internship ends just because I feel that once I'll get in there it will be hard to get time off. Saying that I might end up with no job all summer if not smart about it..:smile:",
        "ts": "1583274202.000700",
        "username": "Lasma Zeimule (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-03\/970324817409_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thank you, really happy you like it!\nYes, I did a 2d dmp, projected it in maya and made a dummy geometry out of it. The camera and light match was provided though so I only needed to add the dummy geo to the scene and render a single frame, then comp it all together and 2d dmp touch up. :slightly_smiling_face: \nThe last one is from my masters, everyone has to do it as the first project. It's kinda special so I would quite like to improve it a bit and leave it in tbf. If you want to see more of those you can look up in YouTube \"MA Digital Effects\". There's so many good ones",
        "ts": "1583275101.000800",
        "username": "Lasma Zeimule (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-03\/968979527603_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]