[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Rob, No problem. Free week this week so focussed on the flying monkeys. Okay wish progress. Tried F_WireRemoval, F_RigRemoval and even time offset node and some funky. projection mapping - all no good with the trees. I know you've suggested recropping but is there anything else I could try? Even a long shot?",
        "ts": "1581673044.013100",
        "username": "Jonathan Joubert (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-14\/952440281397_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "*Okay - ish progress...!",
        "ts": "1581673105.013200",
        "username": "Jonathan Joubert (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-14\/940953299267_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Rob... I've been thinking about this for a bit and I've decided to just go ahead and ask. I hope you don't mind &amp; I certainly hope it doesn't embarrass you!\nI come from a Fine art background - making drawings and paintings - to a pretty decent level. I was super lucky to be supported and encouraged by my ex partner for many years while I developed my work and worked in part-time jobs. In 2017, after almost 20 yrs together my ex literally ran away w someone else.\nI had to consider a way to earn money that fused an interest in the digital world and my fine art background - something fun. I came across Escape studios and completed their 12 week 2D comping course - except it was more intense than I expected as a complete newbie and was just when I was in a tailspin from relationship stuff followed by representing myself in court in the divorce \/ civil partnership dissolution that followed in the bg.\n\nIn a nutshell - I feel like I'm cobbling stuff together when I'm comping - I'm having to draw from lots of different directions to solve frustrating problems all the time. And so I'm wondering if I need some more solid education - maybe head off to study for 12 months to 2 years to get a firm grounding that will mean I am much much more employable than I am at the moment. I feel like I'm just tinkering at the edges at the moment - or is that fairly normal.\n\nMy vfx friends think it's just a confidence thing - but my gut says I have to get a better grounding to succeed. You don't know me and as a working professional you're the perfect person to ask.... do you think I'm crazy to go study full time on a VFX or CG and VFX course? OR, should I focus absolutely on my reel and getting a foot in the door and progress from there?  I don't mean to put you on the spot - I'm just after an honest opinion here not life instructions!",
        "ts": "1581682878.013300",
        "username": "Jonathan Joubert (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-14\/939830590018_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey no worries. Will try and give the best advice I can based on my experience. By the way, still no word from the director, when they want something they'll constantly be in contact, but otherwise they can be flakey!",
        "ts": "1581692012.013400",
        "username": "Robert Rankin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-14\/955055049894_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "So I'm guessing your fairly close to me in age when I went back to school. I tried to find info on the vfx industry before I went back, while I was living in Liverpool. Back in 2012 it was quite hard to get info. But I had inherited some money and that allowed me to go back to film school, I was 36 the year I would have been going to school (38 when I graduated). I didn't realised the number of schools out there that did those courses, but a friend told me about the NFTS and discovered their 2 year masters course. I made my own little film quickly, had the interview and got in. Right before I was due to start, I met up with someone who worked in post, not vfx, and they said just move to London and get a job running and work my way up from there. I decided to go back to school anyway. The course is fairly expensive, back then £20,800 for a 2 year masters, but the only ones who paid full fees were overseas students. But you still need enough money to get through 2 years studying even if you get full funding. The NFTS is a great all round course, and while you learn MAYA and Nuke in the first year, as well as motion capture and back then prosthetics, you are expected to do a lot of learning on your own. Bournemouth is more technical, but they dont work on full films like you do in the NFTS. The NFTS has every department, cinematography, music, editing, producing. It is based in an old film studio, so they have their own soundstage. They do require some background in vfx, but when I got in I had no background at all. Some of the people who did the course at my school now teach at Escape, and I heard the guys who started Escape originally came from my school. Honestly I dont know how good the Escape course is. As I say, some guys I've known for 5 years now did the course and work with me here at Framestore. One Advantage of having a masters is they say most of the big places prefer it if you want to move up to supervisor etc. In 5 years working at maybe 7 or 8 different companies, I've only ever been asked once or twice about my course, and even then they didn't seem that interested in the course. Honestly I wouldn't strongly push that you go back to school, it is expensive and time consuming and a lot of people do learn on the job. I think there are probably more people trying to get into the industry now, but it is also a busy time right now with streaming companies requiring more vfx work. The problem you face is getting that first break, most companies want someone with experience. Having said that, a guy I worked with at Technicolor had no real Nuke knowledge when he started, got a job as a runner here at Framestore 10 years ago, learned roto and prep after his shifts finished, I think he did roto prep on Gravity for 2 years. He stayed at Framestore quite a few years and worked his way up to comper. It's a strange industry, there is no real set route in. So much of what you learn will be on the job, from other artists and just having to learn by yourself by solving problems.",
        "ts": "1581694273.013500",
        "username": "Robert Rankin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-14\/954785900519_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I was told before I started my course, that even after finishing they couldn't guarantee we would get jobs as compers, we might have to do roto\/prep, or even running. Luckily none of us did, but I know some students after us have had to take roto prep jobs at the start",
        "ts": "1581694346.013600",
        "username": "Robert Rankin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-14\/940137818210_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Wow... thanks for a solid response. Roto prep on Gravity sounds... nuts! Would you say focus on compositing or get a general all round vfx education? \n\nWith all my baggage I want a change of scenery for a while. So I’m looking at studying in Canada. With Lost Boys school of vfx who I mentioned before - they give students actual work experience in vfx companies they’ve built relationships with, so hopefully that’ll tick the work experience box in the first instance after study. I’m also hoping to work out there for 12 months after studying. \n\nIt IS expensive but I’m using money from the divorce. And I figure as I’m 43 I may as well invest in my future in a really meaningful way. \nI’m waiting to sell me and my ex’s house which is why I’m sort of looking for vfx jobs in the limbo period. But as you know, so far no interest. \n\nIf you’re happy to help I’ll keep plugging away on the reel with the changes you’ve suggested. \n\nThx again for fielding that one! Very grateful. \n",
        "ts": "1581698343.013700",
        "username": "Jonathan Joubert (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-14\/953080577861_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I'm definitely happy to help out and keep giving advice, and technical knowledge I can help you with. Funnily enough I'm 43 also. When I finished school I had met my partner and we moved to London. I've been limited by staying here, but there's been a few times over the years that I've thought of trying for Canada when I haven't been able to get decent work. Apparently, and I dont know how true it is, it is easier to progress over there and move up quicker. But dont take my word on it. Once you have 2 years expereince, a lot of companies will pay for your visa, flight, sometimes your partners visa and flight, and even accomodation for a couple of weeks. Method were offering that for both Canada and Australia when I spoke to them here. I'm not sure how soon you are looking at going, but in late April there is a VFX festival in Stuttgart. All the recruiters from the big companies will be there from all over the world (I have been before, and Method recruiters were passing through here on their way there when I spoke to them, they sometimes tell people they will be at a certain bar so we can chat to them here). A lot of the schools also have stands there",
        "ts": "1581699138.013800",
        "username": "Robert Rankin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-14\/955295129686_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I dont know how many recruiters you know, but a good thing for you to do might be to connect to me on Linkedin, look for all the recruiters in vfx you can see in my contacts, and add them. Its what we all did when we were students, and basically recruiters will usually accept because they need to know all the artists",
        "ts": "1581699244.013900",
        "username": "Robert Rankin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-14\/952634900900_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]