[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Evening Rob, Thanks for the feedback. Posted my best effort for Alexander to review. I could tweak until the cows come home but wanted to just get something up for him to see. May need your help exporting the shot - bit unsure about formats, compression and quality issues.\nThen back onto the monkey shot until moving day. Unless you have any further exciting leads...",
        "ts": "1583950034.005500",
        "username": "Jonathan Joubert (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-11\/981503641506_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "How's the vfx world coping with the pandemic? Are you working from home now?",
        "ts": "1583950080.005600",
        "username": "Jonathan Joubert (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-11\/996156874775_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Jon, it will be good to get it in front of the director and see if he has any feedback. I've seen plenty of jobs being advertised on Linkedin, but all mainly for mid to senior unfortunately. Things are going on as normal here, they are looking into people working from home, but still trying to keep things secure. I think they have tested some remote system in the past. All a bit above me right now. I'm working on a Boy Called Christmas, it's apparently a quite a well know kids book but has some great creature work which was one of the reasons for me wanting to come to Framestore.",
        "ts": "1583950765.005700",
        "username": "Robert Rankin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-11\/984237351521_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "By the way, I think you mentioned about meeting at some point, and obviously I couldn't make your gallery but if you want to grab a coffee sometime and chat about the industry I dont mind that. I think they say your not supposed to meet you mentees, but one of the guys here met his when they did a tour of Framestore with their school, and I dont know if you have any questions but I know a lot of the information I was given about the industry didn't really reflect how it actually is (working hours etc, the freelance stuff).",
        "ts": "1583950952.005800",
        "username": "Robert Rankin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-11\/984244789233_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Rob - I hope it's good feedback!\nReally nice offer of a coffee meet up I might take you up on that before I leave London - and when \/ if I come back! I'm 20% apprehensive but also 80% excited to get into the industry - bearing in mind my friend's MPC Cats nightmare experience!\nBit of a mess right now though - Corona and the stock market collapse may mean my house sale is either seriously stalled or lost altogether as the buyers are in a chain. Fingers crossed not.\n\nSuch a massive shame all the entry level work in London is in deep hiding. My theory is...as there are a legion of runners and interns waiting for positions, they're always going to get first dibs.\nBig shame because I love clean up and I'm raring to go! Please mention it if you find yourself on a platform with a microphone - lol! Or you might call BS on that one.\n\nAnyway, starting my Lost Boys application process now - my way to hack the system and find a way into a career in Canada, or London - eventually - somehow - hopefully.\nA Boy called Christmas sounds interesting - does that mean you're comping CG most days? By the way did you work on His Dark Materials? The creature effects on that were astonishing! So good.",
        "ts": "1583953216.005900",
        "username": "Jonathan Joubert (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-11\/984334706177_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]