[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Likewise! Yes it is a very big industry in terms of all the things you can do. I found it quite daunting and partly why I went down the pipeline path, basically fixing processes and make sure the ship runs smoothly technically. Now I go to various studios demo-ing software and seeing what their processes look like. To be honest it was only when I started working that I really understood what different departments do! What are the things you currently like doing?",
        "ts": "1581673445.001800",
        "username": "Arielle Martin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-14\/952428381088_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Well, I would definitely say I'm more creative than technical at the moment. I was quite interested in concept art and 3D modelling! We have just begun 3D modelling with Maya at Uni and although I was lost at first, I quite enjoy it now. I really love editing videos together, as I'm",
        "ts": "1581676054.001900",
        "username": "Cliodhna O'Loingsigh (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-14\/942350055585_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "*I'm quite fond of films and such.",
        "ts": "1581676069.002000",
        "username": "Cliodhna O'Loingsigh (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-14\/952485386128_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Nice, so this animation course covers 3D animation specifically? Regarding concept art\/storyboarding that ties in very strongly with editorial in studios, even though they are at polar ends of the film-making process. In some studios, those are the two departments that collaborate the most!",
        "ts": "1581680018.002100",
        "username": "Arielle Martin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-14\/954775917414_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Also there's an event that's come up for students if you're in London <https:\/\/www.eventbrite.co.uk\/e\/the-vfx-festival-2020-emerging-talent-tickets-75999778383> it could be useful to go and see what's out there! Here's the itinerary, there's going to be talks done by a whole range of studios in terms of size and work they do. Seeing studios talk about their work is very inspiring, and can help give a better idea as to how they d what they do :slightly_smiling_face:",
        "ts": "1581680314.002200",
        "username": "Arielle Martin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-14\/942436541537_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "Eventbrite",
                "title": "The VFX Festival 2020 - Emerging Talent",
                "title_link": "https:\/\/www.eventbrite.co.uk\/e\/the-vfx-festival-2020-emerging-talent-tickets-75999778383",
                "text": "About The VFX Festival 2020 The VFX Festival, hosted by Escape Studios, is an annual celebration of visual effects, animation, games and motion graphics. It’s an event for emerging talent to explore the creative industries; it’s also an opportunity for creative professionals to share their insights on award-winning productions. In 2020, the festival will focus on discovering and developing new and emerging talent. Two parts of The VFX Festival 2020 - EDU and Emerging Talent will take place on 16 - 18 March 2020 at the Southbank Centre - the UK’s largest arts centre based in the middle of London’s most vibrant cultural quarter, on the South Bank of the River Thames. The VFX Festival After Hours event will take place at Escape Studios in central London, within a short walking distance from numerous award-winning studios. About The VFX Festival Emerging Talent The VFX Festival Emerging Talent will take place on Tuesday, 17 March - Wednesday, 18 March 2020. It’s an event for students currently studying within higher education and professionals who are looking to kick start a career in the creative industries. The festival will be filled with inspiring talks. Also attendees will receive encouragement and advice from experts in careers and recruitment during panel discussions. As part of the Recruitment Exhibition Zone, attendees will have the opportunity to speak with representatives from studios, to discover more about their available roles, career pathways and progression. Programme*  Tuesday, 17th March 2020 08.30 - Doors Open \/ check in 09.00 - 09.15 Welcome Talk by Escape Studios 09.15 - 10.00 Talk to be added | Electric Theatre Collective 10.15 - 11.00 DNEG's VFX Overview | Sam Popeck, VFX Technical Trainer and Paul Harrison, Senior Artist at DNEG 11.15 - 12.00 Panel Discussions: '2020: The next 10 years' | Speakers TBC 13.00 - 13.45 Real-Time at Blue-Zoo Animation | Phil Stewart Head of Real-Time at Bluezoo 14.00 - 15.00 Panel Discussion: Careers and recruitment in VFX and Animation Andrew Brassington, Head of Talent Development at Escape Studios Emily Macfarlane - Talent Acquisition Manager at DNEG Henry Bull, Head of Recruitment at Framestore Tom Box, Co-founder\/Managing Director at Bluezoo Mat Rees, Supervising Senior Animator at Aardman Speaker TBC, The Mill Speaker TBC, milk VFX 15.15 - 16.00 Talk to be added | milk VFX 16.15 - 17.00 Creating the dazzling ‘Illusion Battle’ sequence in Spider-Man: Far From Home |  Alexis Wajsbrot VFX Supervisor at Framestore 17.15 - 18.00 Of Rats and Goop, Stranger Things Monsters by Rodeo FX |  Yvon Jardel, Animation Supervisor at RodeoFX Exhibition Recruitment Zone - open from 08.30 to 16.00 Confirmed studios at Recruitment Zone include DNEG, Bluezoo, Framestore, Rodeo FX, milk VFX, The Focus, ETC, Access: VFX, Escape Studios, VFX Serbia Wednesday, 18th March 2020 08.30 - Doors Open \/ check in 10.00 - 10.15 Welcome Talk by Escape Studios 10.15 - 11.00 Talk to be added | MPC Film 11.15 - 12.00 Animating for Total War: Warhammer | Elliot Maren, Lead Animator at Creative Assembly 13.00 - 13.45 Talk to be added | The Third Floor 14.00 - 15.00 Panel Discussion: Careers and recruitment in Games Simon Fenton, Head of Games at Escape Studios Luke Johnson, Senior Recruitment Resourcer at Creative Assembly Nigel Ang, Technical Art Director at Rare Mark Flanagan, EMEA Education Partner Manager at Epic Games Elle Dudley, UI\/UX Artist at Playstation London Studio Speaker TBC 15.15 - 16.00 Talk to be added | Jellyfish Pictures 16.15 - 17.00 VFX of Star Wars: The Rise of Skywalker | Dan Snape, VFX Supervisor at Industrial Light &amp; Magic 17.15 - 18.00 Practical Deep Learning for VFX and Technical Artists | Valentine Kozin, Lead Technical Artist at Rare Exhibition Recruitment Zone - open from 08.30 to 16.00  Confirmed studios at Recruitment Zone include Industrial Light &amp; Magic, Bluezoo, Rare, The Focus, Union VFX, Access: VFX, Escape Studios, VFX Serbia, Fudge Animation, The Third Floor *Programme is subject to change FAQs When is The VFX Festival Emerging Talent takign place? Tuesday, 17 March - Wednesday, 18 March 2020   Where is The VFX Festival Emerging Talent taking place? The VFX Festival Emerging Talent will take place at Southbank Centre - Queen Elizabeth Hall - Purcell Room Venue Address: Southbank Centre  (Queen Elizabeth Hall - Purcell Room) - Belvedere Road London SE1 8XX What are my transportation\/parking options for getting to and from the event? Please visit Southbank Centre 'Getting here and around' website for information about getting to the venue    Are there any minimum age requirements to enter the event? To attend The VFX Festival Emerging Talent on 17 - 18 March 2020 all attendees must be over 18 years old   What's the refund policy? Please note that we will not be able to refund any tickets.   Do I have to bring my printed ticket to the event? Yes, please bring your printed ticket or e-ticket to the event and a form of ID How can I contact the organizer with any questions? Please contact vfxfestival@escapestudios.com",
                "fallback": "Eventbrite: The VFX Festival 2020 - Emerging Talent",
                "image_url": "https:\/\/img.evbuc.com\/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F76123147%2F215178082142%2F1%2Foriginal.20191009-104225?w=1000&auto=format%2Ccompress&q=75&sharp=10&rect=0%2C270%2C1080%2C540&s=9396cb523588e002fb14350061c17126",
                "fields": [
                    {
                        "title": "Where",
                        "value": "Belvedere Road, London,  SE1 8XX, United Kingdom",
                        "short": true
                    },
                    {
                        "title": "When",
                        "value": "Tue 17 Mar 2020 at 09:00",
                        "short": true
                    }
                ],
                "from_url": "https:\/\/www.eventbrite.co.uk\/e\/the-vfx-festival-2020-emerging-talent-tickets-75999778383",
                "image_width": 500,
                "image_height": 250,
                "image_bytes": 38568,
                "service_icon": "https:\/\/cdn.evbstatic.com\/s3-build\/perm_001\/eba891\/django\/images\/touch_icons\/apple-touch-icon-180x180.png",
                "id": 1,
                "original_url": "https:\/\/www.eventbrite.co.uk\/e\/the-vfx-festival-2020-emerging-talent-tickets-75999778383"
            }
        ],
        "edited": {
            "user": "B6CS60LDU",
            "ts": "1581680316.000000"
        }
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "We did 2D last term, but I believe that we will soley be focusing on 3D from now on, so I just practise 2D in my spare time. :slightly_smiling_face: Next year we have to choose our specific modules, I've decided to go with VFX and Game Desgin as those seemed to be the most interesting! and oh! I didn't realise they were that closely related, that's so cool.",
        "ts": "1581680423.002400",
        "username": "Cliodhna O'Loingsigh (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-14\/952573438576_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thanks so much! I'll definitely have a look! :relaxed:",
        "ts": "1581680465.002500",
        "username": "Cliodhna O'Loingsigh (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-14\/939785934978_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "No worries! Give me a shout if you want help with anything, or for general pointers :slightly_smiling_face:",
        "ts": "1581681584.002600",
        "username": "Arielle Martin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-14\/952594186224_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I defo will!! thanks so much again!! :blush:",
        "ts": "1581681987.002700",
        "username": "Cliodhna O'Loingsigh (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-14\/939814367906_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Arielle, I just realised I never asked about you and your job! I was wondering how you came to where you are and what specifically made you choose your speciality, what it is you liked etc? :slightly_smiling_face: So many questions, sorry!",
        "ts": "1581712019.002800",
        "username": "Cliodhna O'Loingsigh (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-14\/943328164689_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]