[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey, sorry for the late reply, I got a little caught up with family over the weekend :slightly_smiling_face: When I left uni, I actually wanted to work on creating environments for games. When it came for looking for a job, I was getting no replies on my applications and then I met some recruiters at a vfx festival - which is why I recommend you go to as many events as you can - and they liked me (they're a French studio and I speak French) but weren't looking for anyone in that department at Mikros. She hired me anyway, since they were working on an anglo-french project and put me in the pipeline department while waiting for another position. I got to fill in on environment when the artists were away, but I really like the pipeline side of things. I got an overview of the whole process within that studio and see where things go wrong\/come together. There was a new 'problem' every day and we'd be the ones to fix it. Sometimes they were the same problems, other times new ones.. It was quite fun since I love problem solving, even though it's often stressful :stuck_out_tongue: After about a year, I got a message in LinkedIn from a recruiter at Foundry looking for a French speaking Creative Specialist. Funnily enough all the jobs I got I owe to my French speaking abilities, even though I never really had to use that skill. It was coming to the end of the film I was working on so I was having to move on anyway. I honestly thought it was a mistake because I didn't have any of the requirements or specialty they were asking for so I said I'd be happy to have an interview to get a better idea of what the job was. Even after the interview I didn't really understand it fully (the concept of being a demo\/content artist in a studio that develops software was alien to me) but I went ahead with it because it was in London, the pay was good, the people seemed really cool and by the sounds of it I'd have a lot of freedom (there's traveling involved). Turns out I do a little more than that, aside from demo-ing, I do trainings, school visits, webinar sessions, tutorial videos, tools testing, pretty much everything and anything that isn't programming in this company! I'm mainly specialised in Katana and Flix now (none of those were specialties before I got the job). And that pretty much sums it up! I realise I just wrote a hefty paragraph! But looking back, you can get a position due to having a specific ability, whether it be your specialty, talent, or language (like french was a boost for me). But in all the positions I've been in, people will keep their place if they are genuinely easy to work with (i.e. someone you get along with, it's important to like the people you work with and being a team player), if there's a passion for the industry and if you have skills (although it's not about being better than everyone else necessarily). Also note that hard working doesn't mean you should be doing overtime for free. In my opinion, as long as you do have those qualities, you'll have a place in this industry :slightly_smiling_face:",
        "ts": "1581937232.002900",
        "username": "Arielle Martin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-17\/957644070678_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi, don't worry, I hope you enjoyed your weekend! :slightly_smiling_face: That all sounds so interesting, moving from place to place. Especially since your initial job is quite different, yet you like your current one just as much! There is so many different options and outcomes that it can be quite overwhelming sometimes to think about. Sometimes liking the idea of one area but not really being sure if I'm actually up to standard for it is intimidating, but reading what you said it seems it's just constant learning and development for everyone, which is great!! Thanks for taking the time to write such an indepth reply, highly appreciated! :relaxed:",
        "ts": "1581949858.003000",
        "username": "Cliodhna O'Loingsigh (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-17\/957919395734_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "No worries! It's true most people will take windy roads to get to where they are, which is why you should always gives things a go. In this industry we get short contracts anyway the mentality is very much 'if this one job doesn't inspire you or takes you nowhere, onto the next'! Truth is, the tools you use and the projects you're on changes a lot, and that's the case for almost everyone. There are so many different sides to this job that nobody expects you to know everything anyway :stuck_out_tongue:  Which is why you have teams and everyone can merge brains, work together, enhance each other's work. In most places you'll be working in a team, whether the studio is large\/small. I'd say don't be scared by this industry, once you're in it you see that everyone is just trying their best :stuck_out_tongue: In a good way :smile:",
        "ts": "1581961004.003100",
        "username": "Arielle Martin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-17\/943222222626_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]