[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Arielle!  Hope all is well~! :slightly_smiling_face: I was just wondering about showreels, as I have to put one together pretty soon. I'm unsure how much content to put in, time limits etc. When linking my portfolio, I'm thinking maybe including my traditional portfolio that I used to get into Uni, and then adding my digital work and other sections, i.e video editing, animatics, illustrations etc, all within the webpage, but I'm not sure if that is the best option or if there is a certain way it needs to be presented...:disappointed:",
        "ts": "1582562543.000100",
        "username": "Cliodhna O'Loingsigh (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-24\/965914336596_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey! All is good over here, I hope uni is treating you well! :slightly_smiling_face: Do you have to put together a reel for uni or is it to apply for internships\/jobs? I'd suggest keeping it short, since most recruiters will be flicking through so many showreels. The best advice that was given to me was to not put in anything you're not completely happy with. So if you're adding something just to fill in time, it's probably not worth a spot on your reel. Start strong and finish strong, so put two of your best works first and last. Keep it 1 minute, or 2 minutes maximum if you feel you absolutely need more in there. The one I used to get into the industry was cut down to 30 seconds, which is a bit extreme! The one I was using before that (1:30 minutes) didn't get any attention.  Is there anything in particular you'd like to show your specialism for this showreel? Don't hesitate to send some parts my way if you'd like advice :slightly_smiling_face:",
        "ts": "1582563478.000200",
        "username": "Arielle Martin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-24\/953611139074_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "actually I just looked back at my reel and I lied, it was 1 minute in the end! I'd say that's a good amount, try not to go beyond 2 minutes because a recruiter will rarely watch longer than that!",
        "ts": "1582563688.000300",
        "username": "Arielle Martin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-24\/966426536773_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "The difference in time is huge, woah. :exploding_head: It's for summer internships, as they all are opening around now. The thing is I'm unsure as I don't have any area I've focused on as of late, I have alot of illustrations, tested concepts, and video edits I'm proud of, but I'm worried due to my lack of actual finished animations since I'm quite new to it. I know for sure I'm interested in the Visual Development side of things. :thinking_face:",
        "ts": "1582564383.000400",
        "username": "Cliodhna O'Loingsigh (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-24\/954963754947_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "if you have a particular style or theme that can link them together, that can become your 'area of specialism'. That's what I did, since I didn't really have anything I specialised in, I had a theme that did, which was nature and environments. Having said that, you're in your first year so you wouldn't have found a specialism yet, I wouldn't worry too much about that. The main thing is that your reel it relevant to what you're applying for and that it flows well",
        "ts": "1582564910.000500",
        "username": "Arielle Martin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-24\/954980318051_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "if you don't have finished animation, I reckon showing your working through the work you're proud of, i.e. illustrations, concepts, edits. That can show off your skills well and will give more insight into how you work",
        "ts": "1582565121.000600",
        "username": "Arielle Martin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-24\/953666562290_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I have developed a strong art style I think is consistent! I have one I've been working on for a while that's nearly finished, so I'm hoping to finish that soon. :slightly_smiling_face: If I were to showcase my best illustrations, concepts, an animation and a video edit to show my range of skills, do you think that would sound okay? I would of course have all my other work on my portfolio.",
        "ts": "1582565555.000700",
        "username": "Cliodhna O'Loingsigh (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-24\/966468722640_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That sounds perfect! You can send a couple iterations my way if you ever need an additional opinion :wink: good luck with your applications!",
        "ts": "1582566333.000800",
        "username": "Arielle Martin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-24\/955024703587_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thank you so much againnnnnn! I will defo send! :relaxed:",
        "ts": "1582566405.000900",
        "username": "Cliodhna O'Loingsigh (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-24\/966513205973_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]