[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "No worries. I'm not sure what's going on with MPC, they aren't renewing contracts and moving most of their work to Montreal due to tax reasons. No-one knows what's going to happen to MPC London.",
        "ts": "1579280885.000100",
        "username": "Jamie Harris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-17\/911382845589_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Cool. Maybe try looking for work experience or a summer intern position at the Mill. Most VFX houses do a bit of advertising every now and then, some more than others. The Mill does a lot of post work for short form so they would be a good place to go to get a feel for what kind of work goes on.\nI really enjoyed working in animation, been in and out of that industry over the last few years. Jobs tend to run for longer and be a bit more relaxed in terms of deadlines etc. though not as high a budget really.\nNot sure about Houdini for animation, it would really depend on the show I think as Houdini and all the required rendering power is quite an expensive setup for a studio. I've mainly seen Houdini used in FX work for feature film or high end TV rather than animation.",
        "ts": "1579281162.000200",
        "username": "Jamie Harris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-17\/899912892147_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Just finished my assignment!\n\nI suppose Houdini wouldn't really appear unless necessary, you're right. It's a pretty pricey investment. I've seen some places that have a slightly serious tone of animation style, like Axis Animation from your list, which look like they might use Houdini, but their summer internships seem to be in Glasgow, and not London. I'll apply anyway, just thought it was a little weird.\n\nI think I'd ideally work in animation for advertisement to be honest. Short films are way more interesting to me than feature length films.",
        "ts": "1579282104.000300",
        "username": "Max Brown (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-17\/913613671798_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]