[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Georgina",
        "ts": "1511263717.000053",
        "username": "agonsalves-2011 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-21\/276477856438_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "sorry for the late reply...",
        "ts": "1511263730.000005",
        "username": "agonsalves-2011 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-21\/276477908822_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "we have mock exam so was busy revising",
        "ts": "1511263741.000233",
        "username": "agonsalves-2011 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-21\/276477962582_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "can i send you my personal statement",
        "ts": "1511263812.000382",
        "username": "agonsalves-2011 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-21\/276680838055_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "and please tell how am i doing so far",
        "ts": "1511263835.000003",
        "username": "agonsalves-2011 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-21\/275603147394_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "This happens in every person’s life where you are not sure what is right or wrong. Then we come across an incident where our life gets completely changed. Recently, in August I had undergone a surgery and due to this, I had to get an MRI scan. I did not even have a slightest clue about the radiography or their role in the medical field. If you ask me now, I can say that an MRI scanner is a large tube that contains powerful magnets where the patient lies inside the tube during the scan. This knowledge came from the extensive research I carried out. This is all thanks to the radiographer because they really inspired me at that very moment giving me a glimpse of interest just when I had an MRI scan done. Viewing the photographs of my own scan was fascinating. Through the radiographer's eyes, I can actually see and feel the passion and how they manage the challenging role in their careers. Not just passion but I saw the dedication and hard work. \nThe radiographer was working with so much enthusiasm. I asked few questions regarding the MRI procedure, and the radiographer spoke with so much intense and knowledge as if he invented it. He added that he came across the right decision after experimenting with all the other decisions. The radiographer added \"the mechanical equipment has developed a lot throughout the history’’. Having to experience an MRI scan is the reason of my decision to choose this course. Radiographer’s responsibilities towards patients are critical as they have to inform the patients of certain health hazards. I am currently studying BTEC Science Level 3 and as part of this coursework of unit 21 medical physics applications has enabled me to know more about benefits and issues in radiography. This has developed my understanding and knowledge about radiography.\nIn 2016 I attended an event at Imperial College, this event was about future budding surgeons. During this event, I had an opportunity to learn about doctor’s life, such as doing suture, CPR and knowing the risks and complications of surgery. Team work and problem-solving skills were applied when doing a group activity with people of different age groups. Furthermore, I was part of a voluntary work at local community charity. This helped me to gain leadership skills when helping young children doing outdoor activities. In school, I relished being a pair mentor as I was able to help KS3 students with reading. I carried out a lot of responsibilities whilst working with young children. \nAs a volunteer at health watch, my role was to document patient experience information. This was done by doing surveys and recording the information in the system. As part of volunteering, I did survey’s suggesting that the radiographer needs a lot of patience when working with people. Doing volunteering at local community pharmacy has enabled me to develop my communicating skills as I had to approach customers and collect patient’s prescription record. Moreover, attending summer camp at the local community helped me to develop my self-motivation skills as I had the opportunity to do photography, dance, and visit care homes. In my spare time, I like to be creative by doing paintings and I also enjoy reading blogs about history and food. \nMy interest also includes exploring different areas of choice such as languages that includes French and Korean, this is something I am currently learning. I am fluent in Konkani as it is my native language, English and Hindi. I believe that knowing these languages will help me to communicate with people from different ethnic backgrounds. Photography is part of my daily routine and this will give me a good attention to detail and imagery eye of the photograph which is important for a radiographer for analysis. I believe that I have the passion and motivation to study radiography at the chosen university and my hard work and school background would make me a strong and capable radiographer.",
        "ts": "1511263869.000219",
        "username": "agonsalves-2011 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-21\/275649034244_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]