[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Here are my suggestions. I copied and pasted your whole statement and then added and deleted where I thought necessary so you can compare between your original: ",
        "ts": "1512310789.000016",
        "username": "georginamfeary (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-12-03\/280294429392_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "There are moments in every person’s life where you are not sure what is right or wrong. Then we come across an incident where our life is completely changed. Recently, I had to undergo surgery, which involved an MRI scan. Before, I did not have the slightest clue about radiography or its role in the medical field. I can now say that an MRI scanner is a large tube that contains powerful magnets, where the patient lies inside the tube during the scan, and I gained this knowledge first hand from my serendipitous experience. ",
        "ts": "1512310819.000063",
        "username": "georginamfeary (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-12-03\/280294521792_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "This is all thanks to the radiographer who helped me after my incident, because they really inspired me and gave me a glimpse of what it might be like to be a radiographer. Viewing the photographs of my own scan was fascinating. Through the radiographer's eyes, I saw and felt the passion they had toward their role and how they managed their challenging career. Not just passion but I saw the dedication and hard work involved; the radiographer was working with so much enthusiasm and diligence. I asked a few questions regarding the MRI procedure, and the radiographer spoke with so much intensity and knowledge, it was as if he had invented it the procedure. I learnt about his thought processes as he added that he came across the right decision after experimenting with many other decisions. The radiographer added that \"the mechanical equipment has developed a lot throughout the history’’ and so it would be very interesting to be part of such a developing field. Having to experience an MRI scan is the reason of my decision to choose this course. ",
        "ts": "1512310878.000069",
        "username": "georginamfeary (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-12-03\/280995597732_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "The Radiographer’s responsibilities towards their patients are immense as they have to inform the patients of certain health hazards. I am currently studying BTEC Science Level 3 and as part of this coursework in the unit Medical Physics Applications, has enabled me to know more about the benefits and issues involved in the field.\nIn 2016 I attended an event at Imperial College for future potential surgeons. During this event, I had an opportunity to learn about a typical doctor’s life, such as performing suture, CPR and knowing the risks and complications of surgery. Team work and problem-solving skills were applied when doing a group activity with people of different age groups and it was a thoroughly thought-provoking and interesting day. Furthermore, I was part of a voluntary group at a local community charity. This helped me to gain leadership skills whilst I helped young children doing outdoor activities. In school, I relished being a pair mentor as I was able to help KS3 students with reading. I carried out a lot of responsibilities whilst working with young children. \nAs a volunteer at health watch, my role was to document patient experience information. This was done by doing surveys and recording the information in the system. As part of this volunteering, I did surveys suggesting that the radiographer needs a lot of patience when working with people. Volunteering at a local community pharmacy enabled me to develop my communicating skills as I had to approach customers and collect patient’s prescription record. Moreover, attending summer camp I the local community helped me to develop my self-motivation skills as I had the opportunity to do photography, dance, and visit care homes. All of this voluntary work has helped me to experience many things I wouldn’t have got to experience otherwise and has opened my eyes to the opportunities out there involved with caring for people. ",
        "ts": "1512310921.000039",
        "username": "georginamfeary (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-12-03\/281095920981_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "In my spare time, I like to be creative by doing paintings and I also enjoy reading blogs about history and food. \nMy hobbies also include exploring learning languages including French and Korean. I am fluent in Konkani as it is my native language and also fluent in English and Hindi. I believe that knowing these languages will help me to communicate with people from different ethnic backgrounds, further benefitting my communication skills. Growing up in this century, I realise that photography is part of my daily routine and has given me a good attention to detail and an eye for viewing images, which is intrinsically important for a radiographer. \n\nI thoroughly believe that I have the passion and motivation to study radiography at university and my hard work and school background will make me a strong and capable radiographer.",
        "ts": "1512310945.000013",
        "username": "georginamfeary (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-12-03\/280294852672_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Let me know if you have any questions! I think the programme is coming to an end but you can contact me by email: <mailto:gfeary@cantab.net|gfeary@cantab.net>",
        "ts": "1512310978.000022",
        "username": "georginamfeary (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-12-03\/280294924336_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "oh ty",
        "ts": "1512333810.000120",
        "username": "agonsalves-2011 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-12-03\/280937011907_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "for ur help",
        "ts": "1512333821.000082",
        "username": "agonsalves-2011 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-12-03\/280937030643_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "thank youu so much",
        "ts": "1512333979.000021",
        "username": "agonsalves-2011 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-12-03\/281882835286_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "No problem! And please do email if you have any more questions :) or to update me on your application, i would love to know!",
        "ts": "1512338316.000089",
        "username": "georginamfeary (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-12-03\/280505305169_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]