[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yeah, god the weather has been attrocious. So, to answer your question, what animation employers are generally looking for in a reel is examples of good body mechanics, lip sync and character acting. However, i'd personally recomend not catering the pieces that you work on to becoming employed, this might sound a bit counter productive but the things that people look for in a reel generally just come with becoming better at animation and making pieces of work that you enjoy.\nIf you're willing, I was thinking it might be nice to try working through a piece of animation with me with an absoloutely barebones rig and an extremely simple idea so that there's no fiddly bits to distract us from the overall movement of the character and fudementals of what makes something move around nicely.\nThis floursack rig is fab for that kind of thing (<https:\/\/gumroad.com\/l\/floursackmaya>) and the creator uploaded a great example of the kind of thing you could create getting some real character and weight out of such a simple design (<https:\/\/vimeo.com\/72566266>).",
        "ts": "1564241057.000600",
        "username": "Ana Greengrass (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-27\/707559675508_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "Gumroad",
                "title": "jd Flour Sack rig for Maya",
                "title_link": "https:\/\/gumroad.com\/l\/floursackmaya",
                "text": "Ah, the timeless flour sack. After looking for a simple\/appealing sack rig for animation practice, I decided to create my own. And to give back to the animation community, I'm offering it here free for non-commercial uses. If you enjoy using it, feel free to tip me what it's worth to you, or just send some good vibes my way! See it in action here: <https:\/\/vimeo.com\/72566266>. [Created for Maya 2013 and up.]. There is a wide range of flexibility to the rig, so play around with the controls to achieve the desired pose. Many of the controls can be translated and scaled non-uniformly for extra control. Posing Tip: I recommend thinking of the yellow cylinder controls (Top_Control and Bottom_Control) as the primary first-pass pose controls, and pose them first. The shoulder controls have an attribute that sets whether they follow the hierarchy, or are free to stick to the world. You may want to change this, depending on your scene. Happy animating! Check out my other rigs here: <https:\/\/gumroad.com\/joedanimation>",
                "fallback": "Gumroad: jd Flour Sack rig for Maya",
                "thumb_url": "https:\/\/static-2.gumroad.com\/res\/gumroad\/6075196025658\/asset_previews\/5cdbfd039f339cff8371b9940f5d014b\/retina\/floursackv1.0.jpg",
                "thumb_width": 1005,
                "thumb_height": 787,
                "fields": [
                    {
                        "title": "PRICE",
                        "value": "$0+",
                        "short": true
                    },
                    {
                        "title": "SIZE",
                        "value": "3.32 MB",
                        "short": true
                    }
                ],
                "from_url": "https:\/\/gumroad.com\/l\/floursackmaya",
                "service_icon": "https:\/\/gumroad.com\/favicon.ico",
                "id": 1,
                "original_url": "https:\/\/gumroad.com\/l\/floursackmaya"
            },
            {
                "service_name": "Vimeo",
                "service_url": "https:\/\/vimeo.com\/",
                "title": "Floursack animation test - jump on cube",
                "title_link": "https:\/\/vimeo.com\/72566266",
                "author_name": "joe daniels",
                "author_link": "https:\/\/vimeo.com\/joedanimation",
                "thumb_url": "https:\/\/i.vimeocdn.com\/video\/446453674_295x166.jpg",
                "thumb_width": 295,
                "thumb_height": 166,
                "text": "I spent about 8 hours on this test.  Just staying loose.  I had the idea to have the box be light and tipping over near the end of polishing the test.  For a little extra work it makes for a better scene, I think.",
                "fallback": "Vimeo Video: Floursack animation test - jump on cube",
                "video_html": "<iframe src=\"https:\/\/player.vimeo.com\/video\/72566266?autoplay=1&app_id=122963\" width=\"400\" height=\"225\" frameborder=\"0\" title=\"Floursack animation test - jump on cube\" allow=\"autoplay; fullscreen\" allowfullscreen><\/iframe>",
                "video_html_width": 400,
                "video_html_height": 225,
                "from_url": "https:\/\/vimeo.com\/72566266",
                "service_icon": "https:\/\/a.slack-edge.com\/bfaba\/img\/unfurl_icons\/vimeo.png",
                "id": 2,
                "original_url": "https:\/\/vimeo.com\/72566266"
            }
        ]
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "If you have any simple ideas for a short (like 3-5 seconds max) animation with this cute sack boy let me know and we can have a chat about it, also if you have any questions feel free to ask because yeah that's what i'm here for ahaha~",
        "ts": "1564241156.000800",
        "username": "Ana Greengrass (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-27\/696620543266_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]