[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That sounds amazing",
        "ts": "1543773932.000300",
        "username": "Aspen (Mentee)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-02\/493207635908_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Question I was interested in ",
        "ts": "1543773948.000400",
        "username": "Aspen (Mentee)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-02\/494427156599_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "What interview questions did you get and how did you answer them",
        "ts": "1543773989.000500",
        "username": "Aspen (Mentee)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-02\/494777902422_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "For university? It was 11 years ago, so I can’t remember all of them. I know one was a math question at imperial about differentiating an equation I hadn’t learned how to differentiate. I don’t remember exactly what the equation was,, but I know I couldn’t do it; I struggled for about 5 minutes, and then said I couldn’t do it, but I’d ask my math teacher how to do it when I got back to Edinburgh and email them the answer. I felt terrible on my flight back to Edinburgh from London, but it worked out OK! I think imperial had a few other math questions, a programming one, and they asked me to explain a programming project from school; so I showed them my chat application I’d written in C#.",
        "ts": "1543774360.000600",
        "username": "James Greenhalgh (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-02\/493275127043_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I didn’t have to do interviews for Glasgow or St Andrew’s, for Manchester they said there was an interview, but they didn’t ask any questions, and when I told them I already had offers from imperial and Cambridge they spent the interview encouraging me to go there instead, which I appreciated but found a bit funny.",
        "ts": "1543774451.000700",
        "username": "James Greenhalgh (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-02\/493377964914_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I remember my Cambridge interview being really intense; I had two interviews, one with a math professor and one with a computing professor. I don’t remember anything about the math one apart from it being hard; and probably too hard for me. The computing one I remember only one question which was “what do you think the difference is between computer science and IT, and why do you want to study computer science?” Which I answered by saying I thought computer science was about the building blocks for IT, and I was excited about understanding how those building blocks worked and the algorithms behind them.",
        "ts": "1543774593.000800",
        "username": "James Greenhalgh (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-02\/493378514786_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Do you have any interviews coming up?",
        "ts": "1543777320.000900",
        "username": "James Greenhalgh (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-02\/492784947233_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Not yet but I am expecting there to be for uni",
        "ts": "1543786358.001000",
        "username": "Aspen (Mentee)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-02\/494475390759_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "And what about for your job I know that it's a placement but they must have had an interview ",
        "ts": "1543786389.001100",
        "username": "Aspen (Mentee)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-02\/493623956485_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "When I applied for my internship with Arm in 2011 the interview had two parts, one was a set of 15 questions about the C programming language, and spotting bugs in some simple C programs. The other part were some questions on how a compiler might generate code for a C program, then there were some personal questions about my projects. The most memorable part of it for me was an argument with someone who ended up being my boss for years about whether it was better to write code that was high performance, or maintainable. I told him that maintainable is the only answer because he might get hit by a bus at any time and then nobody would be able to fix his high performance code. The whole interview took about 2 hours. For interns at Arm now we have a technical interview and a non-technical interview. One is about making sure you have the right attitude for success and the other is about checking your technical skills. We’d generally take someone who had a good attitude even if they weren’t yet perfect at the technical side, because we can teach the technology but it is harder to find an enthusiastic attitude for learning.",
        "ts": "1543787171.001200",
        "username": "James Greenhalgh (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-02\/493626961461_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I remember my technical interview for Arm being a disaster haha! They almost didn’t hire me, and we still laugh about the interview now!",
        "ts": "1543787278.001300",
        "username": "James Greenhalgh (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-02\/494478909655_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]