[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey, let me start by saying I think you have a great starting place with the personal statement you’ve shared with me. I think the way to make it better is to look for your key strengths and interests and bring more of them out, and to clarify what you mean in some areas. Reading through it, here is what I think you’re saying are your interests and strengths, I wonder if you agree with me, or if you have more that you would add, that I’ve missed reading your personal statement.\n\nStrengths\n\n * Interest in learning and doing things beyond what the coursework would require (building your computer)\n * Tenacious, motivated to continue when things are hard, and go to any length to work through problems.\n * Breaking problems down, solving the smaller problems and then iterating towards an even better finished solution.\n * Works to share what you know with others (helping the computer club, working with year 9’s\/year 11’s, teaching your friends how Neural Networks function).\n * Academically ahead of other students.\n\nInterests\n\n * Artificial Intelligence\n * History of computing\n\nWith that list, I think you should be pleased with the examples you give for your strengths, they come across very clearly to me. What I think makes for a really great personal statement is knowing what you are interested in. I’d be really interested to read what you think are the most exciting problems in AI that will be solved in the next ten years. I think you have room in the personal statement to show the passion you have for AI, and what you want to learn from a university course that will let you take your enthusiasm for learning, your “do whatever it takes” attitude, and your ability to break problems and teach others, and use that to really understand how AI fits in to the world of computing and computer science!",
        "ts": "1538259124.000100",
        "username": "James Greenhalgh (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-09-29\/446097886165_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]