[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Aspen,\n\nWow, that’s some good timing! So, I don’t need to give much introduction to our main business at Arm, then :-), but maybe you’d be interested to hear we also have a group working on specific processors for power efficient machine learning for devices like mobile phones. We have an accelerator codenamed Project Trillium, and a suite of software tools and functions to accelerate neural networks for fast, power efficient AI. If you’re interested, this page <https:\/\/developer.arm.com\/technologies\/machine-learning-on-arm> has an overview of some of what we do.\n\nWhat programming languages do you like to write in? Do you have any projects you’ve been pleased with recently?\n\nFor your questions; my course was Computing MEng at Imperial College. This page has the detailed list of the topics the Imperial teach, though some will have changed as I left 6 years ago and computing is an industry full of change! <https:\/\/www.imperial.ac.uk\/computing\/prospective-students\/courses\/ug\/beng-meng-computing\/meng-comp\/> . The course ran for 4 years, between the third and fourth year we had a 6 month industrial placement. I took my placement at Arm where I met a lot of my current colleagues, and they offered me a full time job for when I finished university.\n\nA “Staff Engineer” is just a title. Quite a few engineering firms use the same title, and at some companies it is more senior than others, but at Arm we have title scales that go “Graduate Engineer” - “Engineer” - “Senior Engineer” - “Staff Engineer” - “Principal Engineer” - “Senior Principal Engineer” - “Fellow”. Each time you get promoted you are expected to be a bit more important to the success of the company, so Staff Engineer roughly means I am able to lead teams of people, make strategic choices about what our team should do, understand my technical area (compilers) very well, and have some influence with other teams around the company. I’m working hard to make the next promotion, and this year in Austin is part of that, giving me a chance to meet another side of Arm’s business and work on some different technology to expand my knowledge and skills.",
        "ts": "1537932066.000100",
        "username": "James Greenhalgh (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-09-25\/444479163734_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "ARM Developer",
                "title": "Machine Learning on Arm – Arm Developer",
                "title_link": "https:\/\/developer.arm.com\/technologies\/machine-learning-on-arm",
                "text": "Arm technologies enable the world’s most popular AI platform - the smartphone - to benefit from machine learning (ML) features like predictive text, speech recognition, and computational photography.",
                "fallback": "ARM Developer: Machine Learning on Arm – Arm Developer",
                "from_url": "https:\/\/developer.arm.com\/technologies\/machine-learning-on-arm",
                "service_icon": "https:\/\/developer.arm.com\/shared\/common\/img\/favicon\/apple-touch-icon.png?v=2.23.0.0",
                "id": 1,
                "original_url": "https:\/\/developer.arm.com\/technologies\/machine-learning-on-arm"
            },
            {
                "service_name": "Imperial College London",
                "title": "Computing (MEng)",
                "title_link": "https:\/\/www.imperial.ac.uk\/computing\/prospective-students\/courses\/ug\/beng-meng-computing\/meng-comp\/",
                "text": "Please note that the course listings below are from the current year and as such provide an indication of the degree programme for next year:",
                "fallback": "Imperial College London: Computing (MEng)",
                "thumb_url": "http:\/\/www.imperial.ac.uk\/T4Assets\/favicon-196x196.png",
                "from_url": "https:\/\/www.imperial.ac.uk\/computing\/prospective-students\/courses\/ug\/beng-meng-computing\/meng-comp\/",
                "thumb_width": 196,
                "thumb_height": 196,
                "service_icon": "https:\/\/www.imperial.ac.uk\/assets\/website\/apple-touch-icon.png",
                "id": 2,
                "original_url": "https:\/\/www.imperial.ac.uk\/computing\/prospective-students\/courses\/ug\/beng-meng-computing\/meng-comp\/"
            }
        ]
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Wow that amazing, at the moment I am working on my school project on html making a webpage, I have also brifly looked into AI in the last couple of days, also I have looked into games creation on pc and phones unity specially intrigues me. I have found some universities that I would like to study at, some of them offer placement that you got, can you tell me more in detail how it works. Thanks",
        "ts": "1537942937.000100",
        "username": "Aspen (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-09-25\/444231079751_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I have already learnt some python, PHP, HTML, <http:\/\/VB.net|VB.net>, CSS, JavaScript, some jQuery",
        "ts": "1537943029.000100",
        "username": "Aspen (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-09-25\/443079104979_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]