[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Super fast, and the king of the gods (we are not very subtle haha!)",
        "ts": "1539906778.000100",
        "username": "James Greenhalgh (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-18\/458908117296_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Because we don’t make the processors, it is up to our partners to decide on the final clock speed. We’ve designed our recent processors like Cortex-A76 aiming for something that partners can run at 3 GHz.",
        "ts": "1539908962.000100",
        "username": "James Greenhalgh (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-18\/459490787556_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Something I didn’t really understand until recently is that the clock speed we can aim for is limited by how much logic you have in the processor to make it fast by other methods. Because you need all the logic to do its thing in time for the clock cycle, and because physics limits how fast signals propagate through the circuit, the more that you want to do in one clock cycle, the harder it is to have high clock speeds. And higher clock speeds use lots more power. Everything around clock speed is a very careful balance!",
        "ts": "1539909207.000100",
        "username": "James Greenhalgh (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-18\/460719992871_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I can’t think of any programming task I’ve done where I haven’t had to use the internet at least once! Haha. Sometimes it is for simple things like forgetting how to get the length of something in python (I always try to do thing.length() because I remember too much Java, but really it is len(thing) - and yes, I googled it just now for this message hah!), sometimes it is for really complicated things like how the algorithm I’m implementing is supposed to work. I think most of my friends are the same; Google and Stack Overflow are such good tools for programming!",
        "ts": "1539909494.000100",
        "username": "James Greenhalgh (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-18\/460721841831_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Writing a compiler (or code for a neural network) is all part of the same kind of thing. If you’re good at thinking about what needs to happen, and breaking down the problem in to the steps that need to happen, it is easier. Though it is still careful and challenging work, it is definitely possible for anyone who understands how to understand the real problem!",
        "ts": "1539914563.000100",
        "username": "James Greenhalgh (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-18\/459700068370_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]