[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey, so I wanted to tell you about something I did yesterday, because not many people I’ve met in computing do it, and I found it very useful.\n\nI’ve been struggling with a proposal to put together a new team at Arm to focus on software performance optimisation. I can talk to my managers in my part of the company about the proposal, but they’re also the people who will eventually have to approve it, so I want to avoid asking any questions that might make me seem uncertain it is a good idea.\n\nThere’s a very senior manager out here in Austin who is in a different part of the company. I don’t know him very well, but he helped with some of my moving over here and the budget approval for it, and said I should feel free to talk to him while I’m here. He was probably just being polite, but I’ve used that option a few times to share my career and business ideas with him. Because he’s not in my direct management, I can talk much more openly with him about complicated problems (like how to get agreement to launch a new team).\n\nWhen most people in the company are looking for a mentor, they look for someone they will meet every two weeks to talk about these kind of things, but I find asking for that level of commitment scares some people off. It can be very useful to find mentors who you can talk to all over the place, and talk to them when their particular expertise is what you need. It builds a good working relationship with them, and can give you new perspectives on problems.\n\nI don’t know how much of that will be applicable to you right now and over the next year; I guess the best examples I can remember from university for me were the lecturers who had taught me once in the first year then had nothing formal to do with me again, but who I could always go back to for advice because we got on well. One of these lecturers I’m now friends with and we meet up every year!",
        "ts": "1547311196.000500",
        "username": "James Greenhalgh (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-12\/522553941589_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]