[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thanks, I am now managing a team of 10 people, so my life will be very different from where it was before!",
        "ts": "1554233598.000100",
        "username": "James Greenhalgh (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-02\/597667832116_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Wow, so who is managing going so far because when I have to lead my team in like chem practicals is pretty difficult",
        "ts": "1554236821.000200",
        "username": "Aspen (Mentee)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-02\/595357027328_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "It is really difficult, the biggest challenge is motivating people, helping them understand why their jobs are important, and giving them the big picture for everything that is happening in the company. Then the next big challenge is working with all the people who need my team to do something to try to keep them all happy and make sure we’re working on the right things. Then the next biggest challenge is trying to make sure that we have enough software development practices that the team knows what they are working on and can quickly raise problems they’ve encountered, and that we’re efficient. Then the team expects to see me leading them technically too; so if there is a technical problem they want me to be able to jump in and remember how to be an expert programmer. It is a lot of fun, but very hard :grinning:",
        "ts": "1554237145.000300",
        "username": "James Greenhalgh (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-02\/599222371462_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "How do you find leading the team for your chemistry practicals? What do you find difficult or easy?",
        "ts": "1554237180.000400",
        "username": "James Greenhalgh (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-02\/598858237687_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]