[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "In this production I can say that is quite well organized and people is talented. Our Environment team has always been ahead of 3\/4 weeks compared to the Layout team that comes after us. Sometimes it can happen because of deadlines. In my previous job was a nightmare as we were overloaded of work and managers didn’t care about the artists. But here in Blue Zoo was much much better. To be fair I don’t do a lot of real life drawing as I would! But generally I go to coffee places or museums! I literally went three times to the Maritime Museum in Greenwich to sketch the objects! was amazing I suggest you to go as well. You can learn alot without thinking ‘what can I do now?’ I will do more with summer. I love pencil and ink sketches but also I’m practicing more with gouache!",
        "ts": "1579120712.001200",
        "username": "Enrico Buffa (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-15\/908178287664_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I have loads of book to recommend! I’ll check better tomorrow on my mac so I can tell exactly which one is good for what area! ",
        "ts": "1579120759.001300",
        "username": "Enrico Buffa (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-15\/908179464336_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "ps. if you go to Forbidden Planet they have an area with books they want to get rid of and you can find really good artbooks as well!",
        "ts": "1579120807.001400",
        "username": "Enrico Buffa (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-15\/908180733760_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]