[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "which part of the statement is making you feel like struggling at the moment, did you get through the qualities and personal interests part that you mentioned was a bit tricky for you in the beginning, or you feel like you still want to add more to that?",
        "ts": "1539254996.000100",
        "username": "Stefi Daskalopoulou (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-11\/453987604850_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yes, I was a bit nervous in the beginning of uni but on the other hand because everything was very new I was very excited. But yes, after the first excitement I was feeling homesick at times, but I was visiting home a few times a year to balance it out :smile: I believe it definitely gave me personally much more, than if I were to have not moved out..",
        "ts": "1539255132.000100",
        "username": "Stefi Daskalopoulou (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-11\/453817495428_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "The cons... I would say the financial aspect and being homesick but I really think that being away contributes a lot to growth.. so not sure about the last one hehe Because this is only the natural way of life and of course you will be going to visit and be with the family and the people you love every now and then so you get a bit of both :smile: I honestly cannot think of other cons... I think it's a great experience :slightly_smiling_face:",
        "ts": "1539255385.000100",
        "username": "Stefi Daskalopoulou (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-11\/453253020192_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "and yes it's only normal for it to be a bit overwhelming in the beginning...but afterwards it will be fine and easier to manage",
        "ts": "1539255428.000100",
        "username": "Stefi Daskalopoulou (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-11\/453899045219_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]