[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Definitely and you'll see as time goes by these naturally felt skills will become better and better :smile:",
        "ts": "1539867703.000100",
        "username": "Stefi Daskalopoulou (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-18\/458351648352_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Well, since I studied Business Psychology at my Masters degree, we did subjects like Counselling in the workplace, Organisational Behaviour of Employees, Coaching, Training &amp; Development, Change Management, Research Methods (this you will do in all psychology departments as it's about dissertations and researches as a professional), etc. so the modules I did were more oriented about people in a workplace environment, but when I studied Life Coaching I did CBT (Cognitive Behavioural Therapy), Humanistic Psychology, Behavioural Analysis of Emotions etc.",
        "ts": "1539867906.000100",
        "username": "Stefi Daskalopoulou (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-18\/458921329220_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "As far as I am concerned, in a Bachelor degree of Psychology the modules are along the lines of Developmental Psychology, Brain and Cognition, Social and Biological Psychology, probably Neuroscience and Forensic psychology as well  etc.",
        "ts": "1539868042.000100",
        "username": "Stefi Daskalopoulou (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-18\/459289912565_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "So, I cannot tell you from my experience exactly about the BSc. of Psychology in terms of coursework, but for example in my MSc. Business Psychology we had exams and coursework which are quite nicely distributed throughout the year without having them all together and you definitely will have much time to prepare.. I was finding my self procrastinating (:laughing:) at times and that I was working better under pressure closer to the deadlines but looking back to it now, I think I could have definitely started projects a lot earlier than I did and not stress my self so much in a tight time frame hehe",
        "ts": "1539868184.000100",
        "username": "Stefi Daskalopoulou (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-18\/460469066982_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "About notes... the first years I had notebooks and writing down notes, and in the later years I did start using my laptop but it really depends on what you're most comfortable with personally.. Some people feel more connected with hand writing, some prefer the speed of typing.. I find both useful and go with how I feel each time! A good idea would be to try both and see with which you feel more in alignment :wink:",
        "ts": "1539868301.000100",
        "username": "Stefi Daskalopoulou (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-18\/458359678704_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I'm sure if you decide to move out in the end, it will be an amazing and growing experience :smiley::+1:",
        "ts": "1539868407.000100",
        "username": "Stefi Daskalopoulou (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-18\/460155417287_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]