[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Manvir! Well, basically life coaching and personal development coaching are the same, but I just chose to call it more often with the second one hehe :smile: So, my typical working day is preparing for my sessions before hand by reminding myself about the client and what I want to work on with them for the session, and then in between sessions (because I have recently started, a have a few clients) I try and see how I can reach more people and what I can do to further develop myself to be of better service to others! So I do lots of reading and self work in between as I feel like there's always room to make ourselves better and that is never stops, but that's what fascinates me :smile:",
        "ts": "1538733615.000100",
        "username": "Stefi Daskalopoulou (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-05\/451043075991_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I also wanted to ask you, in relation to other people (friends, family etc), do you find yourself at times being curious about them and how they work, or you have an interest to get to know people deeper or do people often come to you for advice etc. ?",
        "ts": "1538733955.000100",
        "username": "Stefi Daskalopoulou (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-05\/449389643233_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Oh wow that sounds so cool, do you work in like a clinic. Where do you meet your clients? And yeah i’m always giving advice to my friends and family about problems that there going through, and i’m pleased to say they appreciate my help:laughing: I personally have a small circle of friends that i am very close with and i like having a small group of friends rather than a large group of friends.This is because i like to get to know people very well, and find that with large groups of friends it’s harder for me to get close with anyone. ",
        "ts": "1538742644.000100",
        "username": "Manvir (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-05\/451129780471_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "No, I started my own practice and after having experience by coaching many people for free in the beginning, I decided that I was ready to it properly professionally! I usually either meet my clients in a quiet coffee shop, or if the weather's nice we go out for a walk in a park or by the river (I find nature in combination with inner work to be quite therapeutic :relaxed:). I also have a few sessions over the phone, or through video calls.",
        "ts": "1538744689.000100",
        "username": "Stefi Daskalopoulou (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-05\/449496746817_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "What you are describing above is very helpful and of value to add to your personal statement because these are much needed characteristics for the psychology field so you'll do just great, I'm sure :smile: That's why I asked because I thought that would be the case.. Now about the smaller circle of friends, that is usually the case as getting close with people takes time and if you already have a group of a few you are close to, then you can choose whether you'd like to come closer to other people or not according to how you feel like.. Large group of friends can be overwhelming as we usually don't know how to handle the energy of so many people, I am the same as you in this one and I do find it very often in people.. That is also a reason for me that I prefer to do one to one coaching rather than group coaching, but it is also something I would like to work on later on and maybe try it and see :smile:",
        "ts": "1538744993.000100",
        "username": "Stefi Daskalopoulou (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-05\/450289738677_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I also think that the more time goes by and we discover things about ourselves and how we act etc etc (studying psychology is a bit plus for this hehe)  the more able we are to handle other people in many ways.. in addition, about the larger groups of people, there you have increased possibilities to have people who might not want to be known well for example so that's why it might also be more difficult.. but with smaller groups it's easier to handle time and energy exchange with every person",
        "ts": "1538745288.000100",
        "username": "Stefi Daskalopoulou (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-05\/451161888167_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "How is the personal statement draft going, did you write a few things roughly?",
        "ts": "1538745764.000100",
        "username": "Stefi Daskalopoulou (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-05\/449377234240_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]