[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "*My role:*\n\n• I'm a Programme Manager at the NHS which means I am in charge of running various large-scale projects (for example, deciding to change a key supplier or creating a new more streamlined - and cost-saving - process!). \n• I'm lucky that I get to work with multiple teams across the NHS to get the project over the line (as well as our suppliers\/customers)\n• I need to make sure we meet the project's budgets, timelines, hit our KPIs (which stands for Key Performance Indicators i.e. the targets we want to meet) and also communicate with a wide variety of stakeholders (i.e. lots of different people might need to be aware of changes in they way they work as a result of the project). \n• I also work with senior management to decide which \"Projects\" we will work on in the first place, so I do a lot of strategy work and creating business plans which we analyse and decide whether or not to persue them!",
        "ts": "1574180268.002100",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-19\/827872346738_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "What do you mean you've felt a bit lost recently? That's okay! I didn't know what I wanted to do for a career and to be honest I still don't (which might sound a bit weird). I knew I wanted to build certain skills and have a certain fast-paced work-life that would inspire me and working for the NHS seemed to fit me, so I went for it. Who knows where it will lead or whether I will stay in the NHS, but the role has helped me develop great transferable skills that I can take to most jobs",
        "ts": "1574180380.002200",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-19\/829193153555_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "You are right that not all NHS roles are advertised, especially to people starting out their careers.\n\nThe NHS have a great tool on the website to help you think about where you might fit.\n\nWhy don't you give it a go!? <https:\/\/www.healthcareers.nhs.uk\/FindYourCareer>",
        "ts": "1574180458.002300",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-19\/840202458484_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "It asks you about what you might like doing e.g. working with children, working in an office, being interested in chemistry etc and helps you whittle it down to a few roles\/areas. Perhaps if you give it a go (when you have time), then we can discuss your results!",
        "ts": "1574180562.002400",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-19\/842879411174_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "P.S I'm sure your henna business would be great to have at weddings\/hen parties too!\nP.S.S I said I liked to cook lots, I didn't say I was any good at it :sweat_smile::stuck_out_tongue_winking_eye:",
        "ts": "1574180676.002500",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-19\/842882835302_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "*Your question about studying Medicine at uni \/ work experience:*\nI would say the experience you have already shows a genuine interest in the field which is great. You can never have too much experience when you are just starting out as everything is a learning opportunity.\n\nWhat would the hours be at King's College Hospital? I had a part-time job whilst studying A-Levels but I didnt have time for anything else really! What grades are you expecting too? That way I can advise you better i.e. whether to focus on revision vs experience\n\nSorry to hear you are not having much luck emailing people. Have you tried outside of the NHS i.e. independent healthcareproviders (Bupa, BMI, Care UK), healthcare non-profits (e.g. Nuffield Health, British Red Cross, Sue Ryder, etc.) or even \"health\" tech start-ups (such as Babylon <https:\/\/www.babylonhealth.com\/>)",
        "ts": "1574181007.002600",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-19\/840691681589_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "Babylon Health",
                "title": "Babylon Health - The Online Doctor and Prescription Services App",
                "title_link": "https:\/\/www.babylonhealth.com\/",
                "text": "See a doctor online in minutes using your mobile from home, work or holiday. Prescriptions, referral letters and sick notes delivered near instantly. Open 24\/7.",
                "fallback": "Babylon Health: Babylon Health - The Online Doctor and Prescription Services App",
                "image_url": "https:\/\/assets.babylonhealth.com\/redesign\/_1200x630_crop_center-center_82_none\/open-graph.jpg",
                "image_width": 476,
                "image_height": 250,
                "from_url": "https:\/\/www.babylonhealth.com\/",
                "image_bytes": 57213,
                "service_icon": "https:\/\/www.babylonhealth.com\/apple-touch-icon.png",
                "id": 1,
                "original_url": "https:\/\/www.babylonhealth.com\/"
            }
        ]
    }
]