[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "*Sorry for the long message coming hehe. I just want to give you good answers to your very thoughtful questions!!*",
        "ts": "1574353011.003300",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-21\/836178746113_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I would say Pros of my job are:\n\n• I'm learning leadership\/management skills which I can take with me to any future job and any industry. Each programme I run feels like a mini business that I'm running!\n• I get to mix with lots of people across the NHS + customers\/patients etc so I feel like I have a great overview of the entire industry in just a few years of working on the job\n• I get to see the impact of the decisions we make. For example, if i was a consultant making recommendations about what projects the NHS should go ahead with, usually they will move on to the next client and never know what impact they had or whether it was the right decision. I get to see what happens next &amp; actually implement it!\n• I'm constantly learning and meeting new people",
        "ts": "1574353041.003400",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-21\/845964438151_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "If I'm honest these are the cons of my job:\n\n• Can be long hours. Given a lot of staff work shift hours etc it means I can be working those same hours in order to work with them and get stuff done\n• I have to manage lots of different stakeholders who all have different wants and needs and inputs and concerns. I can never make EVERYONE happy its just not possible, so I constantly have this battle.\n• Some of the decisions we make can profoundly affect peoples lives. This makes it a bit stressful to make sure you make the right decision!\n• I feel like I have a creative side to my personality which I dont use on the job! But thats' what hobbies are for i guess :smiley:",
        "ts": "1574353052.003500",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-21\/832637820611_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I don't see myself in this job forever, no, but it certainly has set me up to be able to take on senior leadership roles. For example if I were to sit in a corner and just focus on a certain niche area of healthcare, its unlikely I would have had the oversight and people experience \/ managing people to be able to become really senior (and thus earn lots of :moneybag: down the line!). I'm quite open as to what comes next. I do love the healthcare industry, but sometimes I feel like innovation can be slow ... perhaps I could think about some of those health tech startups I mentioned to you ... who knows!!?\n\nI'm sad that you feel pressure from A-Levels, but I understand. It was probably one of the busiest times of my life and there were times when I doubted if I could get the grades, but hard work pays off #HWPO!!! I studied Fine Art, Psychology &amp; Business and got AAA (we didnt have A* back then..). I ended up studying Business at university.\n\nWhat motivated me to do the job I'm doing now...I wanted to learn how to run a business ultimately \/get management experience and I was passionate about wanting to work in an industry that helps people. Healthcare seemed like a no brainer! and the NHS are one of the biggest recruiters of graduates so I saw adverts with them all over the place.\n\nFor your King's college job, 2-3 hours doesnt seem so bad. I had a part-time job during A-Levels (working 9-7pm both saturday and sunday), so I would say GO FOR IT if you feel you can manage your time well and control your stress-levels with exercise\/healthy eating etc. Especially if you truly think you will enjoy the Kings college experience. All experience is worthwhile usually, especially with such a prestigious name.\n\nHaha yes Imperial is THE DADDY of healthcare degrees! Will you be doing UCAS forms etc soon? Happy to help you with that for sure. Would love to hear more about the programme they are running for you. Will be great for your CV.\n\nFor your henna biz ... why not set up a little website and write blog articles about henna for parties and weddings and that way when people search for henna at weddings you'll come up!! You could even give your card to other wedding providers \/ wedding planners and ask them to recommend you :smiley:",
        "ts": "1574353114.003600",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-21\/836181834977_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]