[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Samantha, how are you doing? I have a question- can I not specialise in more than one type of physiotherapy?\n\nI have had some reflection time in the past few weeks and this is what I came up with:\n\nSo my plan would be then to do physio at a respected uni, start my career by 21, as I already have plans of travelling when I grow up I will do that and also get paid. I will see how that goes and if I would like to keep on travelling. If I like it, then I'll continue until I'm 23-24. After that I would like to settle down here, perhaps either work in the NHS or a private sector, and go up the ladder. The pay doesn't sound too bad, 28k average in the first year, and could go upto 60k.\n\nWhat do you think of this?",
        "ts": "1582573008.000100",
        "username": "Jinafa (Villiers E-Mentoring)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-24\/968912997494_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I have also taken into account how you said I was aiming low, and to be honest I couldn't agree more now that I think about it. I think I have a fear of failure, if I want something I really want it and if I don't get it then I get upset and mock myself for not being enough to get there. Its pretty toxic and something I should get rid of really.",
        "ts": "1582573124.000200",
        "username": "Jinafa (Villiers E-Mentoring)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-24\/955239149907_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Brunel will probably be in my list but my main one would be St George's as it is a top uni for physio",
        "ts": "1582573158.000300",
        "username": "Jinafa (Villiers E-Mentoring)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-24\/966253747796_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "As always thank you for the advice I really appreciate it:heart:",
        "ts": "1582573179.000400",
        "username": "Jinafa (Villiers E-Mentoring)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-24\/968917996934_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "And I am still acting like I would like to do medicine, I still am doing voluntary work and all that, I even signed upto a conference from Imperial for next month. At this point I'm just going with the flow, I don't think medicine is for me but I'll carry on because attending these activities have given me many chances like work experience at a hospital which I probably would have never got if I didn't get accepted into the programme.",
        "ts": "1582573322.000500",
        "username": "Jinafa (Villiers E-Mentoring)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-24\/968574362215_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "The reason why I think medicine is not for me:\n1. 5-6 years, by the time I graduate all my friends would probably be settling down and I'll be behind\n\n2. That means a debt of 54k, that's a mountain of debt that doesn't sound pleasant at all\n\n3. Starting salary as a gp is 30k, and that's after 6 years, with physio I'll be doing half of that and get almost the same amount\n\n4. Content is hard, I don't want to keep on eating books for the rest of my life\n\n5. Overworking hours, sometimes you may not even get paid\n\n6. I want to settle down when I'm around 23-24. However before that I would like to start my career, so that's doesn't seem possible.",
        "ts": "1582573609.000600",
        "username": "Jinafa (Villiers E-Mentoring)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-24\/955253701027_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I'm sorry for the 50 mark essay haha but just had to let my thoughts out, do you think I'm being rational?",
        "ts": "1582573643.000700",
        "username": "Jinafa (Villiers E-Mentoring)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-24\/966741004581_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]