[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Jinafa! So good to hear from you and I'm so impressed with how screwed on your head is :smiley:\n\nI'm slightly unsure what you mean about specialising in more than one type of physiotherapy? Usually your degree i.e. in physio would start off broad but allow you to choose options as you progress each year so that you can specialise in the areas that interest you. For example, I had no idea I liked quantitiative analysis\/stats until 1st year of uni and then I ended up specialising in lots of Finance modules and smashing them!",
        "ts": "1583364627.001300",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/971184927843_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "When are you thinking of travelling? Straight after university &amp; before you start a career or after you've been in your career for a while? I got the travel bug after meeting some people at uni that were into it - i'd never thought about it before, living in my little London bubble. I actually went on a gap year so happy to chat to you about that if there's anything you'd like to know.",
        "ts": "1583364723.001400",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/971186951523_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Do you mean you want to travel and work at the same time in physio straight after university?",
        "ts": "1583364773.001500",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/982673777445_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Either way I think travelling straight after uni is the best idea I ever made. I can't speak for everybody, but I got all of the travelling and exploring out of my system (for a while anyway :stuck_out_tongue_winking_eye:) and then was pretty happy to crack on with climbing up the ladder when I got back. However the opposite might be true, you might get inspiration whilst you're away or come across new people\/opportunities that change your direction ... and that is just as awesome",
        "ts": "1583364850.001600",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/982656491264_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I mock myself too if I \"fail\", but I've come to love \"failure\". If you're always getting things right, that means you're probably not challenging yourself enough and getting out of your comfort zone\/learning new things",
        "ts": "1583364902.001700",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/969870153570_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Your main option is to use that energy of reaaaaaally wanting something and working your ass off. I really recommend you follow @Garyvee on instagram. I think you'll get inspired by all the stuff he says about this!!",
        "ts": "1583364970.001800",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/982205029876_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hiii, haha thank you, after a long time I've come to make a clear plan.\n\nOh, didn't know that, I thought the degree would be the same for everyone and you get trained on different things later on, but I guess it's all together.\n\nI think I would like to work and travel, so to think about it disabilities and injuries may be the most useful type of physio I could do because there's alway going to be incidents or people that have genetic problems?",
        "ts": "1583365338.001900",
        "username": "Jinafa (Villiers E-Mentoring)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/972570624193_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I think I would just travel in between my holidays as its probably not possible to combine both",
        "ts": "1583365372.002000",
        "username": "Jinafa (Villiers E-Mentoring)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/984876871158_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "What counties have you been to? That sounds pretty nice",
        "ts": "1583365399.002100",
        "username": "Jinafa (Villiers E-Mentoring)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/982685895493_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Okay I shall follow him!",
        "ts": "1583365452.002200",
        "username": "Jinafa (Villiers E-Mentoring)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/982668072576_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "OK so here are my comments to each of your points about not wanting Medicine:\n1. 5-6 years, by the time I graduate all my friends would probably be settling down and I'll be behind *&gt;&gt; This is a fair point and could impact your confidence, however you'll prob find you'll be \"ahead\" of them in 10 years time, when they were busy settling down, watching TV, going shopping at the age of 21. For example, I have a friend who is an entrepreneur and didnt have a salary for 2 years. They felt like the cheap ass vs us, but then sold their business for £2m and now we are the cheap asses haha. Think of the LONG GAME!! Also, I recommend against comparing yourself to friends. Sadly, friends aren't forever and you'll very likely find new besties at uni that are in whichever field you choose to study (and others too!)*\n\n2. That means a debt of 54k, that's a mountain of debt that doesn't sound pleasant at all *&gt;&gt; Definitely doesnt, but when you come to pay it off it is just a small (fairly unnoticeable) % of your salary.  You've got to do the maths - can this investment help you earn more? I definitely think going to Medicine route you'll be on £100k in no time and your student debt will be paid off within 5-10 years of graduation.* \n\n3. Starting salary as a gp is 30k, and that's after 6 years, with physio I'll be doing half of that and get almost the same amount *&gt;&gt; Similar point to I made above. Think of the long game...you might earn a similar amount earlier, but in 10 years you'll likely be earning a lot less than if you had studied Medicine at Imperial. If you reallllllly want it, you'll be happy to put in the work for 6 years (note: you wont jsut be sitting in the classroom the whole time) and success will come, but if you are going to see it as a slog then you might not get good grades at uni which has a snowball effect i.e. less employers interested means less pay potentially etc...my advice is to visualise what kind of work you would be THRILLED to turn up to every day ... do that!!*\n\n4. Content is hard, I don't want to keep on eating books for the rest of my life *&gt;&gt; Medicine degree will likely involve a lot of experience outside of the classroom, but yes I would say you have to love the content you will be studying. Just a quick note, but most careers take 6 years to get anywhere even if the degree is only 3 years (for example in Asset Management I have a friend who has been studying the CFA for 3 years, in Accountancy I have a friend who has been studying to become an Accountant ACA for 3 years...and this is after a 4 year degree!). I would say Medicine and healthcare is sooooo much more interesting haha*\n\n5. Overworking hours, sometimes you may not even get paid *&gt;&gt; Most high-powered jobs will have an element of long hours where you might not get paid for it, bot overall your earning power is greater. For example, an investment banker working 100 hours a week earning £45k might actually get paid less than minimum wage on a per hour basis, but hardly any other jobs straight out of uni allow you to earn that much (even if you did overtime)! That salary will shoot up to £200k within 4-5 years...I'm definitely not suggesting you go into Investment Banking, but just trying to reiterate my point about the LONG GAME! haha*\n\n6. I want to settle down when I'm around 23-24. However before that I would like to start my career, so that's doesn't seem possible. *&gt;&gt; What is your definition of settling down exactly? I'm 30 and have no intention of \"settling down\", but then my definition of settling down is sitting on a beach reading a book drinking cocktails! I'm so interested in the work I do that I think I'd get bored doing that too soon. Having said that, I read a book called \"4 hour work week\" and it talks about taking breaks throughout your career e.g. to travel etc, which I'm a big fan of*",
        "ts": "1583365941.002300",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/984887517798_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Anyway there is my 50 point essay right back at ya!!",
        "ts": "1583365959.002400",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/982696463077_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": ":joy:",
        "ts": "1583365967.002500",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/969890406386_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Well generally you will study the same modules in 1st year, and then 2nd year you might take certain subjects that your peers dont take and vice versa. It depends on the degree\/uni as to the structure!",
        "ts": "1583366061.002600",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/984542447575_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I started in South Africa, via middle east (UAE\/India) to far east (china\/japan\/Malaysia\/Singapore\/Thailand) and then south america (chile, bolivia, peru, brazil, argentina!)",
        "ts": "1583366550.002700",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/969902755490_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Anyway that's a lot to digest above haha so take your time.",
        "ts": "1583366572.002800",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/969903244146_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yes University of London is a great great brand to have on your CV. I think St Georges course looks great as it has lots of work experienc eincluded",
        "ts": "1583366633.002900",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-04\/982710701125_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]