[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "_@chloeroberts98 has joined the channel_",
        "ts": "1587374413.001300",
        "username": "smooz (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-20\/1096803379264_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "_@alexander.breitfeld has joined the channel_",
        "ts": "1587374420.001400",
        "username": "smooz (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-20\/1073171943539_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Chloe, please meet Alexander your incredible E-Mentor we've been telling you about :smile:.  Feel free to introduce yourselves, say a little bit about what you would like to get out of the mentorship and continue chatting within this channel. :wave:\n\nI will now be leaving the channel, but please direct message myself or penny-prospela if you have any questions. All the best for now! :slightly_smiling_face:",
        "ts": "1587374422.001500",
        "username": "Emma Sullivan (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-20\/1072962017266_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "_@emma has left the channel_",
        "ts": "1587374425.001600",
        "username": "smooz (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-20\/1096803723104_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "_@emma has left the channel_",
        "ts": "1587374428.001700",
        "username": "smooz (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-20\/1072962205522_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Chloe,\nhope you are doing alright in this weird Corona time. I'm looking forward to helping you get a foot in the door in VFX and become a better artist in general :) . Just to break the ice I'd start by telling you a bit more about myself and what my experience in the VFX industry has been so far.\nI started off by studying Audiovisual Media in Stuttgart in 2013. A very broad bachelors degree that wasn't just about vfx but rather film, music, animation, computer science, interactive media and everything else that comes to mind.\nAfter graduating I got my first gig at Pixomondo as a CG Generalist on the first season of Star Trek Discovery. Though I am a generalist at heart I always enjoyed lookdev the most so I quickly moved from doing all kinds of things to focusing on lighting, surfacing and environment dressing.\nThey were quite happy with me and started giving me independent hero tasks more often like full characters or environments. I also got the opportunity to lead small teams on some of the bigger shows and do a few internal workshops.\nWhen I had developed an interest in groom but realized that Pixomondo Stuttgart wasn't getting a lot of creature work I decided to move to a different city and give grooming a proper shot. I accepted a position at One of Us in London and still work here as a full time groomer (and occasional lookdev artist). As I am starting to move towards a leading position I wanted to get a bit more practice in mentoring others and passing on some of the insight I've gained so far.\nUltimately I'd like to move into feature animation and work for Pixar, so I take every opportunity that brings me a bit closer to that goal :D\nBut enough about me. Tell me a bit about yourself, what you hope to gain from this and what it is you want to achieve.\nCheers,\nAlex",
        "ts": "1587376871.001800",
        "username": "Alexander Breitfeld (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-20\/1085668186865_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Alex,\n\nThank you for allowing me this opportunity to learn from you, I really appreciate it. Thank you for your concerns I’m doing the best I can in a time like this I guess, its not really something you expect to go through during your last year of university but my housemates and I set up our own mini VFX office in our living room to finish off our projects and so we don’t go insane from boredom. Hope everything is well on your end :)  \nI am currently studying at the University of Hertfordshire, we are coming close to the end of finishing our degree film, its a live-action short about two drunk bees on a first date who get very drunk and chaos ensues. I’m grooming both bees on this project as well as doing the texturing, look-dev and simulation for the fur. I’d say I’m most confident in DigiDoubles, I’ve done a female DigiDouble previously and I’m working on a bearded male at the moment, I’m always looking to improve more on grooming in general but mostly I’m not so confident on the lookdev side of fur, its only something I’ve only recently started so I feel as though I have a lot to improve on in that department.  \nMy goal ultimately right now is to get that first step into the industry I know that I still have a lot to learn and I’m really looking forward to gaining as much knowledge as possible to become a valuable member in the VFX industry. \nAll Best,\nChloe",
        "ts": "1587401911.001900",
        "username": "chloeroberts98 (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-20\/1086672415201_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]