[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Alex! Apologies on the late introduction, I’m back up north visiting family for a couple of weeks and have been so busy! \n\nYour journey into the industry sounds awesome and it’s great to know that you love what you do. \n\nSo I’m Chris, I’ve always been fascinated by animated films (particularly Pixar) from a very young age, but a few years ago I learnt what VFX was and started to notice it more and more in films and decided to see if I could work towards a career in it! I did a 2 year diploma course which cover graphics, photography, video editing, and 3D modelling. Then I progressed onto Norwich University of the Arts (I live in Norwich with my girlfriend now) which is where I’ve just finished my second year and I’m moving into my third and final year of the BA VFX course. So this time next year I’ll be either looking for a job or hopefully maybe even started one! \n\nMy biggest interest is CG environments, I come from a modelling background but as you say, I’m not sure I have the patience for it and feel like I’m a bit over it after 3 years practicing. On my course at the minute we’ve covered all the basics of VFX so I have a great understanding of the whole pipeline, but over the last few months I’ve been trying to find something to specialise in. I’ve narrowed it down to something like texturing\/lighting\/lookdev. Preferably on environments or hard surface assets, because I don’t have experience with organic CG. Is there a role you think I’d be suited to within this sort of thing? (I’ll make sure to send some links over to my work when I’m back in Norwich) \n\nI personally also spend a lot of time gaming and a lot of time in the cinema  (I’ve seen Toy Story 4 twice already...:smile:)\n\nI don’t have too many questions right now but I’ll definitely make sure to think of some over the time we have to chat on here! Thanks so much for being a mentor on here I think it’s a great opportunity for everyone :+1::skin-tone-3: I’ll definitely start off with the most exciting question though! What projects have you been working on over the past couple of years and do you have a favourite? :boom:\n",
        "ts": "1562237773.001700",
        "username": "Chris Spencer (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-04\/687106095638_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Also just added you on LinkedIn! ",
        "ts": "1562254961.001800",
        "username": "Chris Spencer (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-04\/687057713079_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Chris, sure no worries :slightly_smiling_face:\nAnimated films are cool for sure, I used to watch Toy Story on VHS a lot :wink:\nYou can get a job anytime in this industry, especially if you are willing to move a lot between countries\/places in the beginning of your career. I can elaborate on that a little more later on.\n\nCG envs are cool for sure, just keep in mind it's a bit more competitive than let's say animation, programming or rigging.... because it's fun haha.  For example if you can code you have a huge advantage over everyone else in the beginning of your career. Also organic things are much more rare in the beginning of your career but only because they require a lot of skills. Not to say that you don't need that in envs, both are hard on a top notch level, but on average - characters are much harder(which is cool for me personally, I love challenges and working on all types of creatures\/characters)",
        "ts": "1562256215.001900",
        "username": "Alex Underwood (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-04\/678872481409_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "My favorite project? Hm I guess it's still dragon heart 3, film itself sucks but amount of effort which we all put into that dragon was incredible and I'm truly proud of the outcome to this day (which is like 6 years old by now). About projects, let's see, I will name the good ones. films wise - Maleficent 2, Shazam(meh not that good), Warcraft and the walk. Cinematics wise - skull and bones, ghost recon wildlands and some more but I don't remember really.",
        "ts": "1562256749.002000",
        "username": "Alex Underwood (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-04\/678878382561_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]