[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hola Nico,\n\nYeah, so apparently I managed to mute all notifications. To the extent that I didn’t see your reply! :slightly_smiling_face:\n\nNo rambling no, I found it really interesting. We all have very different backgrounds and different paths. What you said about motion graphics artists reorienting towards comp is indeed good news. I’ll do my best to play on these strengths when the time comes. This will be handy once I get to a comp position. I don’t think it’s the same for all companies, but what happened at my last company is they didn’t care what you had done in a previous life. You had the Roto tag and that was it. Plus what didn’t help is the supervisor we had was super into micromanagement which resulted in a very toxic and abusive environment. Not ideal when you’re just starting out. It was a painful experience which honestly made me doubt my decision to continue heading into this field. But after a bit of time, I can say that i won’t let a probably very sad person ruin my passion for VFX and i’m moving forward! :slightly_smiling_face:\n\nThe way it all started for me is about a few years ago, my then brother in law who is a director took me to a dailies at the small facility he has the VFX done for his films. He went and explained to me how they had achieved each effect. It took one dailies and I was hooked. I knew that’s what I wanted to do. I then had the opportunity to work on the titles and opening for the said film which was on After Effects. (I’m a fanatic of films openings). The facility in question offered me to get in doing nuke stuff, but at the time, I had no knowledge of the software. I decided i would learn it on my own. So i started like that and later on ended up getting in the courses i told you about. It all went pretty quickly.\n\nI could still have the opportunity to get into that company i think. The trick is they do have a very so so (not to say bad) reputation here in MTL as far as the way they treat people and that makes me very hesitant. They also have a history of not paying their crew. There are a lot of other places so i want to take my time and find a suitable place.\n\nThank you so much for sharing the reel you used to get into Framestore. It’s very varied and gives me a good idea of what to showcase in mine. My plan for my reel is to show some of my roto and paint work but also three comp shots. I have one that i recently did through a comp training with Josh Parks. I have a few tweaks to do on it but could show it to you very soon. Maybe we could share a Box or Dropbox folder if you’re ok with that. The second one is a shot of a private jet plane on a tarmac that was shot by a friend of mine for an ad and allowed me to use his footage. What i did so far using projections is some signs replacement, added some lines on the tarmac, changed the colors of the stripes of the plane. I’m going to change the background as well. Last shot will be a key shot from Tears of Steel. The one that has a sniper at the very top of a tower. i’m not sure if you’re familiar with it.\n\nWell, all of this might be a bit abstract, i’ll explain better when i can show you stuff :wink:\nThanks for your support, it’s really appreciated!\n\nHasta la próxima!\n\nAnne",
        "ts": "1553205617.005000",
        "username": "Anne (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-03-21\/585954532214_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]