[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yeah, I've decided on Biology :smile:! Sorry again, Sky cut off my internet (again). I'm back wooo! I hope things are going well for you also. I've decided to apply to East Anglia, Warwick, Southampton, Exeter and Royal holloway",
        "ts": "1510512853.000060",
        "username": "skumar-2011 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-12\/270501062209_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I've got work experience at my hospital within the ENT department!!",
        "ts": "1510512865.000064",
        "username": "skumar-2011 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-12\/272100063767_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Excited for that :')",
        "ts": "1510512870.000012",
        "username": "skumar-2011 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-12\/270943192771_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "my PS: Studying a Biological Sciences degree would allow me to explore the opinions it evokes and withstands on topics ranging from the evolution and behaviour of animals to the fight against disease and the strenuous attempts to conserve human diversity. I am increasingly intrigued by the intricate workings of organisms such as how mutant genes govern the diverse traits of cancer cells and how the traits of these individual cells determine the behaviour of tumours. In this I have discovered that biology poses many questions, theories and research methods, this outlines how Biology captures my imagination, and always leaves me with many questions that I hope to contribute to through research at a more intellectual level.  \n\nA-Level Biology has provided me with a strong foundation of conservation through our trip to Wakehurst Seed Bank. The trip enabled me to learn about conservation of plants and seeds, through ex situ and in situ. By doing this, I was able to observe see how essential is it to sustain them because of their medicinal properties. Despite having discovered how our organism defends itself against exterior threats, there are still many areas that scientists are consistently working on such as why we don’t reject our tumours even though the immune system has the capacity to recognise cancer cells or how bubbles are utilised to burst with ultrasound waves, releasing the cancer treatment drugs exactly where it is needed. Living organisms are the most convoluted structures known to humans and studying the importance of these organisms and the growing pressure on all species from emerging diseases, climate change and population growth are central to these organisms survival. I recently read an article outlining a new species of orangutan called the ‘Tapanuli orangutan’. The article narrated how it is already endangered, as there are less than 800 of its kind out in the wild. By being “one of the world’s most threatened ape” questions rise about where the species branched off into its own sub category as Professor Wich announces and how “there are only seven great ape species” which highlights the dire need to maintain the population. Outside of school, my hobbies include being apart of the science society, a recent debate we shared was on cancer and it enabled me to observe the cancer from a different perspective such as should we use methods of curing cancer if it means the patient’s quality of life is going to suffer. Attending Oxford’s UNIQ Summer School has opened my eyes to the prospects a health care career could take me down, it helped me form and deepen my understanding of the various research presently taking place after I spoke to Medicine students and Oncology students. UNIQ further helped me grasp the extent of resources available and how to use them efficiently. \n\nI helped out with the NHS Careers Fair day; I gained various pieces of information by various professionals; this is helpful as it provided me with alternative career paths. Furthermore, I participated in a fundraising scheme for Puerto Rico and the victims facing the aftermath of Hurricane Maria. I worked in a team under stress and strict time management to ensure we were efficient in selling and raising as much money as possible for the less fortunate who are deprived of basic life minerals such as shelter and food. We raised over 400 pounds across two days; this sum has stimulated a desire to be involved with campaigns surrounding current affairs to make a positive difference to the people affected which motivates me to excel.\n\nI also visited the Francis Crick Institute; where I developed a particular interest in cancer biology and the growth after speaking with scientists completing PhD research about the complexity of the cells. Reflecting on my time at the Institute, I am truly inspired to look further into topics for my own personal interest.",
        "ts": "1510512994.000046",
        "username": "skumar-2011 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-12\/271018936850_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]