[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "of course there will be times where deadlines are tight and you need to stay to get stuff out to deadlines. generally speaking the last two weeks of a project are when it gets a bit more chaotic and the chill time lessens but day to day, you will tend to leave on time at most places.",
        "ts": "1552384475.002900",
        "username": "Neal Patel (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-03-12\/572973856784_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "when i finished uni, yes i was applying at loads of places linked to my course. i didn't really have a showreel as i did not study VFX, it was more a multimedia type of course so it covered more graphics, motion graphics, audio and video so my range was quite wide. Also, Linkedin wasn't really that big when i finished uni, it was in it's infancy so it was more the typcial recruitment sites was looking at. Also, looking at company websites and just emailing them with speculative applications. I didn't really target a specific company as I was just keen to find a way in at any company. I took acomple of small short freelance roles when I could such as editing wedding videos, and games testing (not as fun as it sounds) but it took me 6 months to find my first proper job in the industry. It was VERY low paid, but I needed to get the experience so I took it. As bad as the pay was, it was the best decision I could of  made as it was the start of a career linked by this role. It was a graphics\/motion graphics job designed DVD menu's, which I did for 2 years to build up my portfolio and create a showreel, which I used to get a job at Sky.",
        "ts": "1552385032.003000",
        "username": "Neal Patel (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-03-12\/574063932469_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "So, even though you may have to start as a runner, and at the time the work may seem trivial, it will give you a place to train and get on the equipment using proper shots to work on. It may be low paid, it's a way into the industry and you will have to keep thinking of the bigger picture. The more experience you get, the better you will get and then the money will come.",
        "ts": "1552385212.003100",
        "username": "Neal Patel (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-03-12\/574066380133_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Feel free to ask me questions anytime and if you want to meet one day to ask anything in person, I'm sure we can arrange something.",
        "ts": "1552385271.003200",
        "username": "Neal Patel (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-03-12\/573734116802_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]