[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Charis! So sorry! I'm having a look tonight, forgive me for the delay!",
        "ts": "1583788856.002900",
        "username": "Kat Seale (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-09\/991955295783_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "When is the deadline for the internship position? I have two suggestions for you;\n\n1. I think your first shot and your trapeze shot are your two strongest shots, I hope you don't mind but I also saw your modelling reel and your blue bat is very cute! Might I suggest that for AKA, they love to see people with more than one skill - the nature of small studios means you might need to bounce around onto different jobs from time to time, so being multi-skilled is a big asset. I'd suggest making a reel that includes only your best anim, plus some of the best of your other work too ^^\n2. My second suggestion is about our work together, either now or at a time that works better for you, perhaps once your film is finished? I'd like to propose a few practice animations we can work through together to strengthen up your body mechanics and fundamentals. How does this sound for you? It may sound like a step back to go back to walk cycles and simpler shots, but I've found that every time I've taken a step back to go to the basics again, I've learnt so much more than I could've imagined. Walk cycles are one of my favourite things for this reason - you think you know  how to do them until you're asked to do another one and then you learn so much more than you thought possible!",
        "ts": "1583789631.003000",
        "username": "Kat Seale (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-09\/991976780023_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]