[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi there I thought Ivd write a bit about a typical day for a compositor at a small and mid sized VFX house. \n\n\n\nSmall facility:\n\n\n\nUsually start between 9 and 10. Very often there won't be separate departments for roto, cleanup and matchmove so a lot of these tasks will be done by compositors too. \n\n\n\nJunior artists will do more roto and cleanup but will also get more opportunity to do simple comps (like screen inserts) and even some bigger comps. \n\n\n\n\n\nSenior artists on the other hand will be expected to perform simple tasks much quicker and will also handle trickier shots that come in or even take over a shot a junior has been struggling with. \n\n\n\nUnlike a larger facility senior artists will still be expected to handle some cleanup shots. \n\n\n\nMost work will be 2D and 3D will be limited to simple things (a plane in the sky, background elements etc...) full CG environments, CG creatures or big simulation stuff is unlikely. \n\n\n\nOn TV and advertising shots are bid by the hour, you have to  think on your feet and deliver shots that are ready for final within the time location or discuss with your producer if there is an issue. \n\n\n\nAs well new shots you will be receiving notes on previous shots, maybe creative notes from your supervisor, production or client as well as tech fixes. The time allocation in theory should include this but itvs much harder to bid creative shots! \n\n\n\nYou also need to flag things that will make a shot bigger, harder or more expensive than it is bid. Maybe you were assigned to remove a boom mic from a shot but there is also a reflection of it visible in a car or sunglasses, that is extra work and production may wish to bid this with the client! So you don't just do it unless it's super quick.\n\nTBC",
        "ts": "1567862591.000100",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-07\/754517842726_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Mid sized facility, film:\n\n\n\nThis is like where I am currently working. Shots are bid in days and often involve CG.\n\nSeprate departments (sometimes outsourced) deal with roto matchmove and prep (cleanup). This means that as a junior comp you will be a roto prep artist and doing roto and cleanup exclusively. On the other hand as a Compositor you will receive most roto and cleanup done for you. You will often receive a matchmove camera from 3D as well as geometry for projections. You will still need to do do 2d tracking yourself though and there are often bits of rot klike a hand passing through frame) that are just quicker to do yourself. \n\n Since CG is much slower than comp you will often start several big shots, get them to a point and park them as notes are addressed by 3D.\n\n\n\nJust because shots take several days does not mean you can dick about. You need to present work in progress in Dailies - a screening with the Supervisor, Comp Supe and producer. You will then receive notes and be expected to address them before delivery. There is often a set time for delivery and it is very likely that you will be sending work in progress shots quite often to get feedback on specific things even with unfinished CG or roto (does the director like the timing, animation, do they like the background or the interaction etc...). \n\n\n\nSo the journey to the \"Proposed Final\" is much longer! A proposed final is only actually final if a director signs it off kit is Approved). Shits can get unapproved too as directors change there minds, continuity issues arise (your shot looks great but doesn't match with later shots). Also there are often other people with a say: Exec Producers, Show Runners (on episodic TV these people are above directors as directors are often 1 or 2 episodes only but show runners are for the whole season at least), there also client side VFX supervisors too. \n\nSo there's a lot more back and forth and a lot more people involved in any given shot.\n\n\n\nHope this stuff is useful too you, ask any questions you have!",
        "ts": "1567863551.000200",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-07\/752306890640_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]