[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Venezia, I'm getting ready to graduate from my last year of college. For my first year I did AIM Awards Level 3 Diploma in Games, Animation &amp; VFX Skills and recieved a Merit. This year I've been doing UAL Level 3 Extended Diploma in Creative Media Production and Technology and whilst it's ongoing until the 5th of June I've been predicted a distinction for my FMP (final media project) which will account for the majority of my grade. Having said this, in the college itself I didn't learn anything useful. However, it did bring to light some interesting options regarding career choices. In the beginning of my first year I was doing environmental art in Maya but then found an interest for VFX in UE4 and have been doing it in my spare time ever since. Whilst doing my college work I've been building my skills and a portfolio on my Wordpress website. Regarding the mentoring programme, I've had a lot of conflicting arguments within my family about me going to university or self learning at home and continuing to build on my skills and portfolio and land a job that way. Alternatively, I would study 3D Games Art and Design at Hertfordshire or Escape Studios at Pearson College.",
        "ts": "1585905117.002000",
        "username": "Joupin Ahmed (IntoGames (Mentees))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-03\/1046197125780_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That sounds fantastic, it's especially good to hear that you have been working hard on building up a portfolio. I would love to see it and I'd be more than happy to give you some pointers regarding next steps for it, if you reckon that would be helpful :slightly_smiling_face:\n\nAs for the current dilemma regarding University vs self-learning and job-hunting, are you leaning either way at the minute?",
        "ts": "1585923034.002100",
        "username": "Venezia Georgieva (IntoGames (Mentors))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-03\/1036842663459_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "<https:\/\/joupin265518386.wordpress.com\/2020\/03\/05\/real-time-vfx-projects\/> This is where I hold the portfolio stuff at the moment. I was looking at more towards university, however, due to the current epidemic it's likely that lectures and tutorials won't be going on at the university they would probably be online as well as the facilities that would be available such as a library will be out of use come August\/September when I would be attending. With that being said it looks like the best course of action would be to do a part-time job whilst doing the self-learning but then it comes with further questions such as when will I be ready to start applying for internships\/junior jobs or the fact that some studios may not take interns without a bachelors degree etc.",
        "ts": "1585927726.002200",
        "username": "Joupin Ahmed (IntoGames (Mentees))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-03\/1047252558052_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "Joupin A.",
                "service_url": "http:\/\/joupin265518386.wordpress.com",
                "title": "Real-time VFX projects",
                "title_link": "https:\/\/joupin265518386.wordpress.com\/2020\/03\/05\/real-time-vfx-projects\/",
                "author_name": "joupin42",
                "author_link": "https:\/\/joupin265518386.wordpress.com\/author\/joupin42\/",
                "text": "VFX project compilation 1:\n\n\n\n\n\nVFX meteor prototype revision #1 (WIP):",
                "fallback": "Joupin A. Link: Real-time VFX projects",
                "from_url": "https:\/\/joupin265518386.wordpress.com\/2020\/03\/05\/real-time-vfx-projects\/",
                "service_icon": "https:\/\/s2.wp.com\/i\/webclip.png",
                "id": 1,
                "original_url": "https:\/\/joupin265518386.wordpress.com\/2020\/03\/05\/real-time-vfx-projects\/"
            }
        ],
        "edited": {
            "user": "B6CS60LDU",
            "ts": "1585927728.000000"
        }
    }
]