[
    {
        "type": "message",
        "text": "Thanks Jason for getting back to me – I really appreciate it.                                                                                                                                                                     I am 14 years old and I will be in Year 10 in September 2017.  I enjoy many subjects in school but I have some favourites. For example I find that History, Maths and Economics are my preferred subjects because I enjoy them most and find them interesting.\nIn 5 years from now I see myself studying at University taking degree based in Economics.\nI was thinking of studying Investment Banking but I don’t have a solid idea on exactly what this profession involves. Ideally, I need to seek some advice from you, so that you can give me an overview of different specialties of this degree. This will enable me to make an informed decision on what specialty will suit me best.\nOutside my studies, I like to participate in many different types of sports. For example I enjoy playing Football, Rugby and Basketball. In addition to this I often represent my school and my local club in these sports and it’s something I get a thrill from doing.\nI also enjoy reading Economic Magazine such as ‘The Economist’ because it gives me an insight to what is happening in the Economic world.\nI look forward to hearing from you next!",
        "user": "U61PV8VEW",
        "ts": "1500120437.085251",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "g9b53a60f63a",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/c9b53a60f63aa1a94dac529f533134b4.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0024-72.png",
            "first_name": "Hastings",
            "real_name": "Hastings Allunga",
            "display_name": "hastings",
            "team": "T4UUTPV18",
            "name": "hastings",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "edited": {
            "user": "U61PV8VEW",
            "ts": "1500120591.000000"
        }
    }
]