[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Ahh awesome! Yeah I found the best way to pick up Nuke was to dive in and play around. Finding out what nodes do when you plug them together. \n\nHere’s the link to the podcast: <https:\/\/www.podbean.com\/podcast-detail\/u249z-8de2a\/The-Chernobyl-Podcast>\n\nIt’s more about the film making and storytelling than the VFX but still a good listen!\n\nI’m terms of tips for roto. When I get a roto shot in I sit and watch it over and over again. Taking in all the edges I need to roto. I’ll then go and chat with whoever is going to be picking up the roto to comp the shot to make sure we are on the same page as to what needs doing. \n\nOne of the main tips for roto is having good shape breakdown. By this I mean rather than trying to have 1 roto shape that does an entire edge, break it up into smaller shapes that are easier to follow. You want your shapes to stay consistent through out the movement of the shot. For my roto I tend to focus on one edge at a time. So say I have a shot of a character walking towards camera, I will watch the shot and check what needs to be done. Then I’ll go in and I’ll start on his arm, breaking down the shapes based on the edges I can see. I’ll get that looking nice and not boiling, then move on to the next part, that might be the other arm or a leg or whatever looks easiest. With shots I find that when I first pick them up I get a bit daunted by how much work there is. By doing the easy bits first it gets me in the rhythm of the shot and I may spot details I didn’t spot first time. \n\nDo you have Nuke Noncommercial at home? I can set up a script with an example if you like? \n\nAnother tip is to always use bsplines rather than beziers. For good roto we don’t want to see the edges moving between each frame, this is called boiling. We want the edge to stay consistent and not move around too much. \n\nAnother thing that is useful for roto is using trackers. I will often use a tracker to stabilise my shot. I do this so I can neutralise as much movement as possible and just focus on the edge I am working on. I will then Matchmove the roto I have done back and it will match the shot that is unstabilised. As always if this isn’t making sense I will set up an example script and show you what I mean. \n\nThere are millions of other little tips and tricks but you tend to pick them up with experience. I found the best way to get better at roto is to just do it, by doing more shots you will work out what techniques work and which ones don’t. \n\nWith LinkedIn, yeah sure I guess that would be ok! I don’t post a whole lot on there tho to be honest.",
        "ts": "1570879085.002200",
        "username": "Ben (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-12\/793266558933_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "title": "The Chernobyl Podcast | Free Listening on Podbean App",
                "title_link": "https:\/\/www.podbean.com\/podcast-detail\/u249z-8de2a\/The-Chernobyl-Podcast",
                "text": "The official podcast of the miniseries Chernobyl, from HBO and Sky. Join host Peter Sagal (NPR’s “Wait Wait...Don't Tell Me!”) and series creator, writer and ex",
                "fallback": "The Chernobyl Podcast | Free Listening on Podbean App",
                "image_url": "http:\/\/imglogo.podbean.com\/dir-logo\/581162\/581162_300x300.jpg",
                "from_url": "https:\/\/www.podbean.com\/podcast-detail\/u249z-8de2a\/The-Chernobyl-Podcast",
                "image_width": 250,
                "image_height": 250,
                "image_bytes": 25446,
                "service_icon": "https:\/\/d8g345wuhgd7e.cloudfront.net\/site\/images\/apple-touch-icon-144x144-precomposed.png",
                "service_name": "podbean.com",
                "id": 1,
                "original_url": "https:\/\/www.podbean.com\/podcast-detail\/u249z-8de2a\/The-Chernobyl-Podcast"
            }
        ]
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "And Ofcourse, I’m trying to think how’s best for you to send me stuff. I could set up a Dropbox folder for you to put stuff in? Would that work?",
        "ts": "1570879338.002400",
        "username": "Ben (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-12\/793263992640_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thanks for the link, I'll let you know how I get on with it! Also thanks for the roto tips I'll attempt the same piece of footage again, I'll put them into practise soon and in regards to nuke, I have a the free for a year student however it's been acting up so I'll see if it works if not I think we have that one at uni I'll get back to you about it. In terms of a Dropbox that sounds great, I'd like to get feedback from the work I do in both the current project and any tests\/practise work.",
        "ts": "1570912086.002500",
        "username": "Joshua Carter (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-12\/795299915479_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]