[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Linda, I checked out your stuff and it's awesome! I would put your 3D reel on the home page of your website and label it more clearly if you are looking for texture\/lookdev lighting roles. The vis dev stuff is really great too, but the sections of \"artworks\" and \"projects\" are a little confusing. Maybe you could have a \"reel\" section, an \"animation shorts\" section, and a \"visual development\" section? Your reel was great and has an awesome attention to detail. You also have good color sensibility. I don't think it's necessary to include the node graphs of your shaders, since these aren't super complicated. It's good to have wireframes though. This would help reduce the length, since it's a tad long. Try not to go over 90 seconds in length. I also think the cloth sculpting on the second character with the red hair gets a little lumpy. If you know Marvelous Designer, creating the clothes in that software as a base and then sculpting detail in Zbrush might be helpful. Definitely include the Hornet piece on the next cut of your reel, and include a breakdown of what you did like in your personal pieces. I would also recommend including 1 or 2 photorealistic pieces in your reel. Your style is great, and would be a good fit for studios like Blue Sky, Nathan Love, and Buck. But there are even more studios that lean towards photorealistic work. The style of a project also varies greatly, so it is helpful to include a variety of styles in your reel.",
        "ts": "1583033259.002500",
        "username": "Riley Nelson (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-29\/977743460935_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thanks! Basically I only do texture and shading work in my projects and I'm a beginner to modeling…(like only build simple desk and table level)  I haven't work on my portfolio for a long time lol",
        "ts": "1583033679.002600",
        "username": "Linda (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-29\/975883192912_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]