[
    {
        "client_msg_id": "970a5513-e694-433b-a4a6-26ffeb4cb1d5",
        "type": "message",
        "text": "I went to uni in Bath  (having grown up around london). Was a great decision for me personally. Most people I know that go spend a couple years away really enjoy it. Brilliant memories and l'll lways remember Bath! Also it was nice not living at home for a bit :laughing: \n\nWhy do you think you might regret it? \n\nI guess one of the important things for me was making sure it was a campus uni so you get that community feel\/life (which I think might still be more likely outside of or on the outskirts of London). Also what's fun about places outside of London (or I found anyway) is that you end up venturing out into the surrounding areas too and exploring with your pals. \n\nI gotta admit it was a bit daunting the first week or so there but being away from home kind of forces you into making good new additional friends ",
        "user": "U4VR52RQE",
        "ts": "1540540634.010000",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "d730c1e93535",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-20\/201542361287_d730c1e93535ae06c852_72.png",
            "first_name": "Dexter",
            "real_name": "Dexter",
            "display_name": "dexter-prospela",
            "team": "T4UUTPV18",
            "name": "dexter-prospela",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    },
    {
        "client_msg_id": "96220f37-272b-41c9-9e4a-ddc659c825bf",
        "type": "message",
        "text": "Have you travelled much so far? Or are you planning on doing some? \n\nI took a year out after uni to travel. I think it's one of the most enjoyable development experiences I've ever put myself through. I compare it a little bit to the experience of uni. You're out of your comfort zone all the time and constantly learning about people and cultures and it helped me switch from being a little worried about new things to not being able to live without them!  :blush: :ok_hand: ",
        "user": "U4VR52RQE",
        "ts": "1540540887.014800",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "d730c1e93535",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-20\/201542361287_d730c1e93535ae06c852_72.png",
            "first_name": "Dexter",
            "real_name": "Dexter",
            "display_name": "dexter-prospela",
            "team": "T4UUTPV18",
            "name": "dexter-prospela",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    }
]