[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hello Jane. My turn to apologise.  My pathway was not traditional, but I’m very happy to share.  I didn’t know that the industry I work in now even existed when I was your age and to a certain extent it didn’t.  I did quite well at school and was definitely encouraged into a vocational degree.  I ended up studying Law and managed to get my degree, but found it really tough and couldn’t see myself working in that field.  I looked around to try to see what might be more ‘Lucy’ and landed on a one year MSc in Marketing.  I was really lucky as I’m from Scotland so my University education was free.",
        "ts": "1568984354.000200",
        "username": "Lucy (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-20\/769380056119_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "This is turning into war and peace :slightly_smiling_face:",
        "ts": "1568984362.000300",
        "username": "Lucy (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-20\/767524619952_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Whilst doing my MSc we had a guest lecture from someone from the ITC who look after television advertising in Scotland.  I suddenly had my eyes opened to the opportunities available in the media industry and was somewhat seduced.  I decided to do my thesis \/ project on TV sponsorship which was new back then - coronation street sponsored by Cadbury etc. and as part of this had to seek information and feedback from commercial TV providers (ITV, Channel 4, STV etc.).  I got to meet the Commercial Head of STV as part of this who offered me my first job.  It was not what I wanted (selling TV sponsorship and advertising air time), but it was at Scottish Television surrounded by TV programs being made etc. so I jumped at it.",
        "ts": "1568984584.000400",
        "username": "Lucy (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-20\/756056410675_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "After about a year they asked me if I would move down to their London office.  I was 22 and thought ‘why not?’ so off I went.",
        "ts": "1568984619.000500",
        "username": "Lucy (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-20\/767531265920_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "The STV office in London was really small and just commercial. I was working with 3 very lovely ladies who were about the age I am now (44) which was not really the same exciting, creative  environment that I’d been feeding off in Glasgow.  I wanted to do a marketing role and be in a more creative environment and meet friends my age to help me settle into London, so I quickly decided that I needed to move on.",
        "ts": "1568984715.000600",
        "username": "Lucy (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-20\/761114574529_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I applied for and got a job in Marketing for a post production company which I loved.  I was in amongst it again and also using my qualification.  I had 2 happy years there and did lots of fun things.  I also met some amazing people who are still my friends nearly 23 years later.",
        "ts": "1568984906.000700",
        "username": "Lucy (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-20\/767538797605_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "My company was taken over by a US company, so I decided to look for a new job and applied for a marketing position at the BBC which I got.  Another amazing place to work.  Television Centre was a magical place to be and you could nip into the studio galleries and see what was going on.  There was also a good chance of standing behind someone amazing in the canteen queue!",
        "ts": "1568985034.000800",
        "username": "Lucy (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-20\/767074432276_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "In 2001 I quit this amazing job to go traveling with a good friend. We’d been planning it for years and it was ‘now or never’.  We had an amazing time and I have no regrets at all.",
        "ts": "1568985079.000900",
        "username": "Lucy (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-20\/767075372244_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Returning in 2002, I had no job and no money, so returned home to my mum and dad who thankfully were happy to put me up until I got back on my feet. I temped in all manner of random jobs including a young offenders institution, a wine depot, a floatarium and a hospital.  It was a good experience.",
        "ts": "1568985145.001000",
        "username": "Lucy (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-20\/767542919968_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I returned to London after securing a job at a physical special effects company <http:\/\/www.artem.com|www.artem.com> who do prosthetics, pyrotechnics, models, rain, snow etc.  It was a very creative place to work and I stayed there for 5 years when I felt like I’d outgrown it and wanted to progress my career.  I applied for a Marketing Manager job at a tech start up called The Foundry <http:\/\/www.foundry.com|www.foundry.com> and got it.  They make software for the visual effects, game and animation market and at the time there were 25 people there.  Today there are more than 350.  I had a lot of adventures there and grew with the company managing an international team of 16 before I left.  I got to know lots and lots of visual effects companies including Union where I work today, who I first met in 2009.",
        "ts": "1568985312.001100",
        "username": "Lucy (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-20\/756072453475_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "After 8 years and a crazy time, I moved to Union where I am now Managing Director.  I utilise everything I’ve learned from my law degree (ironically) through to all of the contacts I’ve amassed over my entire career on an almost daily basis.",
        "ts": "1568985387.001200",
        "username": "Lucy (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-20\/769753560870_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Sorry this is such a long message.  I’m old! It’s a longish story.  Hopefully it’s helpful to show you we don’t always need to know the destination at the beginning and that you learn a lot even from jobs that you might not feel are exactly what you want to do.",
        "ts": "1568985441.001300",
        "username": "Lucy (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-20\/767550450661_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "It's totally fine if the message was long, I found it really interesting to see how you got your job today :blush: (I'd much rather an in depth answer in comparison to one lacking information, but that's just my opinion) \n\nMany of the things you mentioned about doing different jobs and transitioning from one job to another sounds daunting to me currently since I'm under a bit of pressure to choose wisely and not spend time on something that could potentially be \"the wrong subject\" (though I know that the experience gained would result in it not being a waste entirely, even if the subject isn't for me in the end) \n\nWere there any times where you felt worried about this issue, and how did you overcome it?",
        "ts": "1568996425.001400",
        "username": "Jane Lee (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-20\/761404554017_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Also, what's it like to work in union\/VFX and other different visual effects companies &amp; would the experience be ideal for a person that is primarily interested in 2d animation?\n\nSorry if this question is less specific, I don't have much knowledge in this area and what the industry is like as a whole so I want to have a better understanding of it first before I see if it's something I'm interested in and want to work towards in the near future. (Since even though I'm most interested in 2d animation, I'm open to branching out and learning more about visual effects and game design too)",
        "ts": "1568997453.001500",
        "username": "Jane Lee (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-20\/769703017639_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]