[
    {
        "type": "message",
        "text": "",
        "files": [
            {
                "id": "FV13EJ468",
                "created": 1583624492,
                "timestamp": 1583624492,
                "name": "Jane_portfolio.pdf",
                "title": "Jane portfolio",
                "mimetype": "application\/pdf",
                "filetype": "pdf",
                "pretty_type": "PDF",
                "user": "U6D2VCN07",
                "editable": false,
                "size": 4851573,
                "mode": "hosted",
                "is_external": false,
                "external_type": "",
                "is_public": true,
                "public_url_shared": false,
                "display_as_bot": false,
                "username": "",
                "url_private": "https:\/\/files.slack.com\/files-pri\/T4UUTPV18-FV13EJ468\/jane_portfolio.pdf?t=xoxe-164979811042-1081742544354-1080362743317-fee6284c0ee20406565ca4cadf37d845",
                "url_private_download": "https:\/\/files.slack.com\/files-pri\/T4UUTPV18-FV13EJ468\/download\/jane_portfolio.pdf?t=xoxe-164979811042-1081742544354-1080362743317-fee6284c0ee20406565ca4cadf37d845",
                "thumb_pdf": "https:\/\/files.slack.com\/files-tmb\/T4UUTPV18-FV13EJ468-c3f28a9725\/jane_portfolio_thumb_pdf.png?t=xoxe-164979811042-1081742544354-1080362743317-fee6284c0ee20406565ca4cadf37d845",
                "thumb_pdf_w": 2994,
                "thumb_pdf_h": 3896,
                "permalink": "https:\/\/prospela.slack.com\/files\/U6D2VCN07\/FV13EJ468\/jane_portfolio.pdf",
                "permalink_public": "https:\/\/slack-files.com\/T4UUTPV18-FV13EJ468-94088410c2",
                "is_starred": false,
                "has_rich_preview": false
            }
        ],
        "upload": true,
        "user": "U6D2VCN07",
        "display_as_bot": false,
        "ts": "1583624495.007400"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Sweet\n• Regarding the sweet at the end I think she should keep it.\n• I understand the hesitation as it comes a bit out of nowhere, but we get a nice sense of the material. It shows an additional skill and somehow when I see it I can also imagine a story behind it. I like the presence of the rip, that leaves quite a bit of interrogation and leaves us wondering what happened to that candy ? \nGeneral feedback:\n\n• I think we should see a bit more the development of her artwork and she should not hesitate to take more creative risks. \n• If we take the sweet as an example this is something that is normally very saturated, but when you represent it in black and white with the ripped wrapping, it is suddenly really interesting. \n• If she took it further, if we imagine a hint of pink\/saturated water colour fading or a drop of colour, flowing out of the rip then it doesn’t become only a candy but more of a symbol. She could display this with some photos of sweets, or some variations of the sweet study.  Maybe a collage of wrappers glued together, elements showing the artistic inspirations\n• Whatever feels natural for Jane.\n• Technically a few things are a little off like the perspective in some instances.  These things are really hard to get right and it is fine to present this in the application, but it’s just good to be aware as she can talk about wanting to improve on this during the course.  There is lots of learning to do or there would be no point studying :) \nComic:\n\n• The comic shows you are a storyteller and that is a reel plus as an artist. \n• The notes on page 6 (close-up of page 2) and anything else that shows her process and inspiration should definitely stay in.\n• They show us that she puts focus on the layout, the color palette, etc. \n• I’d suggest showing less pages of the comic in the portfolio (just the ones she is most proud of) and more development. \n• It would be really nice to see development of the characters.  Why\/how she ended up drawing her like that. What was the original idea? \n• This will show you’re not afraid to experiment as it is how you evolve the most as an artist. \n• We can definitely see personality which is great.\n• I really like the carnivorous plants. \n• There is a good expression work between the black and white background, the shapes that are there and the foreground coloured plants. The same style is used in the painting of the red flower. \n• It is difficult for me to judge the teapot and the flowery plate but seeing the work in progress is really interesting and shows the passion behind the process. \n• Seeing the artwork of the red plant and how it evolved into the following piece is also really nice.\n• The life drawings are good to see as she approached it with two different styles. \n• If I was interviewing I would love to see more styles and techniques if she has them. \n• There is also a good progress between the first and second drawing. The second one shows her playing with the volumes and the lights.\n• If she has a sketchbook, I’d recommend she shows that too.\n• Being able to talk through research and development shows commitment to projects and a bit more about who the artist is and what\/who influences them.\n• The portfolio and any additional sketch books etc. should show that while doing the work she grew as an artist showing potential to grow even more.\nWe see definitely that she is a passionate artist and loves what she is doing, whatever she ends up doing, it will help her progress a lot and I hope it leads her to achieve what she wants.\n\nI wish her all the best.\nJonathan.",
        "ts": "1583624508.007700",
        "username": "Lucy (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-07\/974784206930_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]