[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hello Jane.  Hope you had a good holiday.  I think a foundation course at college is a great idea.  You never know how you might feel after it.  It’s really good to get exposure to a variety of skills.  I had a look at your personal statement and it is very animation focussed.  Perhaps you could have a think about why you are applying for a foundation year.  You can say things like you’ve been talking to industry professionals (me) and started to think that a foundation is a good idea.  Talk about the different elements that interest you from the course.  I’m happy to help you edit it down if you have a go at refocusing it to be a bit more generic.  It’s much easier to edit from too many words than to add more :slightly_smiling_face:",
        "ts": "1578069629.000300",
        "username": "Lucy (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-03\/892647634320_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Another good way to approach it is to look at the course website and tailor your statement to it.  i.e. here <https:\/\/comparethecourse.com\/landing\/london\/foundation-of-art-and-design>  They are saying: The Foundation diploma level 3\/4 in Art and Design provides an essential introduction to the creative arts by inviting your to explore and experiment with a wide range of media. It is designed to maximise creative exploration through an art and design-based programme, which provides students with the opportunity to develop creative expression by learning an applied range of complementary art and design skills and processes. So… you can say that you are looking to gain a solid foundation across the arts and gaining exposure to lots of different techniques before deciding where to specialise.  Currently you think your passion lies with animation, but it’s a very broad topic and learning different styles, techniques and their origins will allow you to broaden your approach.  Does this make sense?",
        "ts": "1578069889.000400",
        "username": "Lucy (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-03\/879869790322_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "title": "Foundation Diploma in Art and Design in London - Compare the Course",
                "title_link": "https:\/\/comparethecourse.com\/landing\/london\/foundation-of-art-and-design",
                "text": "The Foundation in Art and Design provides an essential introduction to the creative arts by introducing your explore and experiment with a wide range of medias. It is designed to maximise creative...",
                "fallback": "Foundation Diploma in Art and Design in London - Compare the Course",
                "image_url": "https:\/\/comparethecourse.com\/img\/foundation-art-design\/head-bg.jpg",
                "from_url": "https:\/\/comparethecourse.com\/landing\/london\/foundation-of-art-and-design",
                "image_width": 640,
                "image_height": 250,
                "image_bytes": 78747,
                "service_icon": "https:\/\/comparethecourse.com\/favicon.ico",
                "service_name": "comparethecourse.com",
                "id": 1,
                "original_url": "https:\/\/comparethecourse.com\/landing\/london\/foundation-of-art-and-design"
            }
        ]
    }
]