[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Kat! I'm super happy to do this so don't think twice about it. I've never mentored someone in a digital setting so this is a learning experience for me as well.\n\nFirst off, congratulations on your graduation! That is no small accomplishment, and SCAD can be a tough program. Now your real work begins haha.  I think it is very important to note that education never stops, I still learn new things or find new challenges almost every single day.  I hope I can help inspire you to keep working to improve your skills and knowledge, keep striving to be the best you can be.\n\nI can definitely help you be a better compositor, and I'm open to discussing the future. The fact that you have a plan and definitive goals is awesome. Let's concentrate on the small stuff first.\n\nAs far as my story goes it is pretty simple.  Although I will occasionally admit to being smart, my arc from newbie to where I am now is purely hard work and echaustive study.  As you go you will find many artists you work with are satisfied. Don't be. Always push yourself.  There is always something else to learn.\n\nCan you speak to your compositing education?  What was that like for you? What do you feel like you are missing?  If you have any work you'd like to share I'd love to see it!\n\nWe'll talk about the commercials thing later lol\n\nLastly please don't get discouraged if it takes me a while to respond. My schedule can be crazy but I am here, and I am here to help!",
        "ts": "1566924984.001700",
        "username": "Erin Nash (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-27\/739908163253_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Awesome! That's so kind of you, I really appreciate you being willing to give me a little of your time. :relaxed:\nThank you! It wasn't always easy, but I think I got out of SCAD what I needed! If you don't mind me being fully candid, my sophomore year I suffered from a major depressive episode, so recovering from that and continuing to learn despite it was a big challenge for me.\nNow that my life is considerably more stable (minus a job), I'm trying to fill in some of the gaps I missed and revisit some of the foundational parts of compositing. I always end up getting way too ahead of myself, haha! I learned all about photogrammetry, working in VR, implementing AOVs and render passes, and deep compositing, but I sometimes forget the value of a really solid roto. Part of that is definitely me, but part of it too I think was my school's 3d-focused vfx program. I essentially was given one basic nuke class, then set free to work on films in advanced comp. I took a 3D integration class as well, but I feel like not much junior work here utilizes those skills. The rest of my classes were in maya and houdini.\nSo, really, a lot of my compositing ended up being self-taught. I worked on as many films as I could get on (within reason) to get some cleanup experience, but I did miss some of that classroom feedback.",
        "ts": "1566946116.001800",
        "username": "Kat (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-27\/740342580997_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "And oh ym gosh, I totally forgot I don't have my last name on here so you couldn't have found my work! My website is simple, <http:\/\/katmolk.com|katmolk.com>.",
        "ts": "1566946146.001900",
        "username": "Kat (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-27\/728892712611_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "And no worries at all, I know you've gotta be busy! I'm just happy to bend your ear every now and again.",
        "ts": "1566946208.002000",
        "username": "Kat (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-27\/728893546963_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Also, my reel does need a big overhaul and will be getting it soon- I'll be cutting the first integration piece since it's not that strong anyways, and my unfinished 360 film that shouldn't really be in there anyways. I also need to go back and touch up some of my greenscreen edges based on some feedback I got.",
        "ts": "1566946319.002100",
        "username": "Kat (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-27\/739873684788_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]