[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hahaha it is mate :P my first 2 weeks in a row off since I left college after getting my BTEC... \n\nYeah I totally get what you mean with weathering a scene and trying to tell a story with the frame, that’s exactly what I really enjoy about vfx. All the little details we add that no one will probably ever notice :wink:. \n\nAt DNEG, DMP (or Digital Matte Painting) is it’s own department. They use photoshop to paint up scenes. Then use Nuke to project them out into 3D space. As far as I’m aware, at other studios, including smaller ones, comp artists will do their own DMPs. \n\nThese then get picked up by comp and placed in the shot using roto and other comp techniques to make it look real. \n\nSometimes in DMP they get to do really exciting full landscapes and other times they just have to paint up a pretty sky that’s going to be really blurry in the back of a blue screen shot. I’ll see if I can find a shot from DNEGTVs showreel and show you which bits are scan. which are DMP, and which are comp.\n\nHappy days with the deadline. you’ve got a fair bit of time to get something looking really nice.\n\nI was in Budapest for a few days and then off too Scotland to see my Dad next week!",
        "ts": "1570879740.001300",
        "username": "Ben (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-12\/793270086389_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Haha wow. That sucks, but also says that you must enjoy your job!\n\nHaha it seems almost frustrating that you do all these bits that no-one will notice but if they weren't there, people definitely would notice :laughing:\n\nAre most dmps digitally hand painted or can you use images and mask around them to create something new? \n\nOkay I'd appreciate that :+1: \n\nYeah gives me no excuses :laughing: just gotta start it now.. \n\nOh real nice! :ok_hand::skin-tone-3: Be nice that, love Scotland got family up near Aberdeen, still don't understand them though :joy:",
        "ts": "1570893950.001400",
        "username": "Matt Coleman (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-12\/786913731825_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hahaha defo :P\n\nAnd it varies from what I have seen. The majority are images masked with a bit of additional painting. There also may be some 3D modelling involved to model the geometry to project on but it all depends on what’s needed for the shot really. ",
        "ts": "1570914863.001500",
        "username": "Ben (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-12\/795663997254_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Crackin' I only ask because I wouldn't even know where to start like on something like a traditional matte painting. Some of those are ridiculously good &amp; detailed paintings :see_no_evil:",
        "ts": "1570918510.001600",
        "username": "Matt Coleman (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-12\/787038155633_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]