[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yeah the planar tracker is really good at doing big, flat surfaces. We have a price of software at work called Mocha which is one of the best I have ever used. It is able to track texture really well so makes it a god send for roto work.\n\nAnd yeah sometimes tracks work pretty well without the data but it’s a good habit to get into. \n\nAhh that’s annoying that they haven’t got a decent camera tracking software. Matchmove is the entry level job for 3D artists most of the time. The Nuke one does the job but for more complex shots it’s a bit lacking.\n\nSo the show I was onset for has a lot of leg removal shots. The actor has a prosthetic leg on over his really leg then a green sock below that. We are gonna use the reference pic to rebuild in Nuke the bits of his real leg that are covered by the green one. We also will have to do some set rebuild too when his green leg covered it so there were some of them too.",
        "ts": "1573806782.000400",
        "username": "Ben (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-15\/837727002583_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yeah I've used Mocha before, that's the good thing about After Effects it comes with a free version of Mocha - Borris fx.\n\nYeah I'll definitely redo the track today, using camera info and try to remember that each time I come to do it.\n\nWhat software for 3D tracking would you recommend? Just so I can try to ask, see if we can get a license. But I know they ain't cheap :laughing:. \n\nReason we don't have a license though I think is because the course is mainly focused on 3D modelling, animation, texture, and not really VFX main thing we've done in VFX is make a crappy destruction of a scene in 3D Max Using MassFX.\n\nOh nice, that's interesting to know so when your replacing something in the scene your using the reference images to go over the replacement area and then blending it in so it's the same lighting, depth, blurred etc..",
        "ts": "1573811017.000500",
        "username": "Matt Coleman (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-15\/835951890816_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yeah Mocha is ace, it’s a really good trick to have up your sleeve to be able to get good tracks on stuff. \n\nAt work the matchmove guys use 3DEqualizer but I have got some good mileage out of PFTrack and Boujou. \n\nAhh that’s fair enough, I think autodesk do a matchmove software that might come bundled with autodesk student so that’s another option too. \n\nYeah when doing that kind of heavy prep work it’s good to have reference photography although most things you will be able to grab stuff from the scan to build up your patches. A lot of the work we did on Dark Crystal we had reference images so could use them to help",
        "ts": "1573842227.000600",
        "username": "Ben (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-15\/823875081346_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]