[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Dude! Worst mentor ever! I’ll take a look at these at lunch and let you know what I think! Sorry it’s taken so long! Been hellishly busy here atm :\/",
        "ts": "1575368322.001500",
        "username": "Ben (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-03\/857515620560_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hahaha don't worry mate, I get your busy on live projects, which you don't need to apologize for!\nHope it calms down for ya!",
        "ts": "1575378401.001600",
        "username": "Matt Coleman (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-03\/859911259910_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey dude!\n\nThis cult room is looking really nice! The track is looking solid and everything seems to stick. One thing that might be cool if maybe to put a torch in the background? You could then use that to try doing some interactive lighting on the hanging box aswell as the surrounding scan. That might help sit it in the scene a bit better.\n\nAnother thing is, if you can officers, might be trying a bit of a bigger camera movement. One thing they always told me that employers want to see is shots that look like they are a ‘real’ vfx shot. That might be with a bigger camera move or a complicated set up. That could also give you the opportunity to show off some more skills too. \n\nOverall it’s looking really nice!",
        "ts": "1575380918.001700",
        "username": "Ben (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-03\/859965092902_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yeah can definitely do that with the torch, that's a really good idea think I've not long modelled and unwrapped a wall torch too, perfect. Ha\n\nI totally get what you mean with a bigger camera movement, the only reason I've kept it with just a small pan up to the air is because I need to redo the composite in After Effects to compare the two different software, so was trying to keep it nice and short. \n\nBy a more complicated setup, do you mean add more assets or different location for filming or something different that I have misunderstood? \n\nThanks for the feedback! Appreciate you taking the time!",
        "ts": "1575397448.001800",
        "username": "Matt Coleman (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-03\/860462067318_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]