[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I would say that’s more my observation really. With Nuke being  the comp tool the majority of the industry is using and Houdini becoming more powerful with every update. \n\nGood shout with using the research module to get a bit of experience with Nuke. \n\nThat professional practice module sounds like a really good module. Working for a big company you get a certain amount of creative control but at the end of the day it has to be approved by the 2D supe, VFX supe and then the client so it can’t be too far from the brief :P\n\nHave you got any ideas for your final project yet? Do you know what direction you would like to go yet? 2D or 3D? It’s totally fine if not! Loads of people move around once they get into the industry ",
        "ts": "1570173659.006600",
        "username": "Ben (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-04\/770841957842_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Okay thanks for that then :+1:\n\nHaha, cheers! Thought that's probably the best way to use my time with research.\n\nYeah that's what I mean, because more often than not at the moment I get side tracked by something I find that looks cool, but ain't the same as my brief, so will be good to get a bit of discipline in the regards ha.\n\nAs it stands for the final project, no solid ideas yet but I think I'm more leaning to 3D at the moment, but like you say, that could change especially depending on my ideas at the time! :laughing:",
        "ts": "1570180848.006700",
        "username": "Matt Coleman (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-04\/783748382197_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]