[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "For the sky I would probably just soft roto some of the clouds off the image then put them on separate cards that are offset from your original one. This will give them a light sense of parallax too which will be nice. You could also try a ‘displace 3D’ nose to try and deform the cards a bit based on noise to give them some natural depth. \n\nFor getting rid of the lamp post you’ve sort of got the right idea. \nFirst I would use your camera track to place cards at the depth of where the buildings behind the lamp post is. You can then use that as projection geometry with the project3D node which will then give you a patch to put over the lamp post. If that makes sense?\n\nThat’s weird with your tracker camera, it could be something in how your writing your camera out of Max. Try using an .fbx or .obj file and make sure your exporting the entire sequence rather than just a frame? I’ve not used max for years so I can’t fully remember how it all works. ",
        "ts": "1579076070.001000",
        "username": "Ben (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-15\/906584309172_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I'll try that with the sky tomorrow cheers! \n\nYeah I think that makes sense. I'll try it out and see what I can get then if there's something I'm really not getting I'll give you a shout again haha. \n\nYeah I must have done something wrong with the camera animation export. I'll figure that out now I've got a free week from uni so that's not an issue in the future haha.",
        "ts": "1579130231.001100",
        "username": "Matt Coleman (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-15\/896940903907_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]