[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Wow dude I’m really bad at this :P once again sorry for the slow response. We delivered that big show (finally:tada:) and I’ve handed in my notice at Dneg. I’m gonna be starting at a place called Automatik in a few weeks time! \n\nAs for the roto, I tend to use Bsplines rather than beziers for most things. It makes it a lot easier for you to follow the edges and where your points are because there are less controls to keep track of. If you think about it, if you use beziers then you have to try and get the little angle handle thing to match perfectly which is an extra 2 control points per point. Once that gets multiplied over and entire shape and over an entire shot, it’s a lot more information for you to try and follow. Let me know if that makes sense!\n\nAnd let me know if there is any stuff to see! Don’t worry about the Jonas Brothers :P I’m not hear you judge, everyone loves some cheesy pop :wink:",
        "ts": "1582187389.000100",
        "username": "Ben (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-20\/949306189379_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Don't worry dude, it's fine :grin:\n\nWahoo! When's that coming out? Was it really that bad? :joy: But congrats man! \n\nYeah, that makes total sense, cheers. I got that roto book you was on about a while back, that's really useful!\n\nYeah as soon as I got my footage I'll start working on it, just storm Dennis is causing havoc so making it difficult to film where I want to be at :joy: Sunday looks like a good day hopefully though!\n\nHaha yeah your right.. there newest album is so good though :joy:",
        "ts": "1582191239.000200",
        "username": "Matt Coleman (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-20\/950736755729_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]