[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Ahh yeah interactive water can be fun… One thing to keep in mind, how big its gonna be on screen in the final shot. It might be better to try and use some 2D elements and see if you can get away with it in 2D before going down a full 3D route as that could take ages.\n\nAlso Animated Women UK have put together some help for students during this time which I thought might be useful for you! <https:\/\/www.animatedwomenuk.com\/support-for-students-during-covid-19\/>",
        "ts": "1586367103.000600",
        "username": "Ben (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-08\/1048450638450_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "Animated Women UK",
                "title": "Support for Students during COVID-19 - Animated Women UK",
                "title_link": "https:\/\/www.animatedwomenuk.com\/support-for-students-during-covid-19\/",
                "text": "As a result of COVID-19 many students, who were looking forward to finishing their studies and celebrating graduation this year, are now faced with an uncertain future resulting from university closures. Although academic institutions are now adapting to support their students through distance learning and online feedback, the reality is many individuals have lost access…",
                "fallback": "Animated Women UK: Support for Students during COVID-19 - Animated Women UK",
                "thumb_url": "https:\/\/www.animatedwomenuk.com\/wp-content\/uploads\/2020\/04\/Covid-19.jpg",
                "ts": 1585856860,
                "from_url": "https:\/\/www.animatedwomenuk.com\/support-for-students-during-covid-19\/",
                "thumb_width": 1000,
                "thumb_height": 577,
                "id": 1,
                "original_url": "https:\/\/www.animatedwomenuk.com\/support-for-students-during-covid-19\/"
            }
        ],
        "edited": {
            "user": "B6CS60LDU",
            "ts": "1586367103.000000"
        }
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yeah I was gonna do that, but I couldn't really find any 2D elements that worked, so I just spent the whole day yesterday learning how to create oceans just so I know how to work it and then small scale water effects then I can just render them in 2D elements and use the magic of copy and paste :grin:. \nBut like you said, time is an issue but I've managed to speed up the sim time today which some progress there. \n\nCheers for that, I'll take a look :+1::skin-tone-3:\n\nHow's everything for you going? You gotten a bit more use to working at home?",
        "ts": "1586367728.000800",
        "username": "Matt Coleman (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-08\/1045997974135_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]