[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Oh..it’s so sad to hear the feature never saw the light of day! I still couldn’t see your link for some reasons:joy:..it shows” We couldn’t find the page”. I was wondering how your animation mentoring worked? :grinning: ",
        "ts": "1582738774.002700",
        "username": "Flora Tsai (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-26\/972345914215_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I would like to know more about Framestore-!",
        "ts": "1582738831.002800",
        "username": "Flora Tsai (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-26\/970032323588_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Here is my thesis film- <https:\/\/vimeo.com\/345157456|https:\/\/vimeo.com\/345157456>\nThe password is “sigri”\nI animated all characters except rabbit:joy:",
        "ts": "1582739198.002900",
        "username": "Flora Tsai (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-26\/960387777521_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "ah apparently my vimeo account got flagged as a bit dodgy... getting it sorted out now..",
        "ts": "1582767795.003000",
        "username": "Toby Winder (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-26\/973104834375_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "hey the short was really fun, great job!",
        "ts": "1582768002.003100",
        "username": "Toby Winder (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-26\/971265182373_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "yeaaah the feature i worked on was going to be terrible so its not that bad a thing :stuck_out_tongue: I think i have an old video from it soemwhere - when my vimeo account is back I wil lsee if i can find it. It was a take on romeo and juliet using knives and forks in a kitchen :confused:",
        "ts": "1582768088.003200",
        "username": "Toby Winder (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-26\/970794143044_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "when you ask about my mentoring, you mean how my experience of animation mentor (the school) was? or whats my process for the prospela mentorship thing ?\nGoing to assume you mean the second. Well its really up to you! Right now I have 3 mentees, bit they are all at quite different stages. One is trying to choose a university in the UK, sooo shes very much just looking for general advice and she isnt very active with me. The other is just finishing an animation degree and I'm giving her some feedback on her work and im going to try and organise a few little demos for her if I can figure out a good way to share my screen with her. The other is you! so its heavily to do with what you are looking for. If you want general advice I can really do that, if you want help specifically improving with animation I can help you with that too!\nTo be totally transparent, im using this opportunity to work on my skills at explaining things and giving feedback as I would like to start a small side business giving feedback on shots\/reels. I have done some recorded lecturers already over on <http:\/\/fxphd.com|fxphd.com>. It will also be good practice for my position as lead at work too.\n\nBased on what I see in your short, it looks like you have a very good grasp already, and you clearly are ok with the technical side of 3d. which can only help you. I would encourage you to first of all spend some time with the REALLY basic exercises to clarify some things e\/g timing, spacing, arcs and weight etc\nSo I would look at doing some bouncing balls and pendulum exercises and probably some walk\/run cycles.\nImo the trick to really improving on these things is to do them, get feedback then go back and try to improve them based on the feedback. Actually implementing changes and seeing the improvement will help you apply it to future things.\n\nThe next stage would be to take those base exercises skills and apply them to more complicated actions like you are doing in your short. And learn the process of really fleshing out a shot, Going from key poses to really creating some complex and appealing animation.\n\nAs I mentioned Im looking to do a little demo, of how I go about animating an action for one of my other mentees, if i can find a way to invite more than one person to it I could invite you too. or do it a second time",
        "ts": "1582768715.003300",
        "username": "Toby Winder (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-26\/959790098691_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Framestore was pretty cool. To be honest with you, in my experience all vfx companies are quite similar. They have their little differences but the general experience is pretty similar.Also the nature of them is that it can feel quite different project ot project and from year to year, as artists move around a lot. So you could work there on one project and feel like you work with your best friends and then they can all move on to other studios for another project and you have a completely different team to work with, that has a totally different vibe.",
        "ts": "1582768960.003400",
        "username": "Toby Winder (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-26\/958474796162_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "but Framestore in general work on really nice projects, and is a pretty cool place to work!",
        "ts": "1582768978.003500",
        "username": "Toby Winder (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-26\/971281702213_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "very talented team and very proffesional!",
        "ts": "1582768984.003600",
        "username": "Toby Winder (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-26\/970809475428_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]