[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "No problem Cas. Nice to connect with you. Hope I can help! :)\n\nWhy don’t you tell me a little about what you’re hoping to get from having a mentor?\n\nAnd throw out any questions you have about me or, well, anything at all that you want to ask about at this stage.\n\nLooking forward to working with you.",
        "ts": "1583395921.001900",
        "username": "Josh O'Brien (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-05\/983162169109_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey! I got into the digital world around 5 years ago using maya mainly, I recently graduated at London South Bank University and did an Internship at NextGen(programme in partner ship with several studios) I worked at MPC as Runner\/Junior Generalist and I am currently working as Render Wrangler in Framestore London, so still part of the industry but being able to work on my portfolio inside a company! Which is a nice bonus haha!(: \n\nI mainly want to get into Environment Art, just always had a thing for it, I am experienced with 3D Environments but lack a lot of 2D skills, mainly Matte Painting and photoshop knowledge, so I’m currently trying to improve that by painting over CG renders. \n\nMy work I have on my website is quite outdated but I’m gonna upload some more recent stuff on it when it is finished:\n\n<https:\/\/casvdbergh.weebly.com|https:\/\/casvdbergh.weebly.com>\n\nThank you, looking forward to working with you too! I went on LinkedIn and saw you did a lot of concept art! Which is just amazing as I don’t  see a lot of people doing that in this industry! ",
        "ts": "1583397853.002000",
        "username": "Cas Van Den Bergh (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-05\/985046172887_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "title": "MY SITE",
                "title_link": "https:\/\/casvdbergh.weebly.com\/",
                "text": "My name is Cas van den Bergh and I was born and raised in The Netherlands, and I am currently living in London.   I have created this portfolio to display my work for Visual Effects and...",
                "fallback": "MY SITE",
                "image_url": "https:\/\/casvdbergh.weebly.com\/uploads\/2\/2\/7\/5\/22758420\/whatsapp-image-2020-01-08-at-14-53-19_orig.jpeg",
                "from_url": "https:\/\/casvdbergh.weebly.com\/",
                "image_width": 167,
                "image_height": 250,
                "image_bytes": 143211,
                "service_icon": "https:\/\/casvdbergh.weebly.com\/favicon.ico",
                "service_name": "casvdbergh.weebly.com",
                "id": 1,
                "original_url": "https:\/\/casvdbergh.weebly.com"
            }
        ],
        "edited": {
            "user": "B6CS60LDU",
            "ts": "1583397855.000000"
        }
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I didn’t read the question correctly haha sorry! What I’m hoping is to get feedback on the work I’m doing and to see if you can keep me to finish work on a schedule haha! As sometimes I get busy sometimes and leave my portfolio and not work on it for few days! And ofc feedback is the best thing ever in this industry! ",
        "ts": "1583430573.002200",
        "username": "Cas Van Den Bergh (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-05\/983659473108_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]