[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I'm doing good thanks! That's great you do 2D animation, I find that once you jump over the technical hurdle that comes along with learning 3D software that you'll benefit from having those animation fundamentals beforehand. What are the biggest challenges you're having with 3D at the moment? And more importantly, are you enjoying it? :slightly_smiling_face:",
        "ts": "1541761251.001900",
        "username": "Emma Porter (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-09\/475150293377_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Currently I'm a 3D animator. I'm working in a much smaller studio at the moment so I'm dipping my toes into different areas such as modelling and rigging - but definitely an animator at heart! I have a traditional background and was going to start training in 2D animation but bypassed that and got into 3D for the same reason that it seemed like companies were moving to it",
        "ts": "1541761402.002000",
        "username": "Emma Porter (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-09\/475019399616_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "What type of animation do you like to make\/watch?",
        "ts": "1541761501.002100",
        "username": "Emma Porter (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-09\/477157731254_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Well at the moment I don’t think I’m very good at making the animation look smooth and realistic, I’ve tried modelling and rigging in my first year of uni but it was gone over pretty quickly so I didn’t really understand that very well and I don’t know if being able to do will give me more of an appeal to employers? \nI love doing 2D traditional but it takes up a lot of time so I moved on to 2D digital, I love painting and drawing and am a bit of a perfectionist when it comes to it which is a blessing and a curse. I really love the old 2D traditional Disney animations like 101 Dalmatians and the aristocrats. I love the line work and just think they look beautiful.",
        "ts": "1541779654.002200",
        "username": "Katie (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-09\/476206899349_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]