[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Katie, very sorry for the delayed response - we've had a very busy time at work! I've had a look at your animation and it's looking good! What software are you using for it? You mentioned a few messages ago that you have difficulty making your animation appear smooth and realistic; there are a couple of resources I've been looking at recently to try to improve my own animation and flow of action. First of all, Aaron Blaise's Youtube channel (<https:\/\/www.youtube.com\/user\/AaronBlaiseArt\/videos>), he's an ex-Disney animator and has great, practical advice on applying the principles of animation to anything that you're doing.",
        "ts": "1543787439.000100",
        "username": "Emma Porter (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-02\/494829994118_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "YouTube",
                "title": "The Art of Aaron Blaise",
                "title_link": "https:\/\/www.youtube.com\/user\/AaronBlaiseArt\/videos",
                "text": "Welcome to The Art of Aaron Blaise. I've been an artist all of my life and it's here that I'd like to share with all of you some of my techniques of painting...",
                "fallback": "YouTube: The Art of Aaron Blaise",
                "thumb_url": "https:\/\/yt3.ggpht.com\/a-\/AN66SAwbbfypHRL_KwXJQZ5Wz_OBAkFsD3_7He77ig=s900-mo-c-c0xffffffff-rj-k-no",
                "from_url": "https:\/\/www.youtube.com\/user\/AaronBlaiseArt\/videos",
                "thumb_width": 900,
                "thumb_height": 900,
                "service_icon": "https:\/\/s.ytimg.com\/yts\/img\/favicon-vfl8qSV2F.ico",
                "id": 1,
                "original_url": "https:\/\/www.youtube.com\/user\/AaronBlaiseArt\/videos"
            }
        ]
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "For me personally, when I first start animating I want it to be as loose as possible - like when you have 30 second poses to draw in life drawing - I will only use spheres and broad shapes to get the 'flow' that I'm looking for. There's a great chapter in the Animator's Survival Kit where Richard Williams talks about how maintaining a character\/object's flow is through making sure their volume is maintained. In your animation you sent there are a couple of frames where the character's face appears thinner than other frames. Tomorrow I could do a draw over of your animation to demonstrate what I'm talking about if that's something you'd find useful?",
        "ts": "1543790722.000300",
        "username": "Emma Porter (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-02\/493441357330_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]