[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I think when I was first getting in to animation I assumed that scenes were split up in to characters rather than shots. So you may  have a few different people working on the same shot but animating different characters. This \/might\/ be the case for film studios like Pixar but I'm not 100% sure. It's definitely not the case here at Blue-Zoo but if the directors see your work with a particular character is especially good you might end up getting more shots with that character in. But certainly at Blue-Zoo you work on a section of the episode and you animate everything in your designated shots.\n\nI should clarify about the progression thing. It can be beneficial to let you HR team or your production manager or even director know that you have aspirations for higher positions. Otherwise they might assume you're happy with you current position. If you're lucky you'll have regular reviews with your directors and HR team and these sorts of questions will be asked just to make sure that the company is helping you with your career where it can. That's pretty much how it works here. In my latest review I made it clear I was looking for a new position.\n\nYes, the cover animator position is basically an entry level position. I don't know if that's the official title but it might be something that is offered to you before a full animator position if we need people at short notice or for just a short period. It is similar to a freelancer position.\n\nSo, a lead animator is in charge of a team of animators. The animation director has many other jobs and is in charge of all of the animation teams. On our current project we have 4 animation teams which each have a lead animator and actually at the moment we have 2 animation directors who give feedback, follow up with anything that's missing, go to voice recordings, hold meetings, make sure the teams have what they need etc. They also make all the big decisions about how your shots are going. So if they don't like the acting choice you've made they will ask you to change it. Or make you change the camera angles, that sort of thing. The animation directors are basically the bosses of the animation leads and the animation leads are the bosses of the animators.\n\nI assume a lot of the things I'm saying apply to most places in TV animation but before I worked here I worked for a games company so I don't know exactly how it works at other places. This is all just my experience here at Blue-Zoo.\n\nFeel free to keep asking questions =]",
        "ts": "1581935817.000900",
        "username": "Steve Kimbrey (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-17\/957610772774_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]