[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Awesome! Let's talk about first to this shot in concrete and then about \"animation\" :slightly_smiling_face:\n\nThe shot is looking good, is a great start.  How you can see in the Syncsketch, I suggested you to add another flap and change a little bit the spacing. But overall is looking good.  I have to say that animating a Dragon is one of the hardest creatures that you can animate. How they aren't really exist, is impossible to find a references, and we have to \"guess\" how they would be. Fly animation is hard too, there's a complex theory about how the birds fly, I let you here a really good tutorial if you want to take a look (<http:\/\/www.brendanbody.co.uk\/flight_tutorial\/index.html>) And! They have long neck and tail... Actually I hate to animate dragons  :joy: (I'm doing some Charizard stuff and is too hard)\nI suggest you maybe after this shot, you could do a creature that actually exist, maybe a Leon, Dog, I don't know... I think, when we start to animate we should be close to the references to try to don't lose the believability of our character.\n\nAbout animation -  I did feature animation for 6 years, I was super focus to do this kind of animation and suddenly I've got bored. I decided to try vfx, and, I'm really happy here. I think now there's a chance to do some nice performance and character animation in vfx. I did Christopher Robin, It was the best experience as animator that I had. Now I'm doing Detective Pikachu, and is pretty fun too. I think there's two companies, MPC and Framestore (where I'm working :slightly_smiling_face: ) where take really care about key animation, and bring us the chance to do something nice, and more close to feature animation style.\n\nAnd! I have to say... I will try to be in paddington 3 is that happens, paddington is awesome!! :slightly_smiling_face:",
        "ts": "1542708240.002400",
        "username": "Magin Marques (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-20\/483995921362_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]