[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "No worries! :grin: And thank you for the link, I’m definitely going to sign up.",
        "ts": "1542182547.002000",
        "username": "Giacomo Verri (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-14\/480277997431_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "On second thought, I remember applying to this apprenticeship scheme a month ago when I went to the AccessVFX careers fair (where I was introduced to e-mentoring). Still, thank you anyway for sharing the link :grin:",
        "ts": "1542182884.002100",
        "username": "Giacomo Verri (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-14\/479229517442_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Giacomo. So to answer your first question, I really enjoy working as a Compositor. You can make a good living out of it and you are constantly learning.  I've been freelancing for a number of years but am not on a permanent contract at my current place. I chose to do this as it gives me a but more opportunity to lead and supervise on shows. I would definitely recommend starting off freelancing though as you will get to work on a variety of different shows, meet lots of people, and get to know how different companies work. Once you've been to a few, you can then be a bit more selective and just go back to the ones you like working at and steer clear of the ones you didn't enjoy as much. In terms of industry, I wouldn't limit yourself to just film, especially at the start. It's all about getting the experience and working on whatever you can. Film, TV or commercials all present different challenges, so it's good to try as many as you can and see for yourself what you enjoy. Generally, there can be long hours in the industry but never feel like you HAVE to do it. I've seen some places try to put pressure on getting juniors stay longer but it should always be optional and as long as you are getting your shots done in time, there should be no need for it. I tend to leave on time most days and only stay late when there is a deadline coming up and they need help in getting shots out in time.",
        "ts": "1542195802.002200",
        "username": "Neal Patel (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-14\/478644945744_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "like i said, i feel it is good to work at a few studios to see what you like. the pipeline is different at every place but as you move around you'll find it's very easy to adapt and you'll quickly know their ways of working. bigger studios have a much more rigid pipeline and some of the mid sized places are a but more relaxed. it's good to get one of the big places on your CV, but don't limit yourself to them at the start. Like i said, it's all about experience and comping on shots, so don't be afraid to apply for the smaller or mid-range studios. I started off working at a smaller place then soon the bigger places come knocking when they see you're capable.  As for favourite films, Start Wars was fun to work on as it was a good challenge as everything on there had to be technically super accurate. Some smaller TV shows like Brain Dead and Outlander were also fun as they had some cool shots. I'm currently about to Lead and Supervise a show called Happy on Netflix which I think will also be lots of fun. Lots of blood and gore!",
        "ts": "1542196224.002300",
        "username": "Neal Patel (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-14\/479284710259_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Some amazing tips Neal! Originally, a couple of years ago, I wanted my career to start as a freelance motion designer because of ManvsMachine, but soon developed a huge passion for TV Adverts, mainly from the Mill and of course MediaArtsLab, which led me to VFX. All the good things you said about freelancing have reassured me on my career decision so far :grin:. By “Happy” do you mean the series by Grant Morrison? If so I’ve heard about it! I hope that by leading the whole project will run swiftly, I can guess that leading could maybe be pressurising at times, but I’m sure it will go great, can’t wait to see it! ",
        "ts": "1542197998.002400",
        "username": "Giacomo Verri (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-14\/480457924871_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Do you mind me asking, do you have any hobbies? What motivates you :grin:",
        "ts": "1542198024.002500",
        "username": "Giacomo Verri (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-14\/478669518256_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yes it's the grant morrison show. We'll be working on season 2 very soon. Leading and supervising does come with a bit of pressure as ultimately it's down to you but pressure is good. Pressure pushes you to take something to the next level. Without pressure you can't make diamonds :)\nAs for hobbies I'm a keen sports fan. I play football weekly and also follow a few other sports like boxing and MMA. I love film and going cinema but with a 3 year old it's tougher to get to go as much (unless I'm seeing kids films). What motives me? Well I think in the industry I'm in, you never will know everything so constantly learning motivates me. Learning new skills and new techniques in Nuke keeps me going and as you probably know, there's more than one way to skin a cat in Nike. Teaching others and passing on knowledge drives me too. I've given some Nuke tips and tricks talks at my company to help some of the mid and junior compositors as well ",
        "ts": "1542228934.002600",
        "username": "Neal Patel (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-14\/480978997527_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "It’s honestly riveting being able to hands on get to meet an industry professional! Your statements about pressure and always learning new things to progress as an artist are very true. I’m a sports fan too, mainly basketball though. Just out of curiosity, have you done a lot of work on TV adverts (I saw that you did CG integration on the Sky Sports Super Sunday commercial)? If so how did you find it, compared to working on films. I don’t know how to exactly word this but, did you have more or less creative input in a way? \nAlso, would you have any advice about life at university? I’m currently on my first year but I am so eager to get into the industry. Would you know if work experience is a thing? For example going to a company like UnionVFX or even a small one and look over professionals do what they do best, learning time-efficiency techniques as well as improving as an artist?",
        "ts": "1542230658.002700",
        "username": "Giacomo Verri (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-14\/481006403159_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]