[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I kind of hit a ceiling in the department I was in and couldn't really move up more. I was sitting next to the vfx department there and was seeing the cook work they were producing and wanted to be a part of it. They then had a junior comp position come up and so I just went over to the department and asked if I could apply with little vfx experience but with a motion graphic background. They said I could and so I kind of had to learn fast having never touched nuke. I basically learned on the job via tutorial and asking as many questions as I could. You can't beat just doing the work as a method of learning ",
        "ts": "1543220623.004600",
        "username": "Neal Patel (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-26\/487020415616_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That’s great! Currently I’m doing work experience at this small studio called Earth. It is a motion design studio but it’s fascinating to see how much the two (Motion and pipeline VFX) cross over each-other. As you might be able to tell I’m very torn on what to choose between the two haha",
        "ts": "1543222524.004700",
        "username": "Giacomo Verri (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-26\/487676956035_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Have a play with nuke and then see what you enjoy more between nuke and after effects. If you want to work in film but prefer after effects, companies like Territory studios would be ideal. They do a lot of motion graphics for film in after effects. They mainly specialise in user interact stuff like the HUD you see in iron man's helmet and stuff like that. Check out their website",
        "ts": "1543273518.004800",
        "username": "Neal Patel (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-26\/488377915380_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Definitely! I’ve heard of Territory, worth checking out. I’ve always been a massive fan of HUD designs but never a fan when it comes to making them. I have tried a few times, but I end up with a mess haha. Creating meaningful HUDs is an art form.",
        "ts": "1543301915.004900",
        "username": "Giacomo Verri (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-26\/488962624389_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]