[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Neal! Just a quick update. The assessment went great! Framestore and The Mill came back with an offer for a 18 month apprenticeship. I am torn by who to decide between the two. I love the Mill as a company, especially the advertising department and the Blackbird. But I have heard many great things about Framestore. Would you have any input on these two companies? :)",
        "ts": "1547480300.000400",
        "username": "Giacomo Verri (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-14\/522994363412_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hello Gia. Congrats on the offers. 2 offers is amazing and a great way to start your career. It's a tough one but both companies will be amazing for you. What it will come down to is whether you want to work on TV and film or advertising. The Mill London only do commercials so you'll be restricted to that. Framestore do both TV and film so you'll have a bit more high end work. If it were me personality I'd go for Framestore. Reasons being that some of the films you'll get to work on will look great on your CV compared to some commercials you'll do at the Mill (even though they'll be excellent commercials) there is a sense that there is a bit more prestige that comes with film (in my opinion). Like I said in any case both are excellent choices so think about what kind of work you'd like to do in the long run, short form with quick turn arounds or long form with more time to work on shots but will require pixel perfection.\nCongrats again and let me know what you decide",
        "ts": "1547481873.000500",
        "username": "Neal Patel (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-14\/523392319861_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thank you so much for your input Neal! It really gave a new dimension to my decision ahah. Well If I had to choose I am more geared towards advertising, especially automotive or tech gadgets etc. I have had the idea of making adverts from a very young age, but contributing to Marvel films for example is also on my bucket list. Ultimately, I agree with you. Although I love TheMill, I am leaning towards Framestore because of Film and Advertising. Do you think that if I pursue an apprenticeship with The Mill I would still have a chance to learn more and more in my spare time and maybe work with Framestore if I wanted to in the future? Or would the other way round be better :) thank you again Neal for being an extremely helpful mentor",
        "ts": "1547482552.000600",
        "username": "Giacomo Verri (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-14\/523404908869_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I think either way you decide you won't have an issue working at the other company as both are well respected in the industry. ",
        "ts": "1547482703.000700",
        "username": "Neal Patel (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-14\/522468808256_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That’s great to hear, and exactly what I thought!",
        "ts": "1547482953.000800",
        "username": "Giacomo Verri (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-14\/523043277140_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]