[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Svenja.\nThe setup in Germany is a bit different but in general I chose the course that lead me into the right direction of interest but was broad enough to give me flexibility to find out where exactly I want to go. If you would already have some very specific job goal in mind you can focus on that but otherwise I prefer to get a broad overview first because I might miss something I didn't know about before which could be really really interesting",
        "ts": "1543569027.000100",
        "username": "Alexander Schwank (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-30\/491328777408_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Taking a completely different situation for example, let's say you want to be a football player. At the beginning that's all you know and you don't really know which position you really like and is best for you. So you simply start playing football to learn the basics (e.g. how to kick the ball) and play on all positions to try out everything. Over time, you know a lot about football and you know where your strengths are and what you want (e.g. center defense). So you focus on that. But you now have a good understanding of other positions as well which is a great benefit as you better understand the whole game. If you ever decide to move into another position, the transition wouldn't be too hard because you've already played it before.\nOn the other hand, if you know from the beginning that you want to be a goal keeper (maybe because your idol is a goalkeeper too), you can focus much earlier on that. But it makes it harder to move into another position later on because you might be too specialized.",
        "ts": "1543569496.000200",
        "username": "Alexander Schwank (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-30\/491903483876_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "In which context do you compare internship and work experience? For your CV?",
        "ts": "1543569552.000300",
        "username": "Alexander Schwank (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-30\/491469047889_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yes, in the technology area it does count quite a bit what you've done. Either in school or in some internship or other experience or at home.  It's very important to have some practical experience but it doesn't always matter where that experience comes from.",
        "ts": "1543569677.000400",
        "username": "Alexander Schwank (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-30\/491905679796_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Game programming has some nice advantages but also downsides. One advantage is that you hopefully create something \"fun\" so the motivation to create it might be higher and you see some visual feedback. There are also some great tools out there to help you.",
        "ts": "1543569781.000500",
        "username": "Alexander Schwank (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-30\/493477312870_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "But a game is not just a programming task. It also requires game design (how to play the game), content design (how the game looks) and content creation (draw the content, e.g. the textures, models, buttons,...)",
        "ts": "1543569898.000600",
        "username": "Alexander Schwank (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-30\/491908342772_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "What are the requirements for the project? Can you build on top of something existing? Can you use any tools? How much time do you have? Is it a group project?",
        "ts": "1543570007.000700",
        "username": "Alexander Schwank (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-10-15\/456330530005_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]