[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I am actually still at work. I am the only one here. I suffer from depression so am quite worried at the prospect of being at home for a long period... especially with my children (I am a single Mum). So I am keeping routine as much as possible whilst the children at school. Doing lots of exercise and trying my hardest to limit news...",
        "ts": "1584609718.014700",
        "username": "Emma_MoonrakerVFX (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-19\/1010742631348_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "We can all work from home though. I tested it last week and it is fine. It is just very worrying that the work is drying up... but hopefully companies will start thinking outside the box to create content and will give us a shout!!",
        "ts": "1584609775.014800",
        "username": "Emma_MoonrakerVFX (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-19\/1013410692214_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I’ve been popping into uni every day too. Yesterday I manage to knock out an asset in two hours which would have taken me like 2 days at home. I’m I’m an introvert and for the most part enjoy the quiet, how ever I enjoy going out and seeing seeing friends etc. it helps me get out of my head. I’ve been estranged from my family for some years now so during Christmas and times like this I feel extra lonely which is why I usually like but also despise Christmas a little because everything is shut and I’m stuck in. \n\nYeah trying to limit the news , but it’s also scary being out of the loop. So trying to balance it. How is Bristol at the moment in terms of being able to get groceries etc? \n\nYeah its alarming, if it’s anything like 2008, it’ll be devastating in terms of employment so I’m currently on needles",
        "ts": "1584623191.014900",
        "username": "Louise Kalyango (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-19\/1011700903936_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I am sorry that you are estranged from your family. That must be tough. I stopped talking to my biological Dad in Nov. It has taken me years to make that decision but was the right thing to do and feels like a weight has been lifted. I hate Christmas too and have spent the last few years alone as the kids are with their Dad. Life is freaking hard.",
        "ts": "1584627799.015000",
        "username": "Emma_MoonrakerVFX (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-19\/1011960094149_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I'm always here if you want to talk. So important not to get stuck in your head.",
        "ts": "1584627814.015100",
        "username": "Emma_MoonrakerVFX (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-19\/1000474706707_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Bristol is weird. Most shops empty. Some people trying to carry on as normal, others staying on lock down...",
        "ts": "1584627864.015200",
        "username": "Emma_MoonrakerVFX (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-19\/1000477347011_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]