[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Louise! Really lovely to meet you! Let me tell you some things about me! I am based in Bristol at Moonraker VFX, we work mostly in broadcast television but also do museum experiences and Flyrides. I worked in London for 19 years before here in GFX \/ VFX for advertising at a company called Mainframe. I am a producer here and look after several programmes at once.\n\n<https:\/\/prospelamentors.slack.com\/archives\/CRVKT5QCU\/p1576753056004800|[10:57 AM]>\nHeres our reel for you to nosy at: <https:\/\/moonrakervfx.com\/vfx-showreel>",
        "ts": "1582621380.001900",
        "username": "Emma_MoonrakerVFX (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-25\/969481339479_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I am on here most days, just checking in. Anything at all I can do to support you \/ point you in the right direction,  I am very happy to!",
        "ts": "1582621514.002000",
        "username": "Emma_MoonrakerVFX (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-25\/967168838580_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "It would be lovely to meet you too. Maybe when you’re next down in London we could go for a coffee? \n\nI love science-y stuff so enjoyed the showreel very much! It must be interesting producing different projects at the same time; how do you manage it and is it challenging? \n\nAt the moment I am just in the mindset of getting my foot through the door. How was it for you? I have been thinking about starting as a runner just to get a feel for the job and and understand the “inner workings” and what it involves. what advise would you give me? \n\nCan I please also attach a copy of my CV so you could give me some feedback? \n\nLooking forward to hearing back from you. \n\nMany thanks,\nLouise \n\n",
        "ts": "1582651063.002100",
        "username": "Louise Kalyango (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-25\/970639835174_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]