[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Louis, thanks for sending through your showreel and a bit about you. I apologise I didn’t get back to you yesterday!\n\nI can definitely give you some advice on your showreel and also give you some pointers about getting into the industry, it’s not easy!",
        "ts": "1562745336.001900",
        "username": "David Sheldon (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-10\/678438861107_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "So firstly showreel. My advice, and this comes from experience and also knowing quite a few recruiters, is put your best work at the front and keep them short. I would say 1-1.5mins.\n\nYou have some good stuff on yours but I think you could do with trimming it down slightly. Certainly I think the underwater shot and the boat one are right to be up the front and then I would choose one or two other shots that you feel you like and keep it at that.\n\nThe other thing with showreels is keep your name and phone number\/email address on the screen throughout. Don’t worry too much about labelling all the passes but have a description of what you did on the shot at the bottom with your name eg compositing\/roto\/Houdini smoke simulation etc. Keep it simple. Most of the time the recruiters watch the showreels first (on mute!) before showing to a head of department and whilst they know what they are looking for they won’t be that interested in the specifics of each transition\/wipe.\n\nOn that note I would also make sure you play the final shot through first, then transition to the plate or where you started and build up from there. Colour effects\/grading should go on last. ",
        "ts": "1562745781.002000",
        "username": "David Sheldon (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-10\/678430356418_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "With regards to getting into the industry, it’s really hit and miss. I think my best advice is to befriend the recruiters on LinkedIn. The reason I say this is that most of the time getting a job in this industry is talking to the right person at the right time. The recruiters are always on the look out for talent but they’re not always recruiting for every department because of the production cycle. Compers normally get recruited in the latter stages of a production as generally speaking were not needed at the beginning when there is lots of modelling and animation being done.\n\nSo if you’re in contact with the recruiters on LinkedIn they’re always posting when they need people and it can be as simple as just emailing them and saying hi, I’m available. I got my job because I emailed one of the recruiters to say Happy Christmas and she asked if I was busy in January!\n\nOutside of that, make sure you keep your showreel up to date on all of the studios recruiting pages and also apply everywhere! Big studios are great but also the smaller\/boutique studios work on big projects as well and quite often you will be more involved and progress quicker in a smaller studio.\n\nWhere have you been applying so far and what kind of feedback or response have you got? ",
        "ts": "1562746338.002100",
        "username": "David Sheldon (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-10\/689852139184_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "If you have a CV and cover letter I can quite happily give advice on that too, like I said I am quite friendly with a few of the recruiters and so I know what they like and dislike. Let me know any other questions as well. I’ll always try and get back to you ASAP but work is quite busy atm so forgive me if I’m a bit slow!",
        "ts": "1562746456.002200",
        "username": "David Sheldon (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-10\/689853986400_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]