[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Sorry! I didn’t get a notification\/email about your response ",
        "ts": "1581507674.002000",
        "username": "beth greer (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-12\/948150817796_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I’ll definitely have a look more into technical art- there are a lot of things I never really realized went into games. It sounds silly but it’s along the lines of, I programmed a bouncy ball (which took forever with all the physics) and speaking to my mum about it, she didn’t really understand what went on. I’m just very curious about looking under the hood now so to speak! \n\nI’m trying to get together essentially a bunch of haphazard skills that I will eventually be able to put to use- I prefer to be “jack of all trades” on a personal level, but do you think that it’s better to specialise? ",
        "ts": "1581507836.002100",
        "username": "beth greer (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-12\/950818105222_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "No problem! I'm just glad I didn't bore you to death. :smile:\n\nYeah, there's a lot of evolution within the industry where new roles like technical art are appearing. At larger companies people specialise so much in one area it becomes a dedicated role, hence technical artists and animator roles appearing nowadays. It's good to be curious though! I love knowing how things work, and working out how they work is pretty much how you get good at your job. If you can figure out how it works, you can make it happen yourself.\n\nSo I would say it's 50\/50. At some companies, you only need to be good at the thing they are hiring you for. Howeve you're going to be much happier and better at your job if you understand and can work well within the areas adjacent to your role, so for me it's good to know a bit about anatomy and modelling as well as animation engineering to be able to at least talk to the next person in the pipeline about what needs to be done, and handle a few small tasks so I don't have to rely solely on others to carry out every task.",
        "ts": "1581541184.002200",
        "username": "Daniel Seager (IntoGames (Mentors))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-12\/951848635286_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]