[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Daniel! \n\nThat sounds great- I’m kind of in the nightmarish stage of knowing kind of what I want but not really, if that makes any sense. I have a pretty decent physics\/maths background and currently I study Creative Computing at Goldsmiths, but I also like to dabble towards digital art.\n\nI wanted to ask what you would recommend as some of the most important skills you learned to make yourself more capable of what you wanted to achieve!",
        "ts": "1580818888.001700",
        "username": "beth greer (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-04\/924301612323_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That makes sense, it's really hard to ever be 100% settled on exactly what you want to do, I have days now where I want to throw my animation portfolio in the bin and start over as a programmer! But I'd say it's really good to be interested in multiple areas in the sense you're talking about physics\/maths and digital art. With those specific examples you might want to look into something like Technical Art.\n\nThat's a tough question! The things that I'd attribute most to success wouldn't necessarily be skills though. It's good to know and be able to do certain things of course, being generally knowledgeable about how to use a game engine and understanding the basics of production, are always good skills, without focusing on specifics. However, I think being persistent and passionate are probably the most valuable attributes I would mention. Passion about animation drives me to this day, I've built a strong interest in all things animation over the years and passion about the craft is what drives you to make better and better work. Persistence is important, in my opinion, mainly because given how tough it can be to get in to the industry you have to have that drive to keep at it. Keep improving within your skill set, keep applying to new jobs, keep learning. If you are persisting, you are almost certain to achieve what you want eventually.\n\nI think soft skills would probably be the best thing I could recommend, especially critical thinking. To this day, being able to analyze things is a skill I use every single day in my job. For example, new game play features need to be broken down in to individual parts that will make them work, and being able to critically think about it helps me to process things, which is super helpful.",
        "ts": "1580858318.001800",
        "username": "Daniel Seager (IntoGames (Mentors))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-04\/936974693984_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]