[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I wouldn’t worry about boring me, I love to hear about this! \n\nI’m struggling to figure out my next steps to be honest, I’m not sure how I want to progress from here. I think probably a masters pr work experience would be good, but I don’t know where to start looking for stuff since my skillset is pretty vague",
        "ts": "1581609459.002300",
        "username": "beth greer (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-13\/951068247429_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "hopefully i fixed the notifications now so i can be a bit quicker :grimacing:",
        "ts": "1581609553.002400",
        "username": "beth greer (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-13\/940914605361_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "If you have done any yet, do you have an area you tend to focus on in group projects? Or more importantly, what is the area you most enjoy\/are most interested in?\n\nSomething to consider if you're not quite sure what direction you want to head in is QA. I started off in QA myself and it was really great to learn about all those moving parts and the find out what goes into making games, as well as just get a feel for the day to day, but it also provides really good inside opportunities to fill in suitable roles. It is for example super common for QA staff to move  up to game design roles, and where I work now, we've had people go from QA to Art roles, Programming and pretty much everything else. It's a really good way to get your foot in the door, as well as a perfectly viable role in of itself. (QA is short for Quality Assurance by the way and largely consists of testing the games.)",
        "ts": "1581627603.002500",
        "username": "Daniel Seager (IntoGames (Mentors))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-13\/951661333701_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]