[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yes! Some companies offer \"graduate artist\" positions or junior artist roles. I'd say either aim for graduate artist at a large film\/tv vfx company like ILM\/Framestore\/MPC\/Dneg, or a \"junior\" role at a smaller vfx company like One Of Us\/Jellyfish\/Axis\/Automatik (there are loads more).\n\nMy experience is mostly live-action film &amp; TV vfx, but a lot of these companies also do TV and feature animation. Would animation be your top choice?\n\nThe thing you want to start working on as soon as you can is a showreel, as this will be the thing that impresses employers when you apply. It should be between 1 and 2 minutes long and be a selection of your very best work. By the end of your second year I'm sure you'll have plenty of things to put into your reel! If you want to work on animations, it'd be best to try and fill your reel with several animation based projects (like characters for animation). Or just whatever interests you most! Try and keep it fairly specific, otherwise it can be confusing what your aims are for someone watching it.",
        "ts": "1566305257.004400",
        "username": "Jake Ferris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-20\/733944972759_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "The big companies all have graduate programmes, I'll link them for you:",
        "ts": "1566305354.004500",
        "username": "Jake Ferris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-20\/725701500193_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "<https:\/\/www.framestore.com\/work\/launchpad-internship>",
        "ts": "1566305356.004600",
        "username": "Jake Ferris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-20\/733946702215_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "Framestore",
                "title": "Launchpad Internship",
                "title_link": "https:\/\/www.framestore.com\/work\/launchpad-internship",
                "text": "Framestore offers students the opportunity to work alongside our talented teams across all of our sites in London, Montréal and our US offices as part of our paid summer Internship scheme. However, you will need the right to work for the location you are interested in. During their time with us, our Interns are exposed to a wide range of departments across the company. To be considered for the chance to take part in our Internship we would prefer it if you had an interest in, or are studying any of, the following subjects: visual effects, animation, games, real-time computing, computer science, film or TV production, design, photography, illustration or fine art.",
                "fallback": "Framestore: Launchpad Internship",
                "image_url": "https:\/\/www.framestore.com\/sites\/default\/files\/styles\/slideshow_images_medium_1400_788\/public\/case-study\/images\/img_9696-1_copy_2.jpg?itok=Co6Hsndx",
                "image_width": 444,
                "image_height": 250,
                "ts": 1504543500,
                "from_url": "https:\/\/www.framestore.com\/work\/launchpad-internship",
                "image_bytes": 701397,
                "service_icon": "https:\/\/www.framestore.com\/sites\/all\/themes\/framestore\/img\/touch-icon.png",
                "id": 1,
                "original_url": "https:\/\/www.framestore.com\/work\/launchpad-internship"
            }
        ]
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "<https:\/\/jobs.smartrecruiters.com\/MPC\/743999684947544-film-production-graduate-training-programme>",
        "ts": "1566305491.004800",
        "username": "Jake Ferris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-20\/731618021108_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "MPC",
                "title": "Film Production - Graduate Training Programme",
                "title_link": "https:\/\/jobs.smartrecruiters.com\/MPC\/743999684947544-film-production-graduate-training-programme",
                "text": "Company Description: With offices all over the globe, MPC Film is one of the world's leading visual effects studios, creating high-end VFX for the feature film, episodic and creative industries. We are constantly looking for the best talent in the world, enthusiastic people that come to work every day with the desire to be a part of some of the best work in the industry. Our teams throughout our global network of studios produce visually stunning and technically challenging VFX and digital projects of the highest quality, and we are looking for candidates with a desire to be involved in the success of these projects. Job Description: Our graduate program is like no other, setting you up for a successful career towards becoming a Film and TV producer for either large scale production or episodic content.You will stretch your own capabilities, challenge the status quo, strive to take your learning to the next level and improve services for our clients. Completing a number of rotations thought out the 18 months programme you will gain a complete overview and skills to operate as a VFX Production Manager.The rotations will include: Finance Management – You will gain experience in a wide range of activities such as corporate finance responsibilities, accounting and financial analysis, and methods of considering the most commercial value for money, to allow you to make sound decisions on revenue, make effective risk assessments and allocate of resources for optimum resultsShow Analysis and Workforce Planning - where you'll gain the skills, knowledge and confidence that will enable to provide data-based solutions support the effective decision-making to our shows, by provide high quality, timely analysis and intelligence, structure problems and develop appropriate analytical solutions, analysing and triangulating data and providing insight and giving persuasive explanations of complex concepts orally and in writing to a range of audiences, in a clear and accessible mannerLeadership and General Management  - the training you receive will give you the skills, knowledge and confidence that will enable you to make real improvements at the frontline, to allow you to develop your own leadership skills to be the leader of the future, understand and drive strategic direction, lead operations, understand how you contribute to maintaining a learning organisation and create effective relationships with stakeholders.Show Planning &amp; Production Management - Here you will gain the skills, knowledge and confidence that will enable to effectively combine the pieces of the puzzle and keep show on track. You will be exposed to: Effective scheduling, Balancing show and facility needs, Dailies and other meeting management and motivate the team towards combined goal.Talent Management - you will gain the skills, knowledge and confidence that will enable you to make people changes, to allow you to value equality and diversity, help mould culture and communication, support and drive changes on real strategic issues, ensure the company is equipped to have the right people and skills in the right place at the right time.   Qualifications: Excellent communication skills. You will be someone who is comfortable in dealing with ambiguity whilst influencing change.Innovative leaders. You will be the type of person that always looks for opportunities to do things differently, while anticipating economic, social and technological opportunities and risks.Innate personal confidence. You must be able to thrive in an environment that at times can be volatile, uncertain, complex, and ambiguous (VUCA).Strong influencing skills. You have strong influencing skills and the ability to build collaborative relationships that balance challenge with support and build trust and mutual respect across organisational boundaries.Effective Decision Making. You are able to use sound judgement and evidence to make effective decisions, in the face of uncertainty.Ability to move globally.  We need you to be highly mobile and have the desire and flexibility to want to work in different locations- it is important to note, the role, after completion of the Graduate Scheme can be in any of our locations.Dedicated multi-taskers. You might be working on several projects at any one time, meaning you should priorities and manage your time, while keeping on top of constantly changing markets. Adhering to the rules and regulations we have will ensure you deliver the right results for multiple projectsPassionate role models. You are able to inspire, lead, manage and listen to both individuals and teams is important in building relationships that encourage mutual respect. Additional Information: Where can this lead: If you are successful and graduate from the programme, you could be on your way to becoming a VFX Producer and working with some of the biggest Entertainment studios in the world. All your information will be kept confidential according to EEO guidelines.",
                "fallback": "MPC: Film Production - Graduate Training Programme",
                "image_url": "https:\/\/c.smartrecruiters.com\/sr-company-images-prod\/57bca6abe4b0e67f6dff4e36\/default_social_logo\/300x300?r=s3&_1562573914854",
                "fields": [
                    {
                        "title": "Location",
                        "value": "London, UK",
                        "short": true
                    },
                    {
                        "title": "Posted",
                        "value": "Mar 11, 2019",
                        "short": true
                    }
                ],
                "from_url": "https:\/\/jobs.smartrecruiters.com\/MPC\/743999684947544-film-production-graduate-training-programme",
                "image_width": 250,
                "image_height": 250,
                "image_bytes": 1979,
                "service_icon": "https:\/\/c.smartrecruiters.com\/smart-branding\/slack-icon-iphone.png",
                "id": 1,
                "original_url": "https:\/\/jobs.smartrecruiters.com\/MPC\/743999684947544-film-production-graduate-training-programme"
            }
        ]
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "<https:\/\/www.dneg.com\/careers\/students-graduates\/>",
        "ts": "1566305522.005000",
        "username": "Jake Ferris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-20\/720637252034_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "DNEG",
                "title": "Early Careers - DNEG",
                "title_link": "https:\/\/www.dneg.com\/careers\/students-graduates\/",
                "text": "[...]Read More...",
                "fallback": "DNEG: Early Careers - DNEG",
                "from_url": "https:\/\/www.dneg.com\/careers\/students-graduates\/",
                "service_icon": "https:\/\/www.dneg.com\/wp-content\/themes\/dneg\/images\/favicon.png",
                "id": 1,
                "original_url": "https:\/\/www.dneg.com\/careers\/students-graduates\/"
            }
        ]
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "<https:\/\/jobs.jobvite.com\/lucascompanies\/search?l=London&amp;c=CG+Artist&amp;s=&amp;q=>",
        "ts": "1566305573.005200",
        "username": "Jake Ferris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-20\/733950869543_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "title": "ILM, ILMxLAB, SkySound Careers",
                "title_link": "https:\/\/jobs.jobvite.com\/lucascompanies\/search?l=London&c=CG+Artist&s=&q=",
                "text": "<https:\/\/jobs.jobvite.com\/lucascompanies>",
                "fallback": "ILM, ILMxLAB, SkySound Careers",
                "image_url": "https:\/\/careers.jobvite.com\/ilm\/logo-social.png",
                "from_url": "https:\/\/jobs.jobvite.com\/lucascompanies\/search?l=London&c=CG+Artist&s=&q=",
                "image_width": 478,
                "image_height": 250,
                "image_bytes": 10369,
                "service_icon": "http:\/\/app.jvicdn.com\/__assets__\/images\/apple-touch-icon-precomposed.png?v=190819141515",
                "service_name": "jobs.jobvite.com",
                "id": 1,
                "original_url": "https:\/\/jobs.jobvite.com\/lucascompanies\/search?l=London&amp;c=CG+Artist&amp;s=&amp;q="
            }
        ]
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "They all open about April time each year for recent graduates. I did the MPC one for 2 months and it was really good.",
        "ts": "1566305614.005400",
        "username": "Jake Ferris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-20\/732092015861_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "The ILM one isn't a link to the exact grad training scheme as I couldnt find it... embarassing as I work there :sweat_smile:",
        "ts": "1566305656.005500",
        "username": "Jake Ferris (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-20\/732092805301_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Wow , thank you so much, I got much to think on now that you shared this with me, Ill keep you updated, I wanna update my portfolio before this year starts and so on, than you very much, Im very excited to see how this will go!",
        "ts": "1566338283.005600",
        "username": "Maria Paz (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-20\/735002149622_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]