[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "This is a good start! You're definitely on the right track. It does need a fair bit of work though if you want it to be acknowledged by companies that are doing feature work since the bar is incredibly high.\nWith that in mind, I'm going to _attempt_ a deep dive and really peel apart whatever I can see. It may come across as negative but that's not my intent, there's some good work here! This is going to be pretty detailed but I can be even MORE detailed if you upload the showreel on syncsketch so I can go through it frame by frame.\n\nThe first scene (with Spiderman) isn't bad, I think the screen direction is a bit jarring in particular with the third shot (the camera moves from right to left and then and cuts to a rotate quite abruptly). As for the animation itself, I like the landing in the first shot quite a bit as it's got a good heft to it, but the linking up of the run from the end of the first shot to the run of the second shot isn't consistent so it's noticeable. When spidey vaults over the wall he accelerates very quickly and comes to a stop on a beat, try and keep a constant rhythm since that has a lot more appeal. I also just noticed that his right shoulder is a bit busted, you can fix it with a rotate without compromising the pose.\n\nFor the scene at the table my main concern is the acting choices, I can't quite tell what's happening. I'm under the impression he's talking to himself until someone walks in but the problem lies with his eye line, it keeps floating around the scene so I can't tell what he's supposed to be looking at. This coupled with the fact that his head seems to be locked looking forward makes the piece a bit confusing, because of this the contrast between his emotions as well as his poses during the main beats are lacking so I can't seem to pick up on the peaks and valleys of the emotional storytelling. Along with that, the second pose seems to have a strange bend in his torso which is a bit distracting. There also seems to be a lack of weight which is making him more floaty; two examples I noticed was when he hits the table (it's veeery slow) and when he slowly gets off the table into this standing pose but his weight doesn't seem to shift onto his left. The weight issues make the shot a bit weaker in my opinion since it gets in the way of the acting, all of these problems can be resolved if you pay close attention to literally every single body part in your reference. (if you didn't reference for this try acting it out and see how it feels!)\n\nSome positives though! The chair being pushed back is a very good touch, big fan of your choice there (maybe add a bit of foley so you can make it punchy!). His lipsync is really good; It was clean and readable so good job! Despite my being critical of it the second pose has a lot of character, I think with some polishing it can be a strong finish to the shot. Other than that I'd say the lighting is really nice, it's crisp as heck and I like how the end product looks!\n\nOkay, so the basketball shot. I actually quite like this (it is a bit dark though so it's tough to see the nuances of the acting) it's dynamic and fast which is good, I really like the speed and weight of the pass, it's just lovely. That said there are speed issues, the purple guy speeds up when he bounces the ball for the first time and then slows down quite quickly before he does the lay-up. The arc of the ball when he bounced it for the first time as well as when he does his lay-up is off, if you put a motion trail you'll see what I mean. Aside from that, there are some issues with rigidity; namely, when purple is bouncing the ball his torso is very straight and when he walks away from the net his walk is very rough.  This is a complex shot so the amount of work put in will definitely be noticed by recruiters.\n",
        "ts": "1583411278.002800",
        "username": "Sidd Shetty (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-05\/973382801649_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "So finally the wolf shot, I'm going be honest with you I'm not a creature animator so I won't be able to give the _best_ feedback when it comes to this, that said I don't actually think this is as bad as you think it is. It's definitely slow so I can see why one might think it's uninteresting but if you polished it I think it's presence on your reel would beneficial cause it shows that you have variety.  I think it looks stiff but it's mainly the limbs and torso not following through as much as they should. The interaction is pretty nice though it goes on for a beat too long.\nI will say that the wolf looking at straight at the camera like a looney tunes character, while hilarious, might not be the best acting choice.\n\nAlso, I cannot get over that mini wolf that's CLEARLY an adult that's been scaled down, it's so funny :joy: I'd keep that in because it's also really well animated so nice job!\n\nSo that's that, sorry it took a while! I figured it'd be worth it if I could give you every bit of feedback you could get!",
        "ts": "1583411279.002900",
        "username": "Sidd Shetty (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-05\/973382801649_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]