[
    {
        "type": "message",
        "subtype": "channel_join",
        "ts": "1584618817.000200",
        "user": "U4VR52RQE",
        "text": "<@U4VR52RQE> has joined the channel"
    },
    {
        "type": "message",
        "subtype": "channel_join",
        "ts": "1584618818.000400",
        "user": "U6D2VCN07",
        "text": "<@U6D2VCN07> has joined the channel",
        "inviter": "U4VR52RQE"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": ":champagne: _You have opened a new, empty shared channel._ \n_Share <https:\/\/www.smooz.io\/room\/5e735d41cca2270004e845dd|this link> with other teams to invite them in it_",
        "ts": "1584618818.000500",
        "username": "Smooz",
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "channel_join",
        "ts": "1584619162.000700",
        "user": "U4V22C6A1",
        "text": "<@U4V22C6A1> has joined the channel",
        "inviter": "U4VR52RQE"
    },
    {
        "type": "message",
        "subtype": "channel_join",
        "ts": "1584619162.000900",
        "user": "UTTNC1BJM",
        "text": "<@UTTNC1BJM> has joined the channel",
        "inviter": "U4VR52RQE"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "_Team *Prospela Students (beta)* joined the shared channel_",
        "ts": "1584620854.001000",
        "username": "Smooz",
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "_Team *Prospela Mentors (beta)* joined the shared channel_",
        "ts": "1584620857.001100",
        "username": "Smooz",
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "channel_name",
        "ts": "1584620887.001200",
        "user": "U4VR52RQE",
        "text": "<@U4VR52RQE> has renamed the channel from \"z-shared-27\" to \"aurelie-and-violet\"",
        "old_name": "z-shared-27",
        "name": "aurelie-and-violet"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "_@violetgonzalez2 has joined the channel_",
        "ts": "1584621075.001300",
        "username": "smooz (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-19\/1011628108037_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "_@aureliecouble.vfx has joined the channel_",
        "ts": "1584621084.001400",
        "username": "smooz (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-19\/1011154528164_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Violet, please meet Aurelie your incredible E-Mentor we've been telling you about :smile:. Feel free to introduce yourselves, say a little bit about what you would like to get out of the mentorship and continue chatting within this channel. :wave:\n\nI will now be leaving the channel, but please direct message myself or penny-prospela if you have any questions. All the best for now! :slightly_smiling_face:\n\nNote: You will not see your match as a \"member\" in this channel however you can see from the chat history that they have joined\/been added :smile:",
        "ts": "1584621099.001500",
        "username": "Dexter Boyce (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-19\/1001544094465_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "_@dexter has left the channel_",
        "ts": "1584621103.001600",
        "username": "smooz (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-19\/1011155280404_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "_@dexter has left the channel_",
        "ts": "1584621112.001700",
        "username": "smooz (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-19\/1013821513286_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Violet ! :slightly_smiling_face: How are you doing ?\nMy name is Aurelie, I'm a Compositor currently working at RodeoFX in Montreal. I've worked at Double Negative and Method Studios in the past. I've pretty much hit all the step in the 2D department, starting from runner to roto, paint and then comp :slightly_smiling_face:\nLet me know if you have any questions for me, or how can I help you, what you're looking for with this e-mentoring and I'll be glad to share my experiences in the industry and answer your questions as best as I can ! :slightly_smiling_face:",
        "ts": "1584624054.001800",
        "username": "Aurelie Couble (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-19\/998954548546_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi, I'm great! It's nice to finally meet you Aurelie :slightly_smiling_face:",
        "ts": "1584651693.001900",
        "username": "Violet Gonzalez (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-19\/1013195870293_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Oh wow that's very impressive! I hope my career can grow in the same ways :slightly_smiling_face: How do you like it at RodeoFX? I'm currently going to the Los Angeles Film School, majoring in Special Effects. I want to be a Compositor, and am currently doing portfolio work since I am within the last few months before graduating. It's definitely pretty nerve racking, but I'm hoping this mentorship will help me feel better prepared for the industry. I also love my school, but there are definitely some technical aspects of compositing that we have not touched upon that I hope you can help me with. For now, the main question I have is in regards to something I've heard a lot about. In my current class, they've put a lot of focus into getting us to try to network with as many artists and people within the industry. From your experience, do you agree that most opportunities come from networking, or are most positions offered based on talent? Thanks :slightly_smiling_face: hope you're having a great day !",
        "ts": "1584652665.002000",
        "username": "Violet Gonzalez (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-19\/1013233891797_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hello again :) that's an exciting time !! I remember a few years ago I was in the same situation, it was really intense and a bit stressful. I just sticked to my plan, I had my objective and everything went smoothly.\nI think as students we tend to make it a bigger deal than it really is. If you put the work, the results will come :)\n\nI have a few questions for you so that I understand your situation better and can advice you in a better way :)\nAre you doing exclusively portfolio work or do you still have classes ? What work are you exactly doing at the moment for your portfolio ?\nAnd when do you graduate ?\n\nOtherwise, about the technical aspects you haven't touched at school, let me know which areas you're missing and I'll try and explain or show you how to do it :)\n\nFinally, for the networking part, I'd say that I definitely underestimated it. I always felt that if I show I have talent I'll get good offers, but it unfortunately not work like this to be honest with you.\nI'm not saying you don't have to be good, of course you have to show that you know how to do the job, but having a good network, knowing a lot of people in the industry will definitely make it way easier for you :)\nCompanies will often ask for recommendations if one of their employees know you, so it's best to keep good contact.\nI would also mention that it is something that comes naturally when you're at work, meeting new artists, or on social medias as well, just keep a good attitude, show that you are a good teammate and it'll come naturally.",
        "ts": "1584657222.002100",
        "username": "Aurelie Couble (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-19\/1001900028211_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hello :slightly_smiling_face: ya it is honestly, besides the nerves I'm super excited! That sounds amazing, can I ask what your post grad plan looked like? Thanks, I really hope so :slightly_smiling_face:\n\nOf course,\nI still have class, but the classes I have are portfolio classes, so we have a lot of time to work on shots that will be on our reel. At the moment, I'm creating a shot that's a mixture of Coraline and Stranger Things, with a colorful tunnel and particle simulations. I modeled a room in Maya, added camera movement, and am currently 3D projecting textures on the walls. I also already created a tunnel in After Effects using the RG Trapcode Mir 3 extension, lit it, and animated the lights to move around. Next I will be adding the particle simulations and color correcting the scene to match the tunnel. The only part I'm not too sure about is how I will add depth to the tunnel once it is in Nuke, or if I should give it depth in After Effects and bring the footage there. I also need to have light pouring out from the tunnel into the room. Not too sure what approach I will take with that either, but I will get to it soon. As for graduation, my last month of class will be June :slightly_smiling_face:\n\nThank you! When I was doing some research in regards to how I would create reflective light and light pouring out from the tunnel, I came across a few articles for luma mattes. I know it's something I should know about, but we never truly touched on them in class. I'm not too sure if I will be using a luma key for my current shot, but if I do I will definitely have some questions !\n\nOh okay that makes a lot of sense! I will definitely try to make more of an effort to go to events and try to meet people online. Thanks!",
        "ts": "1584676379.002200",
        "username": "Violet Gonzalez (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-19\/1000962438658_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]