[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Have a great time on your holiday, don't rush to get back to me, enjoy wherever you are.",
        "ts": "1568188050.002900",
        "username": "Chris Fryer (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-11\/744661536147_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Your reel is cool. I like how you've shown the edges on your keying, agreed that seeing the key in use would help it even further.\nI really like your final year project. Did you work with Lola and Chloe by any chance?\nThe film has a really unique look and the work you've done is super tasteful.\nPerhaps consider removing the arch-vis and colour grading I think that space in your reel could be used for more relevant.\n\nFor comp reels I'd say you should try and show something from each of this:\nPaint work\nRoto\nCG integration\n2D comp\nKeying\nFull CG comp\n(Bonus: Tool work)\n\nIt just shows you've got a knowledge for the range of skills required for day to day tasks.\n\nI'd say take the word Junior off of your titles. Even if you're junior you're already setting expectations.\nI'd also perhaps use \"Compositing\/Paint &amp; Roto\" when I heard \"2D artist\" my brain jumps to hand drawn animation as opposed to comp.\n\nIncluding lighting work could be decent if it's relevant. Definitely shows an understanding of the elements you could be given.\n\nWhat kind of companies are you aiming for? Are you going for large studios (MPC, DNEG etc...) or smaller (One of Us, Freefolk etc...)\n\nI saw a post from MPC hiring \"Comp of all levels\" I think that's code for \"We'll pay juniors to do mid\/senior level work\" but if you're okay to do something like that then definitely put in an application.",
        "ts": "1568188713.003000",
        "username": "Chris Fryer (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-11\/755672021220_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]