[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "At this mid-way point, we've asked all of your Students for feedback on how things are going. They said you should:\n\n*CONTINUE being straight forward in answering their questions!* :facepunch:\nThey've loved the honest insights and that conversations weren't overly formal.\n\nand\n\n*CONSIDER sending more pictures and insights to working life!* :camera_with_flash:\nStudents said they'd love to get visual insights to working life and employability skills in action. It may seem strange if students are not asking questions to keep the conversation flowing (they're certainly not perfect in their social skills!) but they are logging in very regularly and lots of them completed very positive feedback on you guys, despite not being overly active in their conversations!\n\nNOTE: We've told the students your feedback i.e. to ask more open-ended questions &amp; delve deeper to find out more about the pics \/ video insights you're sending\n\n_E-MENTOR LEADERBOARD COMING SHORTLY (for engagement over the past month!)_ :wink:",
        "ts": "1509911381.000040",
        "username": "bot"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "*THE RESULTS ARE IN!!* <!everyone>\nCongratulations to <@U00> for smashing his E-Mentor duties with 117 messages sent over the first half of our pilot programme! He's the lucky winner of a PROSPELA T-SHIRT &amp; a LinkedIn recommendation from Prospela!\n\nWe'll be resetting the clock starting from today and announcing another leaderboard for the 2nd half of the programme, so everything to play for until we wrap up at the end of November. :upside_down_face::+1:",
        "ts": "1509912545.000001",
        "username": "bot"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "<@U00> uploaded a file: <https:\/\/prospelaautumn1.slack.com\/files\/U7CQMS6N4\/F7W4S7H46\/e-mentor_leaderboard.tiff|E-Mentor Leaderboard.tiff>",
        "ts": "1509912624.000187",
        "username": "dexter"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "<@U00>, <@U00>, <@U5WR9CJTC> &amp; <@U00> - great job!! and THANK YOU to ALL OF YOU! We've had some amazing feedback from our Students and hope you've enjoyed it so far too :bowtie::smiley:",
        "ts": "1509912658.000079",
        "username": "bot"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "<!everyone> Thanks to those that have given feedback on their Mentees so far. \n\nKeep the survey responses coming (if you haven't completed it here is the link to do so <https:\/\/prospela.typeform.com\/to\/h51YqI>). It's really helpful so your Mentees know how to make the most of you over the remaining month of the programme. :ok_hand: :relaxed:\n\n:point_right::point_right::point_right:*Some fantastic improvements so far* - On average, based on student feedback they've improved as follows: \n\n+55% Confidence in knowing what to do for a career\n+70% Confidence in knowing what next steps \/ actions to take to get down their preferred career path\n+55% Appreciation of how school has prepared them for their future career\n+66% Confidence in knowing what skills employers are looking for\n\n:clap::clap::clap: Brilliant to see how much of an influence you're all having on your Mentees, well done all round :+1::+1::+1:",
        "ts": "1509918152.000070",
        "username": "bot"
    }
]