[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Callum! How’s it going?\nhope you had a nice weekend.",
        "ts": "1566244558.005300",
        "username": "Shailendra Pandey (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-19\/733487710342_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I had a look at your reel. good work!\nnicely presented ",
        "ts": "1566244582.005400",
        "username": "Shailendra Pandey (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-19\/731300907584_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Lets look at your questions\n\nHow did you get your first job as a compositor?\nWhen I was a student I would take up compositing tasks with friends(like little aspirational projects with friends), make short films(and volunteer to do the compositing) eventually leading to freelance work.\nManaged to put together a portfolio upon graduation, Interviewed at a few places and found work at a film vfx company which had just started using nuke.\n\nWhat was it like working at DNEG and Framestore?\nThe Vibe is similar between both the companies. I have had the opportunity to work on cool stuff at both places.\n\nDid you work at DNEG in London?\nYes I worked in London for a bit before moving to Canada. The DNEG Office is cool with some nice coffee and relaxed atmosphere.\n\nWhat are companies looking for in a graduate compositor showreel?\n-Examples of relevant work.\n-Potential to do great things\n\nWhat should I be practising?\n-Compositing\n-Try filming something and experimenting with it(a phone or a borrowed camera whatever is available). Make it look cool! be the director\n\nHave you ever been to FMX? If you have, what is it like?\n-I haven’t visited FMX but I have been to Siggraph, You get to see lots of active research. Meet\/Network with different people, talk to recruiters and ofcourse find a job. I would expect FMX would be on similar lines\n\nDo you use Nuke at Framestore?\neveryday, all day.\n\nWhat kind of stuff are you working on at Framestore?\nThis year it has been quite a bit of Environments but also CG characters. Currently we are working on a film called Lady and the Tramp. \n\nDo you have any general tips for me?\nYes! Keep an open eye and observe.\nReality is complex so is cinematic “reality”\nfilmed through a lens with a camera.\nPractice making pretty pictures with tools you have, learn new things as you go.\nKeep it simple!",
        "ts": "1566244610.005500",
        "username": "Shailendra Pandey (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-19\/730836131156_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]