[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Good morning Claudia! Delighted to connect with you and have the opportunity to work with you. \n\nI am a 2d harmony rigger and animator. Currently I'm working on Blue-Zoos first 2d TV show, which is very exciting! It looks so great. Hopefully it will air before the summer next year - I can't wait for everyone to see it. Before that I was in Ireland in a bunch of studios!\nI would love to know more about you! I was told you're hoping to get into 2d as well? How can I help you?\n\nChat soon,\nNiki",
        "ts": "1573933899.001700",
        "username": "Niki Kehoe (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-16\/824716439698_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Nikki! \nI'm very fortunate to be able to speak to you! I have been following Blue Zoo for quite a long time and I was very pleased to see they are doing 2D animation and I'm sure itll look great. Right now I am on my thrid year of illustration and animation at Coventry University and 2D animation is what has 'stolen my heart' haha. I would have a few questions surrounding rigging actually :) I have been animating frame by frame with ToonBoom 'traditionally' but I was wondering if in cases like waking cycles rigging accelerates the process a lot. My guess is that for series that the same characters are going to be used multiple times you would save a lot of time rigging the characters. I'm very new to this and I haven't actually rigged anything on ToonBoom yet but I was wondering how do you manage to avoid  making it look 'plain' or as if it was cut out animation. Do you right the characters from all views?  Thank you very much :sunflower:I feel really lucky to speak to you and I'm sorry I didn't message before, I didn't receive your message until now. \nApart from the technical things it would also be nice to know what got you into animation and the style you like the most :)",
        "ts": "1573948842.001800",
        "username": "Claudia (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-16\/829654117249_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I just read I wrote Nikki instead of Niki, my apologies!",
        "ts": "1573948911.001900",
        "username": "Claudia (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-16\/839790828454_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]