[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Okay, so I just want to get a gauge on how much you use Harmony. Is it the main software you use, so you're pretty comfortable with the drawing tools? Or since you do hand drawn do you use the brush tool most?\nWe use the pencil tool in studios as it's so much easier to control and easier for multiple artists and riggers to achieve a synchronous look. Also, you can control the amount of vectors and keep the files a lot lighter. So when I say comfortable with the drawing tools I mean do you know how to do line tapering, cutting lines, drawing invisible lines to fill gaps etc.\nYou might have learned all that stuff in college. But if you haven't, this lesson would be really good to get your knowledge up on all. It has some really excellent pointers in how to speed up your workflow and get the most out of the software. Also, I'd recommend downloading the material and doing the little exercises to get used to using the tools. Paint Unpainted was a tool I didn't know about and it has been a total game changer in work! Whatever work you want to do in Harmony, knowing this stuff really well will help you with all of it. Anything you already know, I'd skim through the video anyway, because they put some really nice little tools in that can be a bit hidden!\n<https:\/\/learn.toonboom.com\/modules\/drawing2?c=24>\nIf you know this stuff already, let me know and I will pass you on something else to look at.\n\n\nAlso, the rigging modules on the learn portal are substantial, so I would recommend even getting the first one done. But we can go through that together step by step as part of my mentoring you if you like. It would be easier for me to give you exercises off the learn portal than to make up new ones, because I'd basically be making up the same ones anyway! They are really good!\n\nI don't want you to burn out or to hinder your college work but I do want you to get the most out of your mentorship. I'd love to touch base with you every week or two. So we could say that if I give you something to work on (like the drawing tools videos above), you have 2 weeks to get back to me with something for review or for us to talk about. Doesn't have to be finished - as we do more complex things you might want some feedback as you go but could take longer to do.  And the same with me - I am sure I'll be able to look at your stuff once a week if you have something to show, but work and life get busy sometimes so good for me to have a window of 2 weeks too.\n\nThis is not school though and you know best how your schedule is. So that's just an idea and I am totally open to any suggestions you have on it and also to be very flexible on the 2 weeks thing. If you have a big college assignment or are off on holidays or whatever it is, just let me know :slightly_smiling_face: But I'd like to have a nice flow to things so if we keep chipping away at little challenges, you will have a chance to build up a nice bit of knowledge! So let me know your thoughts on it all!\n\nI would love to see your project when you're finished! Please let me know where to find it when it is online. You can find me at <http:\/\/nikikehoe.com|nikikehoe.com>. Though I'm currently working on new showreels as I don't have a rigging one and my animation one is quite outdated!",
        "ts": "1574522123.002300",
        "username": "Niki Kehoe (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-23\/846285189396_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]