[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Claudia,\nSo sorry for the big delay in getting back to you - it was so busy before Christmas I just didn't have a spare minute! And then I came home to Ireland for Xmas, so it's been pretty hectic catching up with friends and family too.\n\nI took a look at your website and portfolio. It's really great stuff. I really enjoyed your Lyses short film. If 2D animation is what you are interested in getting into as your profession after college, I think continuing to develop your animation and visual development skills is a really good idea. When you get into animation as a career, there is not much room for being precious. Every single thing you do in a studio will be critiqued by someone, and animation, almost every shot you do in studio will get retakes! It's just the nature of the job!\n\nSo in terms of feedback, I would say you don't have enough to put a showreel together to send out to studios. A showreel does not need to be long. Personally, I always tried to aim for 60-90 secs of quality work. Now, my animation reel is VERY outdated (it even has my old website on it and not my actual website!) but I'll share it with you anyway and tell you my thought process: <https:\/\/vimeo.com\/219311568>. So a showreel that you send to a studio really needs to have at least a walk\/run cycle (preferably of a whole character), a dialogue shot between 2 or more characters (on screen!) and a shot with a character using a prop. Those are the bread and butter types of shots in animation so studios need to know you can do that kind of thing.\n\nYour walk cycle in Lyses has very nice personality to it - it tells you the story of this weary character. That's really good! Definitely great for a showreel. It's a little unfortunate you can't see the feet. Contact poses are really important. Studio's need to see that you can plant the character without them looking like they're sliding. But that's something to keep in mind for the future if you're doing another walk cycle in your next project or something.\n\nKeeping in mind that you said you would like to get into 2D animation, at the moment your animation portfolio is missing a lot of stuff that studios really want to see. You don't have enough work that demonstrates the 12 principles of animation. It is the main thing studio's want to see demonstrated. If you want to get into 2d animation, pick 3 studios you would like to work for. For me in college it was Cartoon Saloon, Boulder Media and Blue-Zoo. So I looked at their bodies of work. And tried to figure out what I could do that would appeal to them. They have quite cartoony styles so I tried to bring some of that into my own work. I did quite a harrowing movie as my final project and to be honest it didn't turn out very well in the end, but the style was cartoony and there were a few shots that were dynamic and well animated. That was all I needed from it. I can't actually find it online but if I do hunt it out, I'll send it on to you!\n\nIf you want to send me on your character, I can take a look and we can start breaking it down to rig. If you want to get started in the meantime, you could look at these two lessons on the Toon Boom learn portal: <https:\/\/learn.toonboom.com\/modules\/layers3?c=14>\n<https:\/\/learn.toonboom.com\/modules\/creating-a-rig-model?c=14>\nin the rigging 1 module.\n\nHope you had a great Christmas and are enjoying your break! Happy New Year to you too! I'll be much better at being in touch from next week, when life is back to normal! Oh, and thank you so much for the lovely feedback on the Christmas short!!! :smile: So delighted you loved it! x",
        "ts": "1577730889.000100",
        "username": "Niki Kehoe (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-30\/891224896103_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "Vimeo",
                "service_url": "https:\/\/vimeo.com\/",
                "title": "Showreel_2017",
                "title_link": "https:\/\/vimeo.com\/219311568",
                "author_name": "Niki Kehoe",
                "author_link": "https:\/\/vimeo.com\/nikikehoe",
                "thumb_url": "https:\/\/i.vimeocdn.com\/video\/637029634_295x166.jpg",
                "thumb_width": 295,
                "thumb_height": 166,
                "text": "A sample of my work",
                "fallback": "Vimeo Video: Showreel_2017",
                "video_html": "<iframe src=\"https:\/\/player.vimeo.com\/video\/219311568?autoplay=1&amp;app_id=122963\" width=\"400\" height=\"225\" frameborder=\"0\" allow=\"autoplay; fullscreen\" allowfullscreen title=\"Showreel_2017\"><\/iframe>",
                "video_html_width": 400,
                "video_html_height": 225,
                "from_url": "https:\/\/vimeo.com\/219311568",
                "service_icon": "https:\/\/a.slack-edge.com\/80588\/img\/unfurl_icons\/vimeo.png",
                "id": 1,
                "original_url": "https:\/\/vimeo.com\/219311568"
            }
        ]
    }
]