[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hmm i think you can absoloutely always improve the reel etc.. but theres always an element of luck and opportunities. Definitely everything i swang past the modellers here they said you’re doing the right stuff and i’m sure with the feedback we discussed before you’ll make your next pieces even better. It sounds like modelling in particular is just quite tricky to crack into.\n\nI’ve found what can help as much as the art skills is making sure you’re a great part of the team too - and i’m sure you are! being reliable, enthusiastic etc.. is so important to building relationships and moving up in these companies too",
        "ts": "1575637356.001700",
        "username": "Craig Tonks (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-06\/851373918899_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi craig thanks for replying. Hope it's not busy for you. Currently I'm going to update my reel with telephone texturing and creating a small nice table scene as you suggested, just wondering if I should take a picture or not. And then I can move back on my helicopter as I'd love to finish it would look great and show my improvement. Ah that's nice to hear, I'm a shy person and worried with conflict as I'm getting to know modellers. But theres another guy already helping and I dont want to upset others if that makes sense. Yeah its tricky. Been trying to move up and hasnt been successful yet. But iv got a few months experience so its nice:)",
        "ts": "1575659491.001800",
        "username": "Angel Cano (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-06\/851955374227_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]