[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I'm a freelance compositor, I tend to work around the London studios across mainly TV\/Advertising. It sounds like production side would be a great route for you then. I understand you have mixed interests and production being a varied role may be the right way to go. Your artist knowledge and experience will also come in handy within a production role and is a desirable skill.",
        "ts": "1570181033.002500",
        "username": "Pedram Razi (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-04\/783751589525_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I think production is a very interesting role, if I had to pick another career I think i would also go into production as it is so varied and exciting. You get to be involved in the creation of a film from the beginning through to completion. With opportunities to work on set, recruitment, in VFX houses, agencies and working with directors\/supervisors.",
        "ts": "1570181224.002600",
        "username": "Pedram Razi (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-04\/770972686050_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "You did mention that you may be raising a family in the coming years and I also think production could be a good job to work while also maintaining family responsibilities. With a high representation of women in the production industry the understanding regarding parenting responsibilities should also be well established.",
        "ts": "1570181427.002700",
        "username": "Pedram Razi (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-04\/783289802116_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]