[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I see, (assuming you are rendering hd?). What are your render settings? Sometimes you can optimise by upping the sampling in your lights or textures as apposed to unified sampling. I find starting with basic settings and then troubleshooting what change is causing a jump in render times helps me.  Another thing to consider might be the textures, how long is it taking to process the scene before it actually is rendering. Do you use deadline or anything similar? Have a look at the documentation and creating an account is helpful if you want to access the forums. Also Adrian's and Saul Espinosa do some nice vids.",
        "ts": "1586686237.001000",
        "username": "Nina (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-12\/1067432775377_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thanks for the tips, yeah I had a look at some of Sauls videos but the main problem I’m having is the geometry is going out of core by a huge amount. In the feedback display it’s in the Terabytes which is causing the huge render times. I’m already using proxies so I’m unsure of what to do. ",
        "ts": "1586697860.001100",
        "username": "Charlie Adams (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-12\/1064126747828_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Is it possible to send over my render settings to see if you can spot what’s causing the huge spikes? I’ve turned off displacement and tessellation and that’s reduced render time massively but obviously this isn’t ideal. ",
        "ts": "1586704173.001200",
        "username": "Charlie Adams (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-12\/1057373203363_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]