[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I've been on a management training course all day today in our head office :+1::skin-tone-3:learning how to be a better manager and finding out how to manage my team members in the best way. Was really interesting it's the first of 4 days over a 4 months. Got to meet lots of other people from across the business too that I would never normally interact with - someone who decides what Xmas decorations we have to sell our customers each year, someone who helps stores prevent stock from being sold, someone who tests the durability of the clothes we sell - a tea mix of roles!",
        "ts": "1508429493.000242",
        "username": "sarah.armstrong113 (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-19\/259804315510_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Oo okay. To be totally honest I've never heard of someone that does that role but I guess it could be interpreted in lots of places in the business, such as for sales or marketing or one of the directors where you would talk on behalf of the business on those topics. ",
        "ts": "1508429599.000158",
        "username": "sarah.armstrong113 (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-19\/259805548038_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Talking to friends who have worked in corporate law and watching a bit of suits! Have you seen that ? I wouldn't say work life balance in corporate law would be particularly great to be honest :see_no_evil: a lot of its based around the client needs and deadlines and therefore when they want something you'd need to be very reactive. However they do earn lots of money :moneybag:!! So it depends if that would be a sacrifice you would want to make ",
        "ts": "1508429757.000022",
        "username": "sarah.armstrong113 (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-19\/258922708258_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Personally I'm all about having a good work life balance, I think it's really important - otherwise I know wouldn't be happy! Marketing isn't one of the best paid industries out there , mostly because it's quite a desirable role and a lot of people can go into that field. However my hours are quite good normally work 9-5\/5.30 maybe a bit later when we have big projects on",
        "ts": "1508429956.000043",
        "username": "sarah.armstrong113 (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-19\/259064320597_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Being marketing there is also normally a good social life :dancers:we tend to go out for drinks quite a lot - a lot of girls in marketing so always love a cocktail or too ha :tropical_drink:",
        "ts": "1508430016.000015",
        "username": "sarah.armstrong113 (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-19\/260011115351_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]