[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "no worries at all - more than happy to help - and have passed on your reel so will let you know what feedback they also gave!\n\nTbh it's something I enjoy doing, i love to learn so naturally I love trying a variety of things haha but yeh really was alot of fun! not all completely necessary but definitely definitely helped - especially as i started off a Rnner first for a couple of months.\n\nYeh I was there for a couple of years - i've always been an artist and wanted to do art but tbh there was a bit of pressure from my family to just keep it as a hobby and do a 'real job' haha, i was a bit younger then so didnt really do my own research or even know much about VFX or let alone there being an art department. Im a massive comic fan lol so when all the Marvel films started coming out I learned a bit more about how they were made and that inspired me to go back to uni.\n\nAmazing - this is definitely something im currently working on - I believe its so important. And congrats!! that must have been a big move! Its not an easy thing to do either! I used to live in Manchester! I did my undergrad at Manchester Uni =D",
        "ts": "1563202070.003000",
        "username": "Bimpe Alliu (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-15\/694335690260_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Have you been applying for places currently? the main thing is being able to get your foot in the foot - if you are applying for places are you also applying for runner positions? There may be a couple of runner spots opening up at Industrial Light and Magic where I work. If youre interested I can find out the details of how to apply etc!",
        "ts": "1563202184.003100",
        "username": "Bimpe Alliu (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-15\/694804334704_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "we also provide work experience - where you shadow the runners for a week but you also get to visit all the departments and talk to the artists in the company from the different disciplines - the waiting list is a little long, but I can talk to the person who co-ordinates it and see if they're still accepting people",
        "ts": "1563202261.003200",
        "username": "Bimpe Alliu (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-15\/683394940226_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]