[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Good morning Bimpe, \n\nI hope you had a great weekend! \n\nSo, I didn’t get the ATD positions from DNEG and Molinare. However, I spoke to Amy last Tuesday about me applying for the ATD Apprenticeship but she said i was too over qualified because of my degree. \n\nSo, she asked me what else I would be interested in doing at ILM. I told her that I’m still interested in Technical route, Runner p or Texturer\/Modeling position. Also, I gave her my CV and she said she will forward it to the Team :blush:",
        "ts": "1563784623.000300",
        "username": "Amber Chevelleau (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-22\/701102721588_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Oh yeah, I’ve taken your advice about my website and change things around. I’ve also started writing a blog about learning Python. I can see it looks a lot more consistent. So, Thank you :relaxed: ",
        "ts": "1563786439.000400",
        "username": "Amber Chevelleau (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-22\/701618280021_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Heya, I had a lovely weekend thanks! Hope you did too!\n\nAhh sorry to hear about that. Its great youre keeping in contact with Amy though. At this stage being a bit more specific about the department may be useful - but thats definitely not to say that you can't move around once youre in!\n\nAwesome, and just seen that youve updated our reel too so its more model \/ texture focused which will definitely be useful. Reels tend to get passed on to the relevant department leads so it needs to be clear what theyre looking at right away, so thats good! :slightly_smiling_face:",
        "ts": "1563825669.000500",
        "username": "Bimpe Alliu (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-22\/704223880967_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]