[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Bimpe, that’s would be amazing if you get some people to look at my website and some feedback on how I can break into the technical side? That’s would be amazing!! \n\nHow long have you been working as a Art Assistant? \nWhat do you do as a Art Assistant?",
        "ts": "1562678200.002400",
        "username": "Amber Chevelleau (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-09\/677437793763_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "great! will hopefully have some feedback for you soon!!\n\nOff the bat i would say there's no need for you to have all 3 reels from the last 3 years on your site. Ideally you'll want to have 1 dedicated reel with you best work - aim for quality over quantity :slightly_smiling_face: the only time you'll only really want different ones are if youre showcasing a different discipline. Hope that makes sense! do you have a modelling preference btw? as you currently have a mixture between a bit of hard surface \/ environment and character which is cool!",
        "ts": "1562708849.002500",
        "username": "Bimpe Alliu (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-09\/683132942769_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "for a couple of years, but have just been promoted to jr concept artist :slightly_smiling_face:\nI was in a different career about 5 years ago - I was working for Sony Music doing digital marketing and went back to uni for a year to learn about vfx and animation lol",
        "ts": "1562709037.002600",
        "username": "Bimpe Alliu (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-09\/689483237728_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "its a mixture of things really, some concept work, assisting with concept work and alot of general design work for the department and sometimes other department. im rather technical too which worked in my favour and turned out I was the only person in my department who knew how to do rigging and for a while a bit of basic coding!",
        "ts": "1562709120.002700",
        "username": "Bimpe Alliu (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-09\/678087211715_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "so its been an interesting journey haha and dexter sent over your info and when you mentioned about wanting to really promote \/ help women of colour in VFX I was really happy to read that as thats something i'm currently trying to do",
        "ts": "1562709200.002800",
        "username": "Bimpe Alliu (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-09\/689498751509_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]