[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yeup I already know about them. I've been going to their events for a while now along with events from ACM Siggraph. I do need to listen to their podcasts and all",
        "ts": "1577205479.000100",
        "username": "Andrew Jara (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-24\/873983002451_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Another thing I would like to ask your opinion on. Pretty soon I will start my specialising in my foundation course. I have several options and I am not sure on where I should go. I ask considering my ambitions to get into 3D animation (nothing specific) which route would you say that I should take? \n- Fine Art: here I can focus on painting and drawing being able to understand more about the human figure, posing and anatomy. Being able to understand colour and lighting. Perspective drawing to the point where I can make my own locations and concept art. I would have a project where I paint a series of oil paintings involving locations and people under a common theme. \n- Illustration: here I can focus on designing characters and objects. Learn aspects like perspective and begin digital painting on Procreate (iPad). This could also be a chance to learn some storytelling skills as a project for this could be making a short comic (manga-like) that involves all of these elements. \n- Animation: here I can focus on animation and timing. I had the idea on working on a project that combines stop motion animation in real life with settings and effects made in Maya. I choose this because I want to learn animation before I learn maya properly.",
        "ts": "1577206160.000200",
        "username": "Andrew Jara (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-24\/885467783109_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "There is some overlap but what I mention will be prioritised over others (for example, fine art can still involve making characters but it won't be the main focus). I hope to hear your opinion as it does have a lot of value considering that you are a professional animator.",
        "ts": "1577206337.000300",
        "username": "Andrew Jara (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-24\/885459801408_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]