[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Lucy! So sorry for my delay. Needed a minute to get things sorted before I could add something to my plate. Was moving house (:face_with_rolling_eyes:). But I’m here now and will help however I can!! \n\nA little about me - I’ve been in an unusual amount of different kinds of live action production for the past 15 years. I started as freelance on commercials in LA. I got a couple tips of folks working there and moved out right after college (from the St. Louis area). Commercials are great for me because they’re short term projects and then you’re on to something new. I did a few indie features while I was out there too, which are interesting from a narrative \/ shooting out of order perspective but overall the project lengths are grueling for me. And the money isn’t as good as features. :relaxed:\nI then left LA and ended up in reality TV a for a couple years in the Wash, DC area, then client-side working for the marketing dept at Discovery networks. I did on-air promos (I call them commercials without the big budgets) there for 3 years. \nThen I moved to Chicago and worked at two major ad agencies as a business manager for live action and then I ran a small in house post studio. Now I’m at The Mill Chicago and have been here since March. We’re a VFX house (London based!) but I am the live action producer. I do a lot of VFX element shoots for the pieces that come together in CG or design. I can share a great example of recent work next week. It’s a beaut. :relaxed:\n\nCan you remind me what you graduated in and where? Have you worked on any productions that are current experience, and in what role if so? Living in London area? \nDo you know what kind of producing you want to do (live action \/ post \/ VFX)? \n\nAbout me- I have a pug \/ jack Russell mix who is my heart, I don’t have a lot of hobbies other than travel, but I do pretty well at that - been to 6 continents and want to hit Antarctica someday. :earth_americas:\n\nI’m actually at the airport right now on my way to Toronto for a pre-production meeting (PPM) for a shoot next week. I’m not a morning person but figured this was a good time to finally connect. Chat soon!",
        "ts": "1573211683.001900",
        "username": "Darci D (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-08\/815475594211_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]