[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "No worries! I've done it too. \nYeah still a bit of moving crazyniess going on but at least we got the internet set up now haha. \nOh well that sounds great! To be honest I think that getting your foot in the industry is the hardest part of your journey, so that's very well done. \nAnd yeah I do understand where you're coming from regarding the kids show. But I do think that you don't have to worry too much about it. It will still show your skills and that you're capable even if it's not flashy. \nBut what I did to build my real is just volunteering a lot. I went to film school first so had a lot of friends doing projects that needed some shots done. The differnece in those shots gave my reel some variety. \nSo maybe reach out to some schools or independent filmmaker and ask if they need a hand in a shot or two. Creative passion projects are also a great way to get some original work in there. \nBut if you cant do that just search for some shots on Shutterstock \/ videvo or wherever you can get royalty free footage and work on those. That's what I me and lots of my friends did when we were looking for internships at uni. \nAfter that it's just a stepping stone, the further you get the more high profile stuff you're gonna get to work on and then have in your reel.",
        "ts": "1566311132.002200",
        "username": "Felicia Petersen (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-20\/734399293158_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yeah I was thinking so doing the same RE offering to help out on shorts, student films etc, also just shooting some stuff on a green screen to play with. Ive stockpiled a bunch of tutorials from pluralsight and FXPHD over the last while and never got much time to go through them because I travel back to Dublin on weekends. So I plan to spend the next 6 months getting stuck into those to improve familiarise myself with areas I've not had much experience with. Would you mind if I sent you the odd pipeline to get feedback on how your improve or what your approach to a particular shot would be?",
        "ts": "1566348019.002300",
        "username": "Shane Browne (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-20\/732467208036_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]