[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thanks for sending that over, I'm definitely interested in some aspects of the role. My school runs work experience from the 6th-17th July 2020. I need to find a placement asap. I want this placement to be in something I would like to work in, in the future. Also, I need to gain as many transferable skills to help with my apprenticeship applications from the end of next year. HR would be a good opportunity for me to see how the business works. I would like to get a placement in a creative sector employer. Do you think Framestore London would offer someone like myself a work experience placement?",
        "ts": "1571575639.002900",
        "username": "Caitlin Purser (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-20\/802062912869_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I’m also going to start working on my CV today, would you mind looking over it and making any suggestions once I’ve done it.",
        "ts": "1571578804.003000",
        "username": "Caitlin Purser (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-20\/795635301857_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "How long is the placement for? I think Framestore London does 1 day observation internships. I can definitely ask more info on that. Is that the same thing? \nI’m sorry, I lack knowledge on the UK system! \nOf course send me your CV when it’s ready. I’m very impressed you’re aware and conscious of transferable skills.",
        "ts": "1571612000.003100",
        "username": "Samia Paradis (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-20\/790782529331_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Don’t put too much pressure on yourself if the internship isn’t exactly what you had hoped for. Mine was a week long when I was 15 and was in a company that rents material for shows lighting. I wanted to work in venues and control lighting. ",
        "ts": "1571612068.003200",
        "username": "Samia Paradis (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-20\/790782894531_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "And my first apprentice job was in what turned out to be the worst work environment possible for me. I’m happy I experimented it though because it’s helped me figure out what I really want. All experience will bring you closer to what you really want :) ",
        "ts": "1571612152.003300",
        "username": "Samia Paradis (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-20\/802253967280_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]