[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Mark! Hope you had a great Easter! How are you? I've done a little bit of work, some general plans and materials for my pre production document. \n\nI have a general question regarding industry methods, so with my materials I've played with substance alchemist and quixel mixer, alchemist to make my own materials from photographs or software defaults. In mixer I used other people's materials and layered them in such a way to make my own material. What's the method I should be using more for industry as an environment artist? If you'd like to see my work so far here's the link:   <https:\/\/www.3dhit.co.uk\/forums\/topic\/30217-michael-woods-masters-thread\/page\/4\/?tab=comments#comment-370331|https:\/\/www.3dhit.co.uk\/forums\/topic\/30217-michael-woods-masters-thread\/page\/4\/?tab=comments#comment-370331>\n\nAnother pickle I'm in is that for my major project I want to create a medieval town environment with the castle looming in the background. Giving me practise with outdoor environments. In portfolio work do people mind if you use other people's concept arts as the main influence or should I try create my own concepts as much as possible?",
        "ts": "1586863335.002400",
        "username": "michael w 94 (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-14\/1083983479184_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "In reality you should use whatever gives you the best and\/or fastest results.\nKnowing a few different ways to go about this is always an advantage and you can then confidently discuss why you chose one way rather than another.",
        "ts": "1586876362.002500",
        "username": "mistermarkflanagan (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-14\/1073940611137_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "If you are using other peoples concepts for your environments that is usually not a problem. (Normally in industry this is how things are done)\nI would however try to get permission and ALWAYS give credit.\nThe industry is very small and someone who you show the work to will likely know the original artist or source material",
        "ts": "1586876494.002600",
        "username": "mistermarkflanagan (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-14\/1047251691863_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]