[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Katie! Thanks so much for this wonderful feedback! Sorry for a quite late response as this semester is going to an end and there are a lot of assignments to submit but I'm almost finished with them so woohoo!! I'm going to send you what I've done so far soon, so you can see what I've been up to.:)\n\nAbout the positions - isn't Creature FX mostly rigging and simulations related\/orientated? I'm afraid that's not really what I'd want to do but I'll definitely try to apply for a modeler position in Framestore! I'm really curious what would they want to see and in what way is it best to present models - both organic and hard-surface. Do you know who I could contact to ask these questions? I'm currently working on the deer and monkey models that I've sent you and would love to have them as pieces for my reel. Can't really decide what I should do for a hard-surface one - I thought maybe an old typewriter or old vintage telephone but both of these would look impressive only if well textured. I'm saying this because when I talked to Amy Smith - Head of Talent in Framestore - when she was visiting our university around a month ago, she said that if I apply for a modelling internship they're just really interested in the models themselves, so gray models are absolutely fine. So, I'm not sure of how complicated the model should be.\n\nI'd love if you could help me with research and contacts! That would be incredible:))\n\nThanks so much for the great feedback and advice on the CV and cover letter! Will go through it and improve it soon after next Wednesday (my last deadline :D). Going to send you once updated. I currently don't have portfolio website but would definitely want to make one! I'm also in a process of putting my show-reel together.\n\nThanks for providing your CV, it's incredible how it has changed throughout the years, this year's one is very impressive, so many great projects! I've been watching His Dark Materials recently and it's such a cool show, ah would love to work on it.. Also, a question about CV design - how important do you think it is? I guess as long as it's clear and well-arranged, it's all that matters?\n\nAnd just wanted to let you know how much I appreciate your informative and helpful answers and replies, I feel very lucky to have you as my mentor!! :sparkles: :four_leaf_clover:",
        "ts": "1576021736.022400",
        "username": "Paulina Rybakaite (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-10\/870411132374_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Just noticed that I missed one point. Yes - you're right, running is very intense from what I've read online, so probably not going to apply during this Christmas break as I'm going to Lithuania for holidays and I feel like I really need some rest after this quite stressful semester. I just heard that there are short running contracts (like in the Mill), so I thought it could be a good first step to get into industry but will definitely think of all of the problems and difficulties before actually applying.",
        "ts": "1576022424.022500",
        "username": "Paulina Rybakaite (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-10\/870424698614_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Maybe you have any suggestions of how I could make my first steps into industry before applying for a summer internship or do you think I should just concentrate on getting the internship?",
        "ts": "1576022928.022600",
        "username": "Paulina Rybakaite (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-10\/870435153366_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]