[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Paulina, it's a pleasure to e-meet you! :wave:",
        "ts": "1566994833.000100",
        "username": "Katie (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-28\/734558745729_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thank you for your introduction, I hope you enjoyed your first year at Uni?\nI also went to an art school after high school - I was really glad I got to explore art in that way before going to University and having to specialise and learn 3D etc! I hope you found it useful too?\nSounds like you already have a great grasp of 3D, well done on getting into ZBrush and Nuke! It seems to me that a lot of students at your stage don't branch out so soon, so kudos to you!\nYour vimeo reel is very impressive - I know you have expressed that you want to get into CFX, but your hard surface modelling is also very good!! :trophy:",
        "ts": "1566994846.000200",
        "username": "Katie (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-28\/740946686869_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I can absolutely help you with Creatures. I currently work as a Creature FX artist at Framestore, some of the shows I have worked on include; 'His Dark Materials', 'Lady &amp; the Tramp', ''Detective Pikachu' and 'Christopher Robin'. On a day-to-day basis we work with simulation rigs for hair\/fur\/cloth\/fat\/skin\/muscle etc. We also do shot-sculpting and tech fixes for all those in-between stages as models get passed through the VFX pipeline.",
        "ts": "1566994854.000300",
        "username": "Katie (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-28\/743125740726_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Personally, I can give you an insight into our working practices and I can share anything you'd like to know about how I got here.\nIf you'd like; I can also introduce you to some of my industry contacts you might want to connect with, and I can give you some critique\/guidance for your portfolio and CV. :memo:",
        "ts": "1566994868.000400",
        "username": "Katie (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-28\/742806604839_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Just to let you know; I'm currently on my last week at Framestore and I'll be starting work with a games studio as a Concept Artist from September 2nd. Concept Art is my real passion and something I did as a freelancer for a few years both in VFX and Games industries.\nSo I hope you are not disappointed I will no longer be a CFX artist - I will still try my best to answer your questions!",
        "ts": "1566994882.000500",
        "username": "Katie (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-28\/740475330564_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "This also means I am going to be quite busy with relocating and changing over jobs - so for the next couple of days I thought it might be helpful for both of us if you could have a think about what you would like to get out of the mentorship and how you might want it to work alongside your studies.\nThen just send me a message on here with what you're planning and we can take it from there! :raised_hands:",
        "ts": "1566994895.000600",
        "username": "Katie (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-28\/729493075618_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hope this all sounds good with you, I look forward to hearing from you! :blush:",
        "ts": "1566994906.000700",
        "username": "Katie (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-28\/729496965059_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Katie!\nI’m very happy to hear back from you! I can’t express how excited I’m right now!:’)\nMy first year at the uni was great, it was very stressful especially at the beginning because of a new environment, language and quite heavy workload but I’m very happy with my choice, I feel like went through a quite big improvement not only skills wise but also personally. I met a lot of cool people here and made great friends.\nThe experience that I gained from studying in an arts school is extremely useful now, it helps to pay more attention to aspects like composition, contrast, balance, colours interaction and etc. I think that drawing classes were super helpful to train my eye and pay more attention to details when it comes to the polishing stage.\nI’m mostly concentrating onto ZBrush at the moment. I’ve recently started working on two creatures for personal and group projects of which the latter one is a second year short VFX film; I did a fairly simple compositing exercise in Nuke, nothing special but still a useful experience. I’d really like to dive more into Mari and Houdini soon though.\nThanks a lot for your compliments! It really means a lot to me. :))\nAgain, I’m going to repeat it but I feel super happy and honoured to have you as my mentor. I love creatures and I can’t wait to get better at making them. It’s very impressive that you worked on such big shows, I looked at your IMDb before and I was amazed by the list.\nI’d be more than happy to hear about your personal experience - how you got started at Framestore and what the environment is like in there. As I mentioned before, I’m very interested in CFX, especially fat, skin and muscle sim. Do you use Houdini for that in Framestore?\nI’d love if you could introduce me to your industry contacts and I’d be super grateful for your critique and guidance on my portfolio and CV!!:)\nAnd don’t worry, I’m not disappointed at all that you won’t be a CFX artist anymore, in fact I’m very happy for you, I saw your concept art pieces and they are absolutely stunning! Hope it’s going to go very well for you!:)\nI totally agree with you on having some time to think about what I’d like to get out of this mentorship and how I’d manage having it alongside my studies at the university. I’m going to let you know in couple of days about my decisions on it.\nThis all sounds very amazing!! Thanks a lot, Katie!:&gt;",
        "ts": "1567005009.000800",
        "username": "Paulina Rybakaite (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-28\/729731184771_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]