[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Katie!\n\nHope you're doing well!:)\n\nSorry that it took me longer to clarify on what I've decided. I was moving into a new place recently, so had plenty of things to sort out.\n\nMy second year will start on 30th of September, so I still have some spare time until then but I think that when it starts I could send you my progress on works for feedback and ask you questions\/advice when I run into problems. When I'm sure on what modules I'll have and what briefs I need to do, I could update you on that, so it would be clearer on what kind of schedule I'll have but I believe that I will manage to keep you posted with my work regularly (hopefully every week). I'm interested to known what are your thoughts on it, let me know what would you prefer.\n\nIn the second year on top of all the briefs we need to do we also have a group project (on which we have semester B - after Christmas holidays). My groupmates and I have already started working on it this summer because we came up with a quite ambitious idea. We already decided who's responsible for what, so covered the whole pipeline parts. I'm going to work on modelling, texturing, lookdev, lighting and grading parts - so going to work almost throughout the whole pipeline.\n\nWe're aiming to make a short VFX film about a magician monkey (live-action with the CG monkey implementation). The monkey would be doing few magic tricks, we're not 100% sure if it's really going to be about that, the idea might change quite a lot but we're sure that we want to do a White-faced Capuchin monkey. I've already started working on the model at the end of July.\n\nI'm almost done with the skeleton (went to the Grant Museum of Zoology to take reference images for the exact skeleton), now focusing on the skin layer. We're planning to do the muscles in Houdini and sim them there. In our team we have a CFX and rigging artist but I'm still going to try rigging the monkey and doing muscle sim in Houdini, so I think I'm going to have plenty questions on that.:D\n\nIf you're interested in what I've done so far with the model and maybe would be able to give me some feedback on it, let me know and I'll share some snips of the current version!:)\n\nAlongside the project I hope to work on a personal project. I've started working on a stylised lioness sculpt several weeks ago but left it for now as I prioritise the project.\n\nI'm very eager to learn and improve my skills, so I strongly believe that this mentorship would be a great opportunity to push myself even more. I hope that I'll be able to have a strong showreel at the end of my second year as getting an internship is one of my main goals at the moment.:')\n\nI've already asked a few questions in my previous message relating your experience and software, so I don't want to spam you with bunch of questions all at once as I understand that you probably have a very busy schedule!\n\nLooking forward to hearing from you soon, Katie!:))\n\nPaulina",
        "ts": "1567733753.000900",
        "username": "Paulina Rybakaite (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-05\/750782141653_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]