[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I spoke to my neighbour who lectures in criminology. She said that there are basically three tracks if you want to directly use a criminology degree. The first is academia - doing the research that informs criminology, teaching etc. The second is the criminal justice system - so the police, probation service or working with criminals in the prison system. The third is very interesting - working with ex-criminals or at risk groups. So there might be youth support work in areas where there is a high youth crime rate - helping them avoid criminal activity. Or working with ex offenders in the public environment rather than prison system. Or working with at risk groups - drug\/alcohol abuser, women suffering from domestic violence, trafficked women etc. Or it might involve working for organisations seeking alternative forms of justice or supporting people in the court system - charities may help write briefs or papers informing judges etc about the criminological background to a case. If you want to spend an extra year or two qualifying, becoming a social worker is also an option. Finally, there are services around helping witnesses that might be interesting.",
        "ts": "1508147174.000079",
        "username": "christian.jeffery (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-16\/256839096916_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Her main piece of advice was to volunteer - there are lots of charities dealing with this sort of thing, it may also be possible to volunteer directly in the justice system. Think of the issues that you are most concerned by - it might be helping prevent youngsters offending. Then find a charity that deals with that issue and get in touch with them and offer your time.",
        "ts": "1508147245.000231",
        "username": "christian.jeffery (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-16\/256785653938_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "It sounds like there are lots of options out there, it;s just a question of finding the one that motivates you",
        "ts": "1508147273.000020",
        "username": "christian.jeffery (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-16\/256268365985_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Okay thank you for the information ",
        "ts": "1508173371.000665",
        "username": "kurwinderkaur15 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-16\/256956760243_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I will look at the different options and do more research upon these options ",
        "ts": "1508173432.000392",
        "username": "kurwinderkaur15 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-16\/257033022578_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]