[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey sorry for the late reply , that sounds so cool! I’m currently working on a reel as well as working on projects in uni it’s quite hard to balance the two :sweat_smile: but I will definitely get round to doing this ",
        "ts": "1580511195.000300",
        "username": "Mariam Hussein (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-31\/919177229474_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I’m interesting in 3D modelling however I want to specialise in creature modelling and texturing, I’ve been looking for junior\/generalist roles and I’m finding it hard to find something out there for me as I’m a student and iv seen requirements for senior roles, I was wondering if you help me with this.\n",
        "ts": "1580511424.000400",
        "username": "Mariam Hussein (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-31\/931969098480_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yeah for sure, getting that first job as a junior artist can be hard. \n\nMy first job was because the company reached out to my school and I had my reel ready for them to see. I got lucky that they were willing to hire junior artists. Every job I've gotten since then has basically been from other people I've meet in the industry. \n\nMy advice would be to be open to any opportunity. Even if it's something like modeling props or hardsurface stuff you will meet people as soon as you start that job that can get you where you want to go after that. Apply to any job that doesn't specify senior. Companies are willing to take chances if they need aritsts and are close to a deadline. \n\nIf you'd like to share your reel with me I'd be glad to give any advice I can on that. \n\nAlso where are you located and are you willong to relocate for a job?",
        "ts": "1580512530.000500",
        "username": "Katie Rosso (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-31\/934200158742_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]