[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey, oh nice, enjoy your break! I'm off to Spain in the morning with my better half to see her family :] For me personally, I think I am a more technically minded person so I try to focus on artistry whenever I can, mainly looking at colour theory and composition (I wish I'd have studied more cinematography). My technical skills develop more naturally, as I'm the kind of person to try and solve an issue before passing it on to another department. I do feel it's the norm for light\/comp to have somewhat of a balance, as seems to be the nature of post artists - but here there are a good mix of naturally artistic and naturally technical. I like that term - tool-agnostic - haha! The more the better really, it won't lose points - and keeping up with industry trends is a good way to get an edge, even if you can only say you've had a mess around with a certain tool that they're using. At the same time I suppose it's important not to spread yourself too thin, as a long list of software on a CV can be a bit off-putting, personally. I don't believe anyone here uses flame, it's pretty much all Nuke compositing. As far as stopmotion I'm not going to be able to be much help until the new year sadly, but I'll have an ask around for you! They've played around with it here, Mamoon was somewhat I think but everyone from it has already left for the holidays!",
        "ts": "1545327425.000400",
        "username": "Steven (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-20\/509368143141_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Cool, enjoy Spain as much as possible and have fun. If you don't mind asking around when you get back that will be awesome! Maybe by the end of the holidays I'll will have refined my showreel to ask your opinion if you don't mind. For the moment have a nice one!",
        "ts": "1545336834.000500",
        "username": "Nicola (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-20\/509320960322_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]