[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Ye it's pretty cheap compared with other programs. And I don't really see any difference. Just limited revenue and your file names are .hiplc",
        "ts": "1586771228.002400",
        "username": "Tariq Samir Kinani (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-13\/1064951789316_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I doubt you'll be making $100k in a year :wink: and if you're happy to have .hiplc then indie seems the ideal choice!\nIs there anything you'd like help with, or advice on? Houdini\/work wise? Feel like I've not given you much advice lately! You're doing really well with the freelance jobs and tutorial stuff!",
        "ts": "1586782765.002500",
        "username": "Thomas Thornton (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-13\/1057774023442_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thanks a lot! Well I've had a lot of help from yourself and a few others. And just plain luck as well to be honest! I would like to get into a studio though. I wanna work on Tom Hanks films too! As for advice I can't think of anything right now as everything seems to be slowing down for me. I'm gonna revisit those destro sims soon so I'll definitely need help then!",
        "ts": "1586809717.002600",
        "username": "Tariq Samir Kinani (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-13\/1059036024642_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "No problems! Sometimes it is just luck. My first runner job was luck, and then this job in Bournemouth was mainly from who I knew as well.\nHave you done yourself a new showreel yet? As that might be good to start plotting out what you want to put into it, and putting a space\/temp plate in for the destruction sims, so as soon as they're done, you have a showreel ready to go? And then you can start getting feedback on the stuff that's already in the showreel while you're working on the other sims?",
        "ts": "1586844651.002700",
        "username": "Thomas Thornton (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-13\/1066864110372_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]