[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Same for me really, I assume I'm here to help with general industry info and any technical bits I can. Basically shoot me any questions and I'll try to answer &amp; if I can't then hopefully we can get you looking in the right direction. Your interests are similar to what I do though (Houdini &amp; Live AV) so we're off to a good start!",
        "ts": "1570614506.000100",
        "username": "Daniel Radford (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/777485938339_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I started getting into film back in school and liked to photoshop things, eventually moving onto after effects to blend the two hobbies. In the early years I was making a lot of skateboarding \/ bmx videos with friends, adding awful effects and filters all over the place. I guess that gave good grounds for camera movements and general editing. During college I got into Cinema 4D and started making short minecraft animation skits, everything was nice and square so a fairly easy starting point. This led on to getting a contract with the Youtube channel Machinima, to make more animations under their name. Then at uni I originally learned web design (which was awful), but I suppose that gave a good foundation for coding.",
        "ts": "1570615088.000200",
        "username": "Daniel Radford (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/782543884225_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "While doing the undergrad degree I was working a lot of late nights doing these minecraft animations, seeing as the community was mostly american I'd be up late talking to those guys and teaching C4D basics, this helped me pick up an intern position at a local studio making VR games in unreal engine. At the end of the 3 years of web design I decided it wasn't for me and applied to the Digital FX masters at Bournemouth uni, knuckled down for the year and learned Houdini &amp; Nuke while also terminating my Youtube contract. Applied for a bunch of jobs in Bristol and now here I am 2 years later still working at Moonraker doing all the sim work.",
        "ts": "1570615430.000300",
        "username": "Daniel Radford (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/777501757347_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Not quite sure how to answer the why not a different specialization bit, I think the FX part is what I enjoy most and everything kinda clicks. Modelling \/ rigging sounds like a huge headache &amp; I never was all that great at wrangling keyframes for animation aha",
        "ts": "1570615777.000400",
        "username": "Daniel Radford (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/776209479010_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "So whereabouts are you on your journey and what makes you want to switch over to become an FX TD?",
        "ts": "1570615855.000500",
        "username": "Daniel Radford (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/788996082992_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "To be honest, I didn't really know for a while that there was a term for it - Live AV, I thought it just fell under the Projection Mapping Umbrella.",
        "ts": "1570619367.000600",
        "username": "Mika (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/782609664113_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I was always into films and figured out the thing I liked most about them were the FX - I just of course had no idea of the terminologies back them..\nOne thing led to the other and I started taking art classes in school and looking at uni's I found the Digital FX MA at BU which summed up exactly what I wanted to do _but_ it was an MA _not_ a BA and the closest BA to that was Computer Visualization Animation..  Basically I chose my BA based on what I wanted to study as an MA which is retrospectively quite backwards.",
        "ts": "1570620005.000700",
        "username": "Mika (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/776272524914_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Unfortunately during my time there they changed the course a bit and it was mostly programming and maths instead of software.. I didn't have enough coverage to understand what specialization I should follow and I wasn't enjoying the _just maths and programming_ content (perhaps cause I had a gap in my knowledge from school e.g. I hadn't taken advanced math) and I struggled a bit. I applied for the MA DFX but they didn't accept me, I took a year out to get better and re-apply the following year.... but I suppose at some point I felt like it might not be worth it as I needed the financial security.. I stereotypically moved to London, got a job as a waitress and did a couple courses to get some more software and filmmaking experience :slightly_smiling_face: - which was all good but if you worked in customer service - it sucks - so just had to get a full-time job asap :smile:",
        "ts": "1570620499.000800",
        "username": "Mika (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/777577418595_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I was at Escape at the time finishing off a part time comp course, I hit it off with the Sales Rep and next thing I knew I was interviewing for a Student Recruitment job which was amazing on paper! I could do their courses, go the festivals and use the machines after hours to buid my reel.. I had applied for runner positions etc but hadn't heard back and in the meantime I got that job which was great. It didn't exactly work out though, I ended up doing 2 roles and working evenings and was about to start weekends. It was a full Sales position with no time for any portfolio work (and not a Sales person salary). I had seen an opening at Foundry (I wasn't fully qualified for) but my situation pushed me to apply and it worked out :slightly_smiling_face:",
        "ts": "1570621205.000900",
        "username": "Mika (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/789074101669_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I've been here since.. I got promoted to Senior at the beginning of the year which was great! I've been trying in the meantime to get back on the horse whilst also trying to get in via the ATD route. I had an offer from Framestore but the guy leaving decided to stay so they didn't have the role anymore.  At the moment I'm doing an Abstract FX tutorial series to have smaller projects as goals that I can work on..",
        "ts": "1570621471.001000",
        "username": "Mika (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/791281668774_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Ah nice, I definitely feel for you on the BA changing and not really being as advertised, seems like they do that a lot",
        "ts": "1570624638.001100",
        "username": "Daniel Radford (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/789137581264_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "So what's your current position at The Foundry? Sounds like you're in the right area for what you want to do",
        "ts": "1570624925.001200",
        "username": "Daniel Radford (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/782704396865_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yeah :disappointed: It's quite sad that as a student it doesn't really occur to you that you have 'rights' as if you are a consumer.. since you are paying for that degree and for that education if it's not as advertised you should have the same rights as you do with purchasing an item cause you are technically a consumer - just of education? But maybe that's cynical",
        "ts": "1570626769.001300",
        "username": "Mika (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/789183648517_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I work for the Nuke team as a Quality assurance Engineer - basically software testing. It was nice for a while but I've learned all I could.. and now I mainly do admin as a sernior.. I've been told I'd get Python training but I'm not holding my breath cause it's been over a year so I just keep pushing for it. I figured it could help me with some things in Houdini to have that extra ground.",
        "ts": "1570626888.001400",
        "username": "Mika (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/789188188240_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "It's been feeling for a few years that I'm looking at the window of a bakery shop.. and I just _can't_ get in the bakery - if that makes sense",
        "ts": "1570626943.001500",
        "username": "Mika (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/777702190099_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Absolutely, that seems to be a running theme with a lot of London based VFX. I've heard all the horror stories of runners being worked to the bone and then not being offered anything at the end of the contract \/ internship. It seems as though there's a constant influx of juniors ready to pick up and do a lot of the heavy lifting on jobs. Which from a business standpoint is great for these bigger studios, but awful for the industry",
        "ts": "1570627929.001600",
        "username": "Daniel Radford (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/776429249170_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That's part of the reason I chose to search in Bristol instead, we have a slow pace here and I was valued as a team member from day 1",
        "ts": "1570628019.001700",
        "username": "Daniel Radford (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/777729553523_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Unfortunately I wouldn't count on any company for training or trust for position moves, it's more the case that you learn a new skill on your own time then bring it into the work pipeline, making it something they need.",
        "ts": "1570628226.001800",
        "username": "Daniel Radford (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/791071968391_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Exactly! I was okay doing the runner job cause I was a waitress at the time.. it was basically the same for me :smile: - but it's not the most reliable like you said.. some friends at the time were given sort of 'back-up runner' positions, so they had to be available to drop everything and go and support them but.. weren't full time which was awkward for them to have a different job at the same time :disappointed:",
        "ts": "1570628483.001900",
        "username": "Mika (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/791078500599_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Due to your position at the foundry you might have more luck than the average graduate in finding an FX based job, but it seems as though the bar is set so high there as they can pick and choose from so many applicants. If you're all for the busy London lifestyle I'd say go ahead but generally I advise people to look for small studios elsewhere, or at least small London studios and not the big players. Experience being a key member to a small team is far better than being a small cog in a big machine &amp; far more satisfying, although that's just my opinion aha",
        "ts": "1570628514.002000",
        "username": "Daniel Radford (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/788758336820_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yeah they don't really give you much respect as a runner, can't imagine the stress it must cause",
        "ts": "1570628574.002100",
        "username": "Daniel Radford (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/791432705174_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Either way though, I hadn't gotten any - actually one company rejected me after 6 months which was unnecessary - if I hadn't heard back from you at all to the point that I forgot I applied.. don't worry I know I didn't get it.. no reason for you to email me about it :smile:",
        "ts": "1570628585.002200",
        "username": "Mika (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/789229695413_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Oof, that's a kick in the teeth right there",
        "ts": "1570628647.002300",
        "username": "Daniel Radford (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/776447719010_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "pretty much!",
        "ts": "1570628676.002400",
        "username": "Mika (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/789232026613_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I had Rockstar games reply a year after my application, bit late, already found something",
        "ts": "1570628694.002500",
        "username": "Daniel Radford (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/789232554389_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I have the same mentality with the smaller studios.. but it's a bit hard to get the timing right.. .. they don't always advertise their roles.. they might just post it on linkedin or go via a recruiter.. I have a spreadsheet with the companies based in London but the smaller ones don't even have a careers page :disappointed:",
        "ts": "1570628748.002600",
        "username": "Mika (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/791085546871_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Bah that sucks!",
        "ts": "1570628755.002700",
        "username": "Mika (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/791437537798_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Smaller studios seem to run on a community of freelancers that rotate around, which makes it hard to get a foot in the door as they'll usually go for someone they've had before over someone new",
        "ts": "1570629448.002800",
        "username": "Daniel Radford (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/782815583553_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "What sort of level are you at with Houdini, do you have a portfolio I could check out?",
        "ts": "1570629601.002900",
        "username": "Daniel Radford (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/776473852194_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Unfortunately - I'm still beginner... the only things I have online are from my outdated website: <http:\/\/mikachara.com\/work\/>\nI'm very much aware it's bad (not being harsh to myself, just very pragmatic). So I am working on stuff now but I don't have anything finished yet",
        "ts": "1570629995.003000",
        "username": "Mika (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/791473191910_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Nice website you've got there",
        "ts": "1570631936.003100",
        "username": "Daniel Radford (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/789325338837_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Getting bits finished is tricky I know, especially enough good quality stuff to fill up a reel",
        "ts": "1570631973.003200",
        "username": "Daniel Radford (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/788856663668_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yeah.. at the moment I'm just trying to have one thing that's really good rather than many things",
        "ts": "1570637692.003300",
        "username": "Mika (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-09\/789025913940_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]