[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Anthony, hope you had a nice time off. That is a good point if you could help me create a good show-reel that would be a massive help. I heard from recruiters that simple is the best, alway show the references you used , less but done well is better than too much with flaws. But I also want to show some personality and don't do the usual boat on the sea. I had a reel that I made ages ago, not sure if you have seen this already <https:\/\/vimeo.com\/351444915> it's not very good and I'm not proud of it at all, quality is cheap and it's mostly random stuff and experiments using Houdini, more than a focused fx reel. So I would never show this if I wanted to apply for a fx position. That's why I wanted to start with some new projects that I could had on a new reel. What do you think?",
        "ts": "1586861917.002900",
        "username": "Isabella Ippolito (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-14\/1061152034339_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "Vimeo",
                "service_url": "https:\/\/vimeo.com\/",
                "title": "Houdini Reel 2019",
                "title_link": "https:\/\/vimeo.com\/351444915",
                "author_name": "Isabella",
                "author_link": "https:\/\/vimeo.com\/bellaisa",
                "thumb_url": "https:\/\/i.vimeocdn.com\/video\/803037779_295x166.jpg",
                "thumb_width": 295,
                "thumb_height": 166,
                "fallback": "Vimeo Video: Houdini Reel 2019",
                "video_html": "<iframe src=\"https:\/\/player.vimeo.com\/video\/351444915?autoplay=1&amp;app_id=122963\" width=\"400\" height=\"225\" frameborder=\"0\" allow=\"autoplay; fullscreen\" allowfullscreen title=\"Houdini Reel 2019\"><\/iframe>",
                "video_html_width": 400,
                "video_html_height": 225,
                "from_url": "https:\/\/vimeo.com\/351444915",
                "service_icon": "https:\/\/a.slack-edge.com\/80588\/img\/unfurl_icons\/vimeo.png",
                "id": 1,
                "original_url": "https:\/\/vimeo.com\/351444915"
            }
        ],
        "edited": {
            "user": "B6CS60LDU",
            "ts": "1586861918.000000"
        }
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I think that you are on point.\nI took the liberty to watch other videos on your channel, there are some interesting experiments that could complement a more traditional showreel to make it personal.\nBy more traditional, I mean some examples of classic FX required in a studio life (bullet sim, smoke sim, particles, etc)\nDoing a full project alone is difficult. a good idea is generally to focus on a simple effect and cut the rest out (a simple grayscale render with 2 lights can have a better look than a no so good version of the same thing with weak shaders)\nLet say you want to work on some pyro effect: doing a smoke grenade is simple, yet complicated enough to keep you busy and show you are able to tackle a real life situation (a movie has a shot with a smoke grenade).  It allows to work on fluid dynamics but purposefully put the combustion part aside and makes it a bit simpler than a full explosion for example\nWe generally start by gathering references. In my example of a smoke grenade that would be going on youtube and try to find material to see how it behaves, what's the dynamic and all before jumping within houdini.\nCan we try to find a subject you'd be interested to work on? better to start with something you're curious first to push further :slightly_smiling_face:",
        "ts": "1586874774.003100",
        "username": "anthony (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-14\/1067759999508_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]