[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi,\n\nHere's a few fx ideas that I'm curios on, and that I would like to try to do well:\n\n-Melting sim (example different metals, wax, plastic)\n-Fluid in a fluid (diffusion)\n-Wire solver (example disintegration of a pattern)\n-Shockwave (not sure if ideal because it's more sci-fi than realistic)\n-RBD destruction\n-Pyro (spreading flames on small objects ? maybe gas stove flames? match burning?)\n\nMaybe with your help I will manage to create some related examples that would be appealing in a reel for a studio work. I trust your judgment on what would ge good to work on.\n\nAlso I wanted to ask you  in a reel is it good to show other ares as well such as for example grooming, crowds, clothing?\n\nThanks for your help!\n\nBest",
        "ts": "1586958546.003200",
        "username": "Isabella Ippolito (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-15\/1064080186178_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Having other kind of work (grooming, cloth, etc) in a reel can be useful when applying in smaller studios.\nSmall studios tend to ask their artists to be a bit more polyvalent and they appreciate someone able to tackle a wide range of problem rather than having to source another person for each project.\nOn the opposite, bigger studios, typically movies but also in Framestore IA where I work at the moment, usually have a dedicated department for crowds and another one for Creature FX (that includes cloth, muscles, hair)\nThis being said, the main rule on a reel is usually to remove anything that is not good enough.\nRecruiters go through dozens of showreel a day and sometimes they could skip some part of a reel. If you're unlucky enough that someone just see that specific weaker work, it gives bad first impression.\nMy advice is usually to keep secondary areas as secondary. They shouldn't be the main part of a FX showreel but could be useful if you're open to a more generalist position in a smaller studio.\n\nRegarding your list:\n• Melting sim: could be an interesting one showing you have some knowledge with flip. Down side is that kind of effects requires a proper shading and render to be fully appreciated. That's another layer of work on top of the FX sim. Good if you feel confident you can push it to the end.\n• Fluid in a fluid: interesting on a personal level but not necessarily the easiest to showcase in a showreel. What I mean is you can have a nice fluid simulation that proves you know what you're doing (and makes a recruiter choose you) without having a blending of two fluids happening. Unless you go all the way, example lava going into water (different viscosities, change from fluid to solid state, emitting steam). It's a nice subject but not the easiest.\n• Wire solver: in today's Houdini terms, that'd be playing with Vellum. Good one. Vellum is a nice new solver and allows plenty of cool stuff that are useful to know (the knowledge you get using one part of vellum will be useful for other type of vellum simulation). It can also be a very creative option as disintegration is a very wide term that can lead to a lot of cool visual things.\n• Shockwave: it's not a problem if you are doing something that is not realistic. My reel is made at 90% of non photorealistic FX. I like magical effects because you can be creative and try stuff. It's magical, no one is going to say that it is not photoreal. Can be good if you find an interesting look.\n• RBD destruction: the classic. Every reel has one. It won't make you stand out (unless you have a Hollywood level of destruction) but bullet is a useful tool to have in your toolbox. Wouldn't be my priority because of personal taste but it has the advantage of allowing you to combine several FX in one (smoke, dust, particles and RBDs). Can be a big task though. Consider if you feel confident you're going to finish it properly.\n• Pyro: flames are difficult. but this being said, with the examples you give, I see a good opportunity to do FX without doing a simulation. a gas stove can be done with no dop network at all. That's a different kind of challenge but I think it has potential. (I'm the kind who stay away from sim for as long as possible. I like to work, not to wait for a sim)\nIn my opinion, it is better to have less content but with a better quality.\nAs I mentioned earlier, doing a project on your own is difficult. I suggest aiming lower but actually achieve a result rather than thinking big and giving up midway.\nHope all of this makes sense!",
        "ts": "1586964702.003300",
        "username": "anthony (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-15\/1063019725941_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Let's stick with less but good then.\n\nTo narrow down I think we can start with these if you agree:\n\n1)Vellum: I'm interested in this and saw that it's used a lot recently and it would  be a good skill to have\n\n2)Shockwave: I would like to have something  magical\n\n3) Melting: seems a good one even if more difficult I can try\n\nShould I start with gathering references?\n\nThanks!",
        "ts": "1586977702.003400",
        "username": "Isabella Ippolito (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-15\/1058271493142_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "yes!\nhave a round of google, youtube, instagram and co, find some things that you like. It will hopefully help you to narrow down your broad idea to something a bit more defined.\nFrom there we'll see where to go",
        "ts": "1586978095.003500",
        "username": "anthony (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-15\/1058287060150_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]