[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Alya!\n\nI am now finished placement and have got to visit the Pushkar Festival in the Rajasthani desert. Should be interesting!\n\nHere is a really good link that bullet point lists the differences between Apprenticeships and Internships:-\n<http:\/\/www.apprenticeeye.co.uk\/2013\/04\/02\/apprenticeship-or-internship\/>\n\nI think there is no “better” or “worse” option between Internships and Apprenticeships. They’re just different. Internships tend to be shorter in duration and don’t result in any formal qualification. Apprenticeships tend to last longer, and will lead to a formal qualification at the end. \n\nThat makes sense about your AS grades being used to predict your A-level grades and for your Uni choices to make decisions. It was the same for me. I actually applied to Uni the year after my A-levels. That meant I could just focus on my A-level study, not have to worry about doing the UCAS at the same time as studying, and also I had my final A-level results so I knew exactly which courses and unis I could get into without having to worry about my final exam results not being good enough. ",
        "ts": "1541971936.001300",
        "username": "Ollie (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-11\/476886548019_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "title": "Apprenticeship or Internship? »  ApprenticeEye",
                "title_link": "http:\/\/www.apprenticeeye.co.uk\/2013\/04\/02\/apprenticeship-or-internship\/",
                "text": "Many employers don’t know the difference between apprenticeships and internships. Here is a list of the main differences to help you decide whether to hire an",
                "fallback": "Apprenticeship or Internship? »  ApprenticeEye",
                "from_url": "http:\/\/www.apprenticeeye.co.uk\/2013\/04\/02\/apprenticeship-or-internship\/",
                "service_name": "apprenticeeye.co.uk",
                "id": 1,
                "original_url": "http:\/\/www.apprenticeeye.co.uk\/2013\/04\/02\/apprenticeship-or-internship\/"
            }
        ]
    }
]