[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Sorry! I answered you before going out to meet some classmates to figure out what we wanted to do! Thank you for your timely responses, I'll do better ò0ò9\n\nThat's reassuring because I learned things but I've basically wasted a year and the only way I could get one is too return to cegep and study for 3 years...\n\nI was planning on doing some kind of speedpaint showing Character design and background! If you search character design demo reel on YouTube the first video is kinda what I wanted to go for! (By Furgber) I'm not nearly as experienced or talented so would it be a good idea?\nAlso my previous teacher told me to go in a more cartoon style so I could target more studios, is it a good idea too? Should I include examples of my own style?\n\nAlso yes! I live near Montreal :)\n\nI hope it happens that way too for me!! I actually have a cegep diploma in psychology haha\n\nOh nice :0! I've looked at Framestore stuff and you guys do good work :0 One of my friend works there too!!\n\nI wish, I don't think so since it was an intensive program of a year , and they basically just jumped ship letting us drown :joy: It was Desgraff, I don't know if you've heard of it?",
        "ts": "1565890866.002600",
        "username": "Tatjana Paul (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-15\/716395689026_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I'm just looking at that Furgber person's showreel now. That is a pretty cool style to do an artsy reel in i think...a bit more dynamic than \"just\" showing off still images for 2 minutes :wink:. Anything like that will definitely catch people's eyes and set your reel apart \/ make it more memorable than more \"boring\" ones\nAre you drawing mostly digital, mostly paper\/non digital media or some mix? Looking at some concept artists i follow on instagram, i think it could also be useful to keep active either on instagram or artstation, doing sketches, testing a new\/different style for a week or so (i don't know if that one is a realistic thing to do)...basically do and post things that show your interest in a certain drawing style, show off your talent in a certain area and that's also a useful tool for a potential interview because it gives interviewers an entry point to ask you specific questions!",
        "ts": "1565893918.002700",
        "username": "Christopher Puchta (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-15\/727440611028_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I guess the \"cartoon style\" tip from your teacher probably came up because there seem to be a lot of smaller to medium size cartoon\/animation studios in Canada that do a lot of stuff like that for TV or children's movies? So that could be a good entry point, since there's always work in that. I honestly don't know a lot about that area, but i could have a look around and maybe look at studios that do that sort of thing, see if anybody's hiring for anything related to character design\/concept artist to see what the requirements are\/what they're actually looking for",
        "ts": "1565894282.002800",
        "username": "Christopher Puchta (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-15\/727910370384_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That psychology degree should prepare you perfectly for the madness that is the CG industry :smile:",
        "ts": "1565894317.002900",
        "username": "Christopher Puchta (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-15\/716470923618_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "In terms of concept\/character design for movies - if i'm not completely wrong - i think a lot of the work is done at\/with the actual movie studios themselves, since most of that happens in the preproduction phase when they're figuring out what the characters etc should look like. Only after that does the work go to the vfx-companies to execute those ideas\nI know Framestore London (and maybe some of the smaller commercials branches) have concept artists in house, but that's a very small team and i'm honestly not sure what they're actually working on :wink: . I imagine it's mostly working for our own projects - so either commercials or the new things they're doing for VR - could be wrong though",
        "ts": "1565895217.003000",
        "username": "Christopher Puchta (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-15\/716489606770_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Obviously, studios like Pixar\/Sony\/BlueSky\/Dreamworks have tons of character designers and concept artists in house...those guys and girls are doing a super-cool job :slightly_smiling_face:",
        "ts": "1565896298.003100",
        "username": "Christopher Puchta (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-15\/716512146883_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "In your profile you mentioned that you would want to work for a company whose work you’ve always have admired…what are some companies and\/or movies\/TV series that you had in mind for that? :slightly_smiling_face:",
        "ts": "1565909173.003200",
        "username": "Christopher Puchta (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-15\/716739048354_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]