[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "The only companies that i know off that offer internships (in vfx) are MPC, Framestore and Cinesite (i think...i can have another look later). They offer those through this Launchpad program that runs for 8 weeks each summer and applications open in March or thereabouts\nLooking at the smaller tv-companies i rarely see internships advertised anymore...not sure why this is. But just because they don't have it on their homepage doesn't mean they don't offer it :wink:. As soon as you know what you wanna do, where you want to apply etc it's best to just fire off energetic applications to see what's even out there, basically. Test the waters, get your work and your name out there :slightly_smiling_face:\nI'm guessing it would also be possible to get a first job as a junior character designer, but it's honestly a bit hard for me to judge what kinda level of artist companies would be looking for for that",
        "ts": "1566845663.004300",
        "username": "Christopher Puchta (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-26\/740564791447_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "In terms of free editing software...that's an excellent question. I don't think there's a good one i'd recommend (mostly because i don't know :wink: ...whenever i need a new showreel i just use Premiere for a week or two). There is a free trial for Sony Vegas that normally costs 60CAD that gets recommended a lot. I feel kinda weird recommending WindowsMovieMaker or iMovie, as they get ridiculed a lot...but i'm not sure how bad they really are for stringing shots together for a shotreel :wink:. Hope that makes sense...let me know if you need more help with this and i can look into it further, too",
        "ts": "1566848714.004400",
        "username": "Christopher Puchta (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-26\/738295916436_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I'll apply to places as soon as my demoreel is done!\nBut I upload my art on social media daily and have done commissions in the past , it doesn't count for a lot, but I've received clients at least!\n\nA friend told me the Concept art position is a competitive one and usually hard to get, do you have any informations pertaining to this?\n\n\nI'm using resolve right now, it's a bit hard to understand. The basic things like cutting and speeding up the clips, assembling,  is easy but the more fancy edits are....hard to understand but I just have to watch some tutorials hopefully to understand!!\n\nI used to edit my speedpaints with moviemaker, there's nothing wrong with it if you want to do basic things :0 Most free things tends to be ridiculed though. A shame!\n\nThank you!!",
        "ts": "1566850819.004500",
        "username": "Tatjana Paul (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-26\/740989949702_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]