[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Morning Tatjana...hope you had a good weekend! :slightly_smiling_face:\nI don't think the first reel needs to be as sophisticated honestly. Maybe i steered you in the wrong direction earlier...i think if you have a good variety of drawings and throw in a few timelapses of 2-4(?) of your drawings that should give a good impression of your talents. If you work on some simple animations or transitions for later reels (like that person on Youtube had in their reel) that can only be a bonus to make it look more interesting. But i would guess that after a while your work on projects will speak for itself and as you're working your \"reputation\" through working with a lot of people will matter way more than a reel (at least that's the case for us...i can only guess that it's similar for other fields as well)\nInstagram would be more a personal preference i think...it can be useful to get exposure to other artists etc, but as a professional portfolio it's probably not so useful\nHope that all makes sense :slightly_smiling_face:",
        "ts": "1566220607.003700",
        "username": "Christopher Puchta (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-19\/730765763605_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hope you had a good one too!\n\nI wasn't going to include all pieces like that :blush: I have timelapses of a turn around and this but that's all. The rest I'm going to include them as static images!\n\nI do have a personal Instagram that I use a lot as a motivator, seeing talented artists works makes me want to give my best too!\n\nDo beginners find lots of work in Montreal? I've heard a lot of people say we're lucky because there's a lot of openings in the video game\/animation  industry right now :o?",
        "ts": "1566245889.003800",
        "username": "Tatjana Paul (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-19\/731333870437_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "From what i hear, Montreal seems to be in a good place at the moment \/ for the foreseeable future in terms of work (for the our film-vfx field at least, but i imagine that goes similarly for TV\/anim, maybe not so much for commercials). For various reasons work is streaming in and people seem certain that it stays like that for a while (i only just arrived here in April, so i'm still trying to get a better overview myself :wink:). That also seems to give companies more certainty, so at the moment it's more likely to get a long(er)-term contract - where in other locations you'd less certainty with shorter-term contracts\nWe just had two interns start with us here in FX, with one of them getting a offer to stay here for a \"proper\" fx-position which is pretty cool. I'm going to ask them how that worked for them, since i think they didn't get the internship without being connected to a study or something...",
        "ts": "1566248403.003900",
        "username": "Christopher Puchta (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-19\/731382885509_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]