[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yes, you should definitely reach out to possible employers. There's simply too much stuff being posted all over the internet, so recruiters or the heads of department etc just don't have the time to sift through Vimeo\/Artstation etc to find new artists they might want to hire. So reaching out yourself is a must (especially in the beginning)...even if they don't have a position at the moment they'll keep your details should they need someone in the future and then contact you back later\nIn the very beginning i was quite active on CGTalk and some other smaller fx-forums - getting involved, asking questions etc...mostly to learn as much as possible. But they also had those little inofficial monthly \"contests\" that people could contribute to and learn through that\nIn terms of \"expanding my network\" that's a very good question. I'd say most of it happens organically just by working with a lot of different people over time. In the very beginning - when i had just started out - i also went to a few vfx-conferences (when i still had cheap student access :wink:) to talk to recruiters or presenters and get a feel for what they're looking for, getting advice etc\nA necessary evil is also kinda having to be on Linkedin which seems to be recruiters' big tool to source new artists, message them for new jobs etc. It's got its positives tho, too...lots of people post their new showreels, companies\/recruiters post job openings or other company updates that you wouldn't hear about otherwise. It's also a good way to (more professionally) connect with colleagues and stay up-to-date on their career when people move somewhere else and you can then get an insight into their new job and so forth",
        "ts": "1567092324.000400",
        "username": "Christopher Puchta (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-29\/744504329015_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Another wall of text :slightly_smiling_face: ...let me know if that makes sense or you need some more info on anything!!",
        "ts": "1567092391.000500",
        "username": "Christopher Puchta (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-29\/731190232786_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thank you! :blush:\nI should make a LinkedIn then!\n\nDo you know if employers are most likely to choose\/reach out to artists that submits their works directly? Or more likely than an artists that reaches through i.e Artstation?",
        "ts": "1567121353.000600",
        "username": "Tatjana Paul (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-29\/743238697344_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]