[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I can only guess at that part a bit unfortunately, since i have close to zero experience with concept art work...concept art\/design seems like a small circle of people that are being called upon for projects based on previous results, trust that they can deliver results again and have a good relationship with the directors\/showrunners\/etc so they know they're good to work with. So it's probably not a field that you can just throw endless numbers of artists at to deliver lots of stuff quickly. That probably makes it more competitive\nOn the other hand i feel that would be balanced out by how few people have that actual talent required? :slightly_smiling_face:  Not saying fx\/comp\/etc doesn't require a certain talent, but it's definitely different than actually being able to draw and do that creative work...\nSorry that i can't help more \/ be more specific with this :upside_down_face:",
        "ts": "1567007631.000100",
        "username": "Christopher Puchta (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-28\/740778359012_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yeah, access to more powerful software (either for editing or whatever field you're working in) is definitely a problem a beginning and it really is a shame that there are few (if any) good apps out there. Hopefully (or most likely) that will resolve (heehee) itself as time goes on...either because more\/better free apps will be available or you'll simply be able to afford the odd piece of software here and there from your work",
        "ts": "1567007972.000200",
        "username": "Christopher Puchta (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-28\/740787215332_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "What did you do to expand your network??\n\nEven if I post my art a lot, if it doesn't really get seen by employers then it's fruitless for exposure... Should I simply reach out to them?",
        "ts": "1567061690.000300",
        "username": "Tatjana Paul (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-28\/743950343783_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]