[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Micaela\n\nSo I wanted to try to introduce myself a bit more. As I said before, I am originally from the USA, and I grew up in a city called Minneapolis. I studied computer animation at an arts university in New York from 2006-2010, and then moved to London right after that for my first job working on movies. I've been working on movies\/feature films here in London ever since.\n\nThe film that I originally came to London to work on was called Gravity, which involved a lot of computer animation and had a really ambitious number of completely computer animated aspects to it, so it was a really exciting opportunity for me coming right out of university. My first contract was just for a year, which is generally how this industry works for a lot of people. Feature film visual effects (VFX) workers don't typically get permanant positions, at least not right away, and they often have even shorter term contracts than a year. I didn't really know what to expect after getting that first contract, but I ended up getting my contract renewed many times after that (I actually ended up working on Gravity for 2 and 1\/2 years! But that is not actually that typical, it's more common that we will work on projects anywhere from 3 months to a year), so in the end London has turned out to be a really consistent and dependable place for me to get this kind of work.\n\nTo explain a bit more specifically about what I do; I worked for many years as a Rigger, and just recently switched to a smaller company working as an Animator. The job of a Rigger involves creating digital puppets for computer animated characters, while the job of an Animator involves moving these puppets and creating the actual performances of computer animated characters.\n\nI love working in this visual storytelling medium. My experience has really been focused in VFX, which is the term that gets used for computer animation that is intermixed with live action footage. For example, with Paddington Bear or Rocket and Groot from Guardians of the Galaxy, they are of course completely animated, while other actors in the those movies are completely real and were shot using a camera and then combined together with computer animated characters using visual effects techniques. The animation side of VFX is similar to the process of animating more cartoony movies like Pixar\/Disney, but with some key differences. For example, VFX animation tends to be more oriented around animating realistic animals that can move and look in a way that is consistent with animals in real life, whereas cartoon characters and animals tend to look and move in exaggerated\/\"cartoony\" ways, for example Whiley Coyote chasing after Road Runner doesn't look as much like a real coyote as Paddington looks like a real bear or Rocket a real Raccoon. Whiley Coyote also tends to get suspended in mid-air and likes to hold up a sign before falling, whereas Paddington just falls more like a real bear would, and has to move in a way that is consistent with the physical limitations of the real world.\n\nSo enough about me! I would like to hear more about you :) I saw that you are confident in your interest to pursue a job in the Visual Design \/ Computer Graphics \/ VR \/ Film Industry, but that you are not as confident with what you need to do to get a job in one of these areas and what kinds of skills employers of this kind of work are looking for. I am excited to try to help you find ways to pursue a job in one of these fields. The fact that you feel confident in your abilitiy to create visuals is a really good place to be coming from when persuing these types of jobs. Are you currently actively creating visuals? Are there any specific visual works you have been involved in creating in the past that you especially enjoyed working on?\n\nI am happy to video chat or message through Slack, so feel free to respond here or let me know if you would like to try video chatting at some point.\n\nHope to hear from you soon.",
        "ts": "1542480463.001700",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-17\/481640083888_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]