[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hello Jarl!!\nfirst of all,  I am really sorry i never replied! Seems like I never got the notification , so I never read the message. \nSecondly, wow! Thats an inspiring introduction! I think you have a really impressive trajectory. \nAs for me, I can make you a brief introduction of myself, but it would be awesome if we could Video chat through Slack!\nI studied Graphic Design in Argentina, but I always felt like it just wasn’t “enough”. I liked other things and i though i needed to keep on exploring other visual areas. That is when I found about Visual Effects, on my own just researching, as in Argentina all the Visual Effects area is completely unexplored and rather new. Then i found about Escape Studios and did not doubt it: i wanted to come study to London.\nI finished my studies last week, but as you can imagine I am still polishing my portfolio. I been looking for jobs but it looks really hard for me not having experience in Visual Effects industry and also not having an european working permit. \nAll te same, I have been researching and there is a way for me to get a working VISA for Germany; that would be really good as I will need to leave London (UK in fact) in December, because my 6month as a tourist will end there. \nI can also get that working VISA for Spain \/ France \/ Australia. What do you think about that? I think it would be good to arrange a time to video chat about that , so you could give me your opinion and also talk about my work.\nI definitely want to come back to London in the close future though. I went to Goldsmiths open day and was completely fascinated by the Visual Cultures and the Computing Arts MA programs; that would be another possibility for me.\nTo resume, if we could arrange a time for video chatting tomorrow, that would be awesome.\nThanks!",
        "ts": "1543187635.001800",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-25\/488963792646_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]