[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Jarl! How are you?\nI wanted to share with you this news. I started sending my reel and I got an interview with RodeoFX (Munich), I had two interviews so now I’m waiting for them to tell me if I was selected or not.\nAnd yesterday I got an email from Framestore to have an interview on Friday! I still cannot believe they replied my application! I’m quite nervous but excited at the same time. \nDo you have any advise? It’s for a Render Wrangler position",
        "ts": "1576079135.001000",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-11\/856521387522_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Micaela,\n\nCongratulations! That's awesome news! Sorry for the delayed response. I was meaning to respond to your previous message saying I totally respect your approach of sending what you have now rather than waiting until you feel your work is really done. And look at that! It sounds like your approach is really paying off for you now :) \n\nGood luck with hearing back from Rodeo, and with your interview at FS! I would totally try to put in a good word for you if I still worked at Framestore. However, if it felt at all helpful, you could say you have been involved in the Access VFX mentorship, and that I used to work at FS for many years (and would be happy to be a reference for you if they would like to contact me).\n\nI know people who have previously worked in render support at FS, who have since moved into various CG-related positions such as rigging and creature FX, so I think that sounds like a promising opportunity for you! I bet you could make your way into FX from there if you kept at it. \n\nIn terms of advice, I dont know how helpful this is to hear, but in my experience VFX interviews tend to be fairly laid back relative to other industries. My partner always prepares answers to typical job interview questions, for example \"name 3 of your top qualities, and one of your biggest weaknesses\", but I've never been asked stuff like that in my VFX job interviews. I guess what I'm trying to say is that maybe knowing these interviews aren't typically that formal might help you feel a little less nervous. Anyhow it's totally normal to feel nervous! Hopefully it will start to feel more natural and relaxed once the interview gets going :)\n\nAnother piece of advice\/info based on what I've heard from a friend who used to be in render support at Framestore. He has always said to me how when he was in that position he got great experience from needing to stick up to people in charge and say \"no\" fairly often. As I understand it, the job entails a fair amount of communication with people who are in leadership positions, CG supervisors for example, and sometimes this means needing to tell them something they want isn't possible that evening (because render support often happens overnight). I guess it might go over well if you can tell the people who are interviewing you that, once you get comfortable with the position, you wouldn't be afraid to tell someone \"no\", even if they are used to being the boss\/getting their way. \n\nOne other thing in terms of render support. I'm sure you might already know much of this, but just in case it helps, I imagine they will ask some stuff in relation to render farms, for example have you ever worked with a render farm before, say at Escape Studios? Even if you haven't, it could help you to at least feel comfortable talking about the concepts behind render farms (CPU\/RAM allocation, off the shelf versus in-house render farm software, ect). When I worked at FS, the render farm was an internally developed software application, which is likely still the case, so even if you have worked with a render farm like Qube at Escape, saying something along the lines of \"I'm a quick learner with software, and am very capable with learning new software, tools and workflows\" might be well received. Basically what I'm trying to say is a quick bit of research on render farm concepts, for example reading about what the \"Qube\" software package offers, could help you stand out. Also feel free to ask me if you have any questions about render farms, I'm no expert, but would be happy to try ti relay what I know!\n\nIf you'd like I would be happy to reach out to that friend who used to work in render support at FS too, I could ask if he has any other advice? There's not much time, but he's fairly responsive, so I'd be happy to give it a shot if you want.",
        "ts": "1576100769.001100",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-11\/870021896528_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]