[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Jarl! How are you?\nFirst of all I wanted to apologise for not having answered. I had to go back to Argentina and things were really complicated so I did not have much time to work on my personal stuff and such. But when I was thinking that I had to stay there, I was sent a job offer as a Graphic Designer at a startup software company here in London. I doubted it as I really want to get myself into the VFX industry, but I thought this was an opportunity for me to start gaining work experience in London, also having access to all the events\/exhibitions that constantly inspire me and be able to network in person. So I decided to take the job, as also it was a One year contract. So right now I came back to London (I arrived on last Saturday so I’m settling down in these days), and started working on Monday. The place is really nice, I know it’s probably not where I want to work forever in terms of creativity and what I do there, so It’s up to me to keep on working on personal projects on my free time, so more or less in October I start looking for another job (the contract ends in February). ",
        "ts": "1551040873.000100",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-02-24\/558883408129_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "So, sorry for writing so much! That’s a brief story of what’s been going on since we last spoke",
        "ts": "1551040902.000200",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-02-24\/558709762688_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Any comments\/suggestions would be really helpful :) ",
        "ts": "1551040921.000300",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-02-24\/559782464661_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I’m also thinking of buying a good notebook from which I can work on my projects because right now I have a Macbook pro and it’s not very good. But I find it hard to start doing stuff as I am in a “transition” moment",
        "ts": "1551040974.000400",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-02-24\/559336126771_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]