[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Jarl!\n\nThat is so cute!!! I can only imagine how happy you must be about all of this, it must be the most amazing feeling! Enjoy it!! When my aunt was pregnant, I took some really nice pictures of her and also month by month, that is such a nice thing to do cause then you see the whole evolution and it’s just crazy!\n\nThank you very much for your feedback, I really appreciate it! It is indeed very satisfying to watch and to work on it, that’s when I realize how much I love doing this and that it’s my true passion, so it’s just a matter of hard work! I am actually happy I am doing the Houdini course on the evenings, it’s been some hard months, but I’m sure it will pay off eventually :relaxed:. Regarding the shot, it is longer but it takes so long to render! I am currently caching it in the university so going there every day to see how it is coming. Can’t wait to see it rendered and incorporate it to my project done in Maya.\n\nUntil last week, I just had my works in that website. But since all job postings asked for a showreel, I thought it was time to let the “fear of making a not so good showreel” go, and try to make the best as I can with what I have done until now. I think it is far better to apply and worst case scenario be rejected,  and know that I have to keep on polishing it, than not applying at all. So I did put what I thought were my best work together and sent it. I hope I can finish the Houdini shot soon so I can incorporate it as well! There are so many jobs out there, but I know it’s a long journey!\n\nOn a side note, I went to Bournemouth for the Open day, to listen about the MA in Digital Effects. I really liked it, and there were some good works. Anyway, it’s always a matter of how much you put to it, but I think having previous study experience and practicing a lot will really help me if I decide to take the masters. As I told you, it’s a good option for me cause they then give you a two year visa. So I will apply this weekend and see how it goes, so I have it as an option! \n\nAnyway... lots of applications, deadlines,:joy: but trying to keep it together! I am happy I know where I want to get to so that’s a pretty good starting point ",
        "ts": "1575045144.000900",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-29\/842684866899_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]