[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Jarl! How are you?\nI have been wanting to talk to you but my last two weeks were just crazy... I had the interview at Framestore on Friday and they made me an job offer 3 days later which was the best news ever for me. I was so so happy, I couldn’t hide my smile at work and accepted automatically. \nBut I knew after that, a hard part was coming which was let them know I had to renew my paperwork because now I am under a Tier 5 visa tied to my employer. But that did not mean at all that Framestore had to sponsor me; I had my own sponsor. Anyway, they answered me that they had to see it through and we had a call about this with HR. I explained everything so they told me they just had to go through the lawyers and ask. And apparently the lawyers said it was not posible that they employed me under the visa I am now...",
        "ts": "1576865445.000100",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-20\/881920091428_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "So it’s been quite a sad day. I was so close and even got the job offer so it is very frustrating to hear this news.. Having said this, I never imagined I would get this job offer and I try to look at the bright side and not give up with this obstacles. So I am just trying to see how to proceed..",
        "ts": "1576865513.000200",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-20\/872126745841_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I just got an answer from Goodbye Kansas to interview me on January, but I know it is probably going to be the same situation",
        "ts": "1576865542.000300",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-20\/869596466962_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "So though I am very sad today, I want to be grateful that they chose me and that if I do a masters luckily I would have a 2 year visa to work for them or other company. It was extremely motivational for me that they called me. But I have to keep on pushing",
        "ts": "1576865610.000400",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-20\/884240327287_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Anyway.. sorry for the long text! I just wanted to let you know about all this. I am flying to Argentina today for the holidays and coming back to London to finish my contract until February. I will for sure keep on applying and working on my reel, but I know I will probably have to find another way",
        "ts": "1576865679.000500",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-20\/882392577525_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]