[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Micaela,\n\nThanks!!! My partner is almost five months now. It's starting to feel more and more real. She's been getting lots of kicks lately, and the baby even gave a kick after I started singing to my partner's belly the other night. The baby must have been reacting to my awful voice ha!\n\nThanks for sharing your work! Sorry for the delayed response. The flipbook\/movie you attached looks awesome! It's really satisfying to watch :) It's also helpful to have the liquid a separate colour from the rigid pieces that blow away first. It makes it easier to clearly see the different kinds rigid and fluid simulations going on. Well done!\n\nThe only thing I found myself thinking might make it better is if the movie was longer, to see more of the simulation as the rigid bits and fluid settle onto the ground. Of course I imagine that's a whole additional stage of work, which is probably way easier said than done, but it was just something that came to mind, so I figured it might be worth sharing.\n\nUltimately I don't think it needs to be longer, it just was my first instinct watching it, that I wanted to see more, which is certainly a good sign to me that what you are doing is working!\n\nI didn't get a chance to look through your website much yet, but the few projects I did see looked cool. I like that you have descriptions of your ideas accompanying each piece. The site in general looks very professional tio. Just to be sure (since I didn't see it at first glance if it was there), did you put your work in progress reel on your site yet? Or was that something you were still working on, and the work that is on your site is what your were planning to include in your reel?",
        "ts": "1574806234.000800",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-26\/850547995344_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]