[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Jarl!\nThank you for your response and advise! Everything is really helpful. I will definitely make a good research on Qube so as to know a bit more, I also assumed they have their own tools to render but I’m sure it will be well received.\nI would really appreciate if you could reach out to your friend if that’s not a problem obviously! They also mentioned on the email that I went with questions. I have tons of them but if there is any question you or your friend think would be beneficial, that would help a lot as well as any crucial advise. Again, if it’s possible, I know people can be busy and this is tomorrow afternoon :scream:\nAgain, thank you very much for taking the time!",
        "ts": "1576141374.001200",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-12\/872469453943_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Micaela draft\n\nHey sure! I've just sent James a message, hopefully he gets back to me in time. I guess one question you could ask might be whether they've had people start in render support who ended up in FX, and whether they have any internal training \/ mentoring programs for FX? \n\nA sort of more nerdy question might be if they know how much of their farm resources tend to be actual lighting dept renders versus other kinds of tasks? For example, I know other departments like Rigging and FX will run various processes on the farm, so it could be an interesting question to find out what kinds of typical farm tasks you might be helping out with\/overseeing. I was one of the people who started building rigs on the farm at Framestore a while back as a way of speeding up our scripted rig build times while working on Gravity, so I know for sure it's definitely not just renders being run on the farm ;)",
        "ts": "1576147948.001300",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-12\/870754768277_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Great! Thank you so much :)\nOn that note, do you think it is all right to say my aspiration is to get into FX? I know it’s good to always look after some other goal, but I don’t want to sound like I don’t value the position of Render assistant ",
        "ts": "1576148113.001400",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-12\/857966210386_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yes! Hearing back from my buddy James who worked in render support, it sounds like they really want people coming into render support who are interested in eventually moving into other roles.",
        "ts": "1576150406.001500",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-12\/859323245091_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Here's what James sent me:",
        "ts": "1576150413.001600",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-12\/870334914468_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "The role is entry level so not a whole lot of experience needed. Mainly looking for people that can do the role but also that they are motivated and suitable to move into something else later.\n\nSo is good to show they have a clear speciality in vfx. Were some people that didnt know where they wanted to go, so they didn't hire them as a year down the line it would be hard to move them up.\n\nQuestions about deadlines, work load, what software\/systems they use could be good to get more info. If they have any coding skills its always good to mention.\n\nRender support really helped me get into the industry but if they also got an offer for anything like ATD or junior\/generalist role in another department that might be better.\n\nRender support is a great first step but only if you have plans to move out as soon as possible. As had sime friends that were in there a bit too long and could slow down their progression. But don't want to put a negative spin on it as it did work for me :)\n\nCould be good to mention they got mentoring from you\/an ex-framestore employee as shows they are perusing things.\n\nOr also ask what roles it could lead into.\n\nHad a friend that was great, but didn't get hired because he was a modeller and they were aware that the modelling department was full and no new projects needed much modeling work in the next year or so.",
        "ts": "1576150423.001700",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-12\/859323559187_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That’s great to know, really very useful information, thank you very much for taking the time Jarl! And also say thanks to James on my behalf. \nI will think about some questions and also kind of plan what I could answer if they ask me about my career goals and experience.. even though I know there is always a surprise factor haha but I’m sure it will be great, I am going as prepared as posible.",
        "ts": "1576158010.001800",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-12\/859469211315_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thanks again for all this help, I will let you know tomorrow how it went!",
        "ts": "1576158026.001900",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-12\/870936723648_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Oh sorry and last question, a bit funny but.. dresscode? :joy:",
        "ts": "1576158046.002000",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-12\/858156130914_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I assume formal but just in case asking ",
        "ts": "1576158056.002100",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-12\/870481769268_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Oh yeah most people wear sneakers in this industry, even the supervisors and directors, so just a little formal will be fine, to show you really care about the job and know how to behave professionaly, but there is definitely no need for anything super formal.",
        "ts": "1576159468.002200",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-12\/860702694801_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Good luck!",
        "ts": "1576159474.002300",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-12\/860702866097_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Great! Thank you very much again!! ",
        "ts": "1576160806.002400",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-12\/858226813474_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]