[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Jarl! I’m so sorry about the delay in my answer! My last month has been crazy... I moved out of my flat before leaving to Buenos Aires to renew my visa, and came back last week to start at Goodbye Kansas. Super exhausting but happy at the same time!\nIt’s so crazy you were at the event! I wish I saw you.\nI really liked the talks and wish there was more networking; only two people worked at VFX. To be honest.. I didn’t like as well that they asked us to “collaborate”.. I struggle myself with my salary and cannot afford to help any organization. But I really enjoyed the talks and it felt somehow relieving the fact that there were so many people on the same page",
        "ts": "1584394553.000300",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-16\/1006390423494_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I started great at Goodbye Kansas, a lot of information to take in and I already want to know everything haha I need to handle my anxiety towards learning. The atmosphere is great though, I’m so happy to be part of the industry and part of me still can’t believe I made it even though I’m still not an artist, it’s a good start!",
        "ts": "1584394668.000400",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-16\/994110320881_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I wanted to ask you something that you may have more idea than me having more experience..\nIn order to be sponsored in the UK, I need to earn more than 25K per year. I am now on a 21 per year as a matchmove, and if i wish to stay longer I will need to “jump” to 25K. Do you think it is posible (being totally honest) or what would you recommend to make that salary jump within a year?",
        "ts": "1584394766.000500",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-16\/992719684339_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Besides from work, I wanted to ask you how are things going expecting the baby! You must be so excited!",
        "ts": "1584394800.000600",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-16\/1006398391574_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]