[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Jarl! \nThats such great news! Congratulations!!!:dizzy::dizzy::dizzy::dizzy: Whats his name? \nI can imagine the stress but actually it is good that you are forced to stay at home so you can spend time with both of them. Thats great :grinning:. I am healthy and good as well thanks, as well as my family and friends. I am currently staying at a friend’s place in London so luckily have company.\n",
        "ts": "1587486948.000300",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-21\/1076894552995_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Being put in furlough means you are not going to work but still receive a salary? We were offered that at the company but unfortunately I’m not elegible... What they did at Goodbye Kansas is reduce our working days and salary to an 80%. Most people were not very happy, I think personally it’s my best bet being new in the company.\nI started and 2 weeks later we were sent home, so didn’t get a chance to meet people much and get used to the workflow, but I’m putting all my efforts to keep up and having meetings every day with my manager. It is a tricky situation though because there is not a lot of work to be done..",
        "ts": "1587487086.000400",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-21\/1082859168980_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Its great that you are managing to update your showreel as well! I am a bit concerned about the situation since I am still on my probation period (it ends first days of June) and don’t know how much in need I will be when we go back to the office.. I am kind of preparing for the worst and trying to learn as much as posible in case things go south",
        "ts": "1587487174.000500",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-21\/1075314533205_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]