[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Micaela,\n\nGlad to hear you attended the gender pay gap event! That's a funny coincidence because I actually helped organise it, and was also there :) I know Sydney Padua from work, and was the one who invited her as one of the panelists. \n\nThe union seems to be a \"tough nut to crack\" for VFX, although I wish it wasn't. I tend to avoid telling most of my colleagues that I'm involved, because of fear that MPC is very anti-union, and I don't want to risk someone mistakenly telling the wrong person, and then my not getting my contract renewed because of my association. I am probably a little paranoid, but I just don't want to risk it with a baby on the way and my family to support. But I think it's really great that you went! Ultimately I wish more people would join, but it's a very difficult thing to get more people to do that when I think many people are concerned about talking to each other about the union.\n\nWhat did you think of the event? I personally had mixed feelings. I liked the general discussion and found things like Sarah Putt's advice to learn more about assertiveness particularly useful advice. However, I didn't like the \"hard sell\" for joining the union at the end. I'm not sure if you remember that, it was when the Bectu guy got up and spoke briefly about everyone getting their pens out and signing up for the union right on the spot. While I support his sentiments, I feel like it isn't the right approach. I think a better approach would have been to point out that joining the union is worthwhile because having more members helps the union be able to afford hosting more events like this one, and that even though in the long term the union has even more to offer if we build up our numbers, in the short term it still offers a lot of useful things that are worth supporting through more people becoming members. \n\nI've been thinking about you getting your visa approved, fingers crossed it's all going through well for you!",
        "ts": "1581102429.000300",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-07\/942022471412_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]