[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Jarl! How are you?\n\nI just wanted to let you know about two good news :grinning: \nYesterday I got the acceptance letter from Bournemouth University (which was my “original plan” to get a 2 years visa to work here without sponsorship), and later on I heard back from Goodbye Kansas who made me the job offer! So I am very happy but at the same time trying to keep my feet on the ground until everything is sorted out with the papers. They were Ok with me doing my own sponsorship (which was not the case with Framestore) and tomorrow they are going to have a call with my sponsors, so fingers crossed:pray::skin-tone-4: \nThank you so much for the support and I really hope everything goes well, otherwise I know I have the plan B (I was already planning a Euro-trip for this months that I was going to be unemployed:joy: but that can definitely wait!) ",
        "ts": "1579717509.000100",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-22\/906103096595_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey a big congratulations Micaela! I'm so happy for you :D Fingers crossed things are smooth sailing with the visa stuff.\n\nI'm doing fine thanks! The baby is still cooking \/ my partner seems to be doing well with her pregnancy. I hope you are doing well otherwise with life outside of career stuff. \n\nOut of curiosity, what is the name of the organisation that you are getting your Visa through? I'm sorry if I already asked you that.",
        "ts": "1579718380.000200",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-22\/904813098754_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Awwww thats so cute! I am so happy for you as well, you must be so excited to meet your baby! Do you have an estimate date? \n\nThank you! I don’t think I told you so no worries! It’s called AIESEC <https:\/\/www.accesstier5.com|https:\/\/www.accesstier5.com> . I found it last year doing the deepest research in terms of posible visas that I could get as an Argentinean. The only bad thing is you need to pay for yours and its just for one year, but it gets you in so it’s a good option to have in mind! It’s specifically for recent graduates who want to work in the UK and do not have citizenship, and obviously would not get sponsorship. Pretty well thought! \n",
        "ts": "1579732925.000300",
        "username": "Micaela (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-22\/918005095200_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "title": "Access Tier 5",
                "title_link": "https:\/\/www.accesstier5.com\/",
                "text": "Access Tier 5 sponsor graduates who want to work in the UK. We sponsor non-EEA graduates to undertake work experience with UK employers and are powered by AIESEC, the world's largest youth led organisation.",
                "fallback": "Access Tier 5",
                "thumb_url": "http:\/\/static1.squarespace.com\/static\/58d64f29e4fcb5ad94b88e7f\/t\/58dcd3e01b631b87a837d35d\/1490867169247\/Logo.jpeg?format=1500w",
                "from_url": "https:\/\/www.accesstier5.com\/",
                "thumb_width": 339,
                "thumb_height": 339,
                "service_icon": "https:\/\/images.squarespace-cdn.com\/content\/v1\/58d64f29e4fcb5ad94b88e7f\/1490867156771-207KCMK8TC9QXPP7HPQX\/ke17ZwdGBToddI8pDm48kKndyKQloW0MEvEK4ZVLpwZZw-zPPgdn4jUwVcJE1ZvWEtT5uBSRWt4vQZAgTJucoTqqXjS3CfNDSuuf31e0tVE1fdxwEOqXs3AgELqabiTjlC8Dt2iEKIl9pFODoEwlwB37p2tb5Ankws0EGGInMME\/favicon.ico",
                "service_name": "accesstier5.com",
                "id": 1,
                "original_url": "https:\/\/www.accesstier5.com"
            }
        ],
        "edited": {
            "user": "B6CS60LDU",
            "ts": "1579732926.000000"
        }
    }
]