[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That's a great start, always best to keep the language and what you are wearing professional at first to give a good impression.",
        "ts": "1510910965.000179",
        "username": "dexter (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-17\/274908948166_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Something that is also really important, but not taken seriously by many students, is to turn up early and\/or be on time for calls and interviews with the right documents you were supposed to bring etc. If you look organised and dependable then an employer will much more likely trust you to work for them. \n\nDo lots of prep thinking about what the employer will want to hear, what they are looking for and to do this make sure you do a bit of research about them and their team before you arrive to an interview. \n\n*Ask lots of questions*. This one is really key, it shows your interest and knowledge. I would suggest you ask questions throughout the interview and save at least 2 really good ones for the end of the interview. \n\nLastly, don't worry if they ask you about anything that you don’t have direct experience of, don’t worry &amp; just try to think of a similar example and use that. It shows you can think on your feet but also that you are honest. For example I once did an interview and they asked me about writing business cases which I hadn’t done before but I said I had written reports at work and my dissertation which all demonstrated I was capable of writing at that level",
        "ts": "1510911648.000325",
        "username": "dexter (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-17\/275116027239_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Best thing to do is to remember that the interview is a 2 way process and you want to understand if that person and company are right for you too.",
        "ts": "1510911699.000136",
        "username": "dexter (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-17\/273521540401_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Just do some good preparation, smile and be friendly &amp; polite - you will go far!",
        "ts": "1510911755.000430",
        "username": "dexter (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-17\/273381898992_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Are there any particular aspects of making a good impression or interviews that you are unsure about or not confident with?",
        "ts": "1510911781.000421",
        "username": "dexter (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-17\/273382022944_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I'd be happy to do a mock telephone interview with you if you wanted?",
        "ts": "1510911793.000456",
        "username": "dexter (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-17\/274083652308_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "*What have I been up to recently*\nSo recently we've been talking to a lot of employers to take on their feedback and understand what they want. We've been having lots of phone call interviews with people we messaged cold through Linkedin!\n\nGenerally I find the best way to approach people when you want something from them is to ask for help genuinely and openly. You will be surprised how many people want to help others.\n\nThen once you get on a call with them you can open them up and build a relationship.\n\nIt's also the case that generally you shouldn't go to someone asking for something on your first call\/meeting, but that you build up a relationship over a couple of meetings (if possible) before you do. That is what networking is all about, you don't necessarily see the rewards of it straight away.",
        "ts": "1510912055.000113",
        "username": "dexter (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-17\/274183126773_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]