[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Millie\n\nSorry for the delayed response. Happy Monday! I hope you are doing well? Have you already spoken with your family friend who is a photographer?\n\nSubmitting to National Trust seems like a good idea. Are there specific Nat Trust publications that you know of? It reminds me of this guy from the same state I am from (Minnesota), who seems to be carving out a decent niche for himself with nature photography over there:\n<https:\/\/www.instagram.com\/ryan.pennesi.photography\/>\n\nLooking at what that guy is doing, I suspect trying to build a following on social media for your own work might be a helpful thing to do. Using deviant art is probably a really good start, but maybe if you haven't already established a presence for your own work on other mainstream social media networks, it could also be worth pursuing in order to boost your appeal with potential publishers.\n\nOn the animal portaiture side of things, I also really enjoy the work of Tim Flach, have you seen his stuff?\n\n<http:\/\/timflach.com\/>\n\nIs there anyone in nature photography whose work you particularly enjoy and\/or see being really successful? I think finding successful people who specifically do what what you want to do is super important. Seeking out speaking with those people if at all possible seems like a great way to get the most relevant advice.\n\nFor your boyfriend, that's cool he's interested in game dev! I have a friend of a friend who does that stuff professionally, I could reach out to him to see if he has any advice? Do you think he is more specifically interested in the developer\/coding side of things versus the art side of things? I know that some game studios recruit people from Games Engineering programs at Universities, so that is certainly one option. Another one for the more coding focused is a degree in Computer Science. But also in the field of VFX\/CG animation for films and advertising, a lot of the best training is online, and it may be that if he is more interested in the art side of things, that those would be a better choice. Also there might be very competitive game dev online schools too that I am not specifically aware of, but I could ask that friend. Do you know if your boyfriend has any programming or scripting language experience?",
        "ts": "1537174518.000100",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-09-17\/436253749585_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "title": "R Y A N   P E N N E S I (@ryan.pennesi.photography) • Instagram photos and videos",
                "title_link": "https:\/\/www.instagram.com\/ryan.pennesi.photography\/",
                "text": "1,180 Followers, 631 Following, 161 Posts - See Instagram photos and videos from R Y A N P E N N E S I (@ryan.pennesi.photography)",
                "fallback": "R Y A N   P E N N E S I (@ryan.pennesi.photography) • Instagram photos and videos",
                "from_url": "https:\/\/www.instagram.com\/ryan.pennesi.photography\/",
                "thumb_url": "https:\/\/scontent-iad3-1.cdninstagram.com\/vp\/86372e1cbf38c1af1bb460611793c747\/5C2E4251\/t51.2885-19\/s150x150\/22500151_312348645909673_7044944081494999040_n.jpg",
                "thumb_width": 150,
                "thumb_height": 150,
                "service_icon": "https:\/\/www.instagram.com\/static\/images\/ico\/apple-touch-icon-76x76-precomposed.png\/4272e394f5ad.png",
                "service_name": "instagram.com",
                "id": 1,
                "original_url": "https:\/\/www.instagram.com\/ryan.pennesi.photography\/"
            },
            {
                "title": "Tim Flach",
                "title_link": "http:\/\/timflach.com\/",
                "text": "London-based photographer best known for his highly conceptual images of animals which range widely across species but are united by a distinctive style",
                "fallback": "Tim Flach",
                "from_url": "http:\/\/timflach.com\/",
                "service_name": "timflach.com",
                "id": 2,
                "original_url": "http:\/\/timflach.com\/"
            }
        ]
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi jarl, no worries for the late reply :grin: I haven't been able to reach out to the family friend yet but once they get back from holiday I'll jump on him. As for the social media, that's a great idea. I haven't tried making an account for my pictures so that'll be my mission for today :grin: I'll have a look at Ryan pennesi's account but would you recommend making it a professional account or a casual one layout wise? If professional, in what way could I make it? And what would be the best way to advertise that my photos are available to buy\/use etc? I was also wondering, if I intend to sell the rights to my photographs to various publishers like the national trust do I need a copy right? Or something equivalent? \nI haven't seen Flash's work I'll check it out, all the artists I love are people who shoot as a hobby :sweat_smile::sweat_smile: there are a few photographers whose photos I love but their names escape me so I'd have to look them up. \nI don't have a single point of inspiration, but I do make folders of different photographers and their pictures that I find interesting which are often my inspiration. \n\nI'll have to ask him about all that :sweat_smile: sorry. But thanks for answering, I'm trying to convince him to go into it because he likes the coding and the artwork side of things. \nHope you're good? ",
        "ts": "1537178355.000100",
        "username": "Millie (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-09-17\/436876256434_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]