[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Millie\n\nGood afternoon! Those are good questions.\n\nMy first job in this industry was at a very small studio (5 people) in New York, which is also where I went to university. I got an internship at that studio during my last year of Uni, and then I did a little bit of freelance work with them after the internship was over. That studio was run by my teacher and a couple of his friends. That teacher\/lecturer was the same guy I mentioned before, the one who also introduced me to the person who hired me here in London to work on Gravity. So yeah in retrospect it feels like fostering those relationships with people in the industry was really important for me.\n\nIt's funny I never really thought about how I chose VFX specifically. It was kind of just this amazing opportunity that I was presented with, so I lept at it. When I was studying in Uni I actually wanted to work on what we in the industry call 'feature animation', which is more fully CG cartoons like Disney\/Pixar\/DreamWorks style movies. One of my favorites when I was graduating was Cloudy with a Chance of Meatballs. Have you seen it? VFX tends to be more oriented around adding CG creatures\/explosions\/set extension to live action movies. Like Guardians of the Galaxy or Paddington for example. I honestly didn't even know what the term VFX meant when I got the job working on Gravity. I felt like I was pretending to know all this stuff for many years before I actually did know all this stuff about this industry haha.\n\nWhen I first started going to Uni, I intentionally chose not to focus on art because I thought I didn't want to have art\/creative stuff to be my job. I thought I didn't want to sell my art, and instead I just wanted to make art in my free time for the love of doing it. However, at the same time I was working fulltime in restaurants as a server and barback.\n\nWhile working in restaurants, I met a lot of older adults who had worked in restaurants full time for a majority of their life. I think seeing how much time they spent working, I thought a lot about how much time most adults spend working each day, and it made me realise that if I was going to be working that much for the rest of my life, I wanted to try to do something for a job that I really enjoyed (and I did not enjoy working in restaurants)! \n\nOnce I figured out what I didn't want to do, I think that made the decision to transfer into art school a no-brainer for me. I knew I liked being creative and it wasn't so much about 'selling my art' as it was about generally being excited about and enjoying what I did all day every day.\n\nI chose computer animation as a focus in Uni because it was sort of these two world's colliding for me at that time. As a kid I loved sculpting characters with clay and pretending they were alive. I started to realise that making computer animation was kind of like getting to do that (on the computer) for a job, and that just seemed like so much fun! I basically saw some Universities that had these CG programs, and thought to myself that if I chose a different focus and spent the next 4 years watching other people get to have all this fun with characters on the computer, that I was just going to be kicking myself for not choosing to focus on that instead :)\n\nHow about you? How did you get interested in creative stuff? Is there any kind of creative thing you are particularly interested in right now? Don't worry about responding with the same amount of writing that I am. Honestly being more concise is a skill I'm still working on!",
        "ts": "1532696764.000195",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-07-27\/405496438864_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]