[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Millie, sorry for the delayed response. Hope you are doing well. Voice acting sounds very cool. I bet having an acting background would be a helpful factor for that kind of work. I don't know much about it, but a friend of a friend who started a podcast is now doing some voice acting or voice over work, so I suppose podcasts might actually be a potential avenue to get into voice acting. Have you ever done any voice acting before?",
        "ts": "1535367625.000100",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-08-27\/423051488720_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I've never done voice acting yet but I'm looking around for opportunities. Done plenty of acting tho :joy::sweat_smile: how have you been?",
        "ts": "1535370931.000100",
        "username": "Millie (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-08-27\/423229409937_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I've been well thanks! I'm taking a few online animation courses this year, and was just battling my way through a tough assignment over the past few days, but I finally think I've arrived at a good place :) Full-time work plus homework is not my ideal state of being, but I am enjoying doing my own animation in my free time, and think these courses are worth it. I've worked in VFX for many years, but very recently switched to being an actual 'animator' for my job (most of my professional experience has been as a 'rigger') , so I'm trying to really sharpen my skills now while I'm still 'young' and don't have kids and a stuff :)",
        "ts": "1535372880.000100",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-08-27\/423246498497_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Have you ever come across any online schools for voice actors? How about websites where voice actors advertise their work?",
        "ts": "1535373575.000100",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-08-27\/425162035830_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I'm looking into doing a few different short and online courses for a few different things so I'm hoping to apply for them soon, when I get back from the isle of Wight :grin: my boyfriend is extremely tech savvy and does low level animation so I only really know what I have seen him do :sweat_smile: ",
        "ts": "1535384294.000100",
        "username": "Millie (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-08-27\/423233407984_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]