[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi jarl. My family is going through I crisis at the moment and I don't think I'll be able to participate in this for a while. Thank you for all your help and guidance. I hope you're well x",
        "ts": "1538938065.000100",
        "username": "Millie (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-07\/451012623074_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Millie. I am sorry to hear your family is going through a crisis. Thanks for letting me know. I am also sorry for not reaching out more this past week too. It was a busy past week, but thankfully not because of any crisis on my side. I am thankfully doing fine. I hope you are doing as good as can be expected given the situation. You've been incredibly good at communicating, despite this time of difficulty still taking the time to let me know. This is a really important skill that employers are always looking out for. It is also one I think would make you an excellent employer yourself some day if you did end up starting your own company down the road. Please don't hesitate to get back in touch any time, but also please do take the time you need now.",
        "ts": "1538948433.000100",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-07\/450872020180_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thank you so much for being so understanding. I'm glad all is good with you :relaxed:",
        "ts": "1538949065.000100",
        "username": "Millie (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-07\/450873841012_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]