[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Millie\n\nHow's your week going? Thanks for sharing your photos with me, they are really nice! I've had a busy past few days, so haven't sat down and really looked at your photos on a big screen yet, but I did look at some of them on my phone and really enjoyed what I saw. I was impressed with your with compositional skills, nice lighting choices and usage of shallow depth of field. You said you were interested in submitting to Shots, that sounds like a good idea! Have you submitted your work anywhere else before?",
        "ts": "1533648268.000393",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-08-07\/411455309216_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thanks for looking at my photos! I'm not sure if you got my last message but I was just saying that I really want to see the new Winnie the pooh movie! \nI haven't submitted my work No, I haven't quite been brave enough yet :sweat_smile: but if there's any places you were thinking of then I'll definitely look into them! \n\nGood News! I have a couple of job interviews later this week so I'm excited for them! Wish me luck :crossed_fingers::crossed_fingers: how's your busy week been? ",
        "ts": "1533648647.000103",
        "username": "Millie (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-08-07\/413493703110_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Ooh good luck with the interviews! That's exciting :) Have you had any jobs before? Do any of the jobs you are interviewing for have creative aspects to them? One thing that I've always heard helps job applicants stand out is a cover letter. Even for creative jobs I think a good cover letter makes you look extra professional to the people hiring (even if they don't read it!)\n\nShoot I think I did miss your previous message. Yeah I'm looking forward to Winnie the Pooh too! We had a cast and crew screening on Saturday, but it was at 9AM! So I didn't manage to wake up for that. I'll see it at a normal time instead :) My week is pretty good thanks! There was a social thing last night related to work, so I was out late :p Being busy is definitely good when compared to not having any paid work :+1:",
        "ts": "1533656461.000424",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-08-07\/412286533666_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": ":joy: sounds great! Yeah I've worked at squire garden centre before so I'm prepared :sweat_smile: but Yeah, one job is for picsolve international, do you know them? I'll be selling photos at the London eye if I get the Job! Exciting! I've written cover letters for every job I've applied for. \nDefinitely agree with being busy over not have work! I go crazy not having a Job :joy: ",
        "ts": "1533670027.000251",
        "username": "Millie (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-08-07\/411905893169_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]