[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Millie\n\nI'm doing pretty good thanks :) Apologies in advance for the long message. How's your week been so far?\n\nI started a new project again recently, so it's been fun getting going on that this week, although also challenging. Until about a week ago, I was working on this biopic film about the author of the Lord of the Rings books, J.R.R. Tolkien. I think I was telling you I wasn't sure if I could say what I was working on when I started on that, but I recently realised it was posted on my company's website, so I think it's fine because it is already public knowledge that we're working on that. In case I didn't explain that already, we have to sign Non Disclosure Agreements as part of our work contracts, so as a result we have to be careful what we say about what we're working on or we can get in trouble. Anyhow, it isn't really a big blockbuster film or anything, and I'm honestly not personally a huge fan of his work or either, but it was enjoyable to work on, especially getting to see a work in progress screening of the film (which doesn't normally happen on every film I work on).\n\nIn terms of whether to set up a professional\/company social media account or just a personal one, I think you can probably switch between personal and professional account types pretty easily on most social media sites, so I wouldn't worry too much about that at this stage. It seems like you can switch to one or the other down the road if one ends up being better for your needs.\n\nIn terms of what would be the best way to advertise that your photos are available to buy\/use etc, one way is to put contact and rights info into your social media profile(s), which states how you prefer people to use your photos and how they can get in contact with you if they want to use them commercially. Doing that is definitely one of the benefits of having a presence on social media. It can give a large range of people an avenue to see your work and get in contact with you if they want to use your work or commission something from you. That being said, I would highly recommend trying to find out more about how other photographers are earning a living, because I am unfortunately doubtful that this itself will lead to much cash flow. It's not because of the quality of your work or anything, more so just the reality of how often people purchase photos in this way. I think that would be one of the questions worth reaching out to professional photographers directly and asking them about. What are they're main sources of income?\n\nAnother thing you could ask professional photographers is how they protect their work. I honestly wish I could tell you more about that subject, but the main thing I understand from creative\/artist copyright is that you are automatically protected in most countries through the act of creation. This video is more specifically speaking to animators, but it is an interview with a copyright corrrespondent for a reputable animation website, and he is also talking copyright law generally for all artists:\n<https:\/\/youtu.be\/nXFH2L6vNbs>\n\nI totally hear you that all the artists you love are people who shoot as a hobby. I definitely didn't get interested in art because of knowing about people who were doing things to make money for their work. That being said, I did find that the more I learned about my field while in University, the more people I discovered whose work I really enjoyed who were making money doing it. Maybe something like Instagram could be an interesting gateway for you to both look for some of the hobby photographers you love, and then possible also discover others (for example looking at who they follow) who you like who might be making money with photography.  If you did find photographers on there who you liked, it could present an opportunity for you to reach out and possibly connect directly with some of them, and who knows they might even give you some thoughts on your work and what they would recommend you might do next based ",
        "ts": "1537434113.000100",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-09-20\/439413757218_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "YouTube",
                "service_url": "https:\/\/www.youtube.com\/",
                "title": "How to protect your art - Copyright for artists",
                "title_link": "https:\/\/youtu.be\/nXFH2L6vNbs",
                "author_name": "AnimatorIslandTV",
                "author_link": "https:\/\/www.youtube.com\/user\/AnimatorIslandTV",
                "thumb_url": "https:\/\/i.ytimg.com\/vi\/nXFH2L6vNbs\/hqdefault.jpg",
                "thumb_width": 480,
                "thumb_height": 360,
                "fallback": "YouTube Video: How to protect your art - Copyright for artists",
                "video_html": "<iframe width=\"400\" height=\"225\" src=\"https:\/\/www.youtube.com\/embed\/nXFH2L6vNbs?feature=oembed&autoplay=1&iv_load_policy=3\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen><\/iframe>",
                "video_html_width": 400,
                "video_html_height": 225,
                "from_url": "https:\/\/youtu.be\/nXFH2L6vNbs",
                "service_icon": "https:\/\/a.slack-edge.com\/2089\/img\/unfurl_icons\/youtube.png",
                "id": 1,
                "original_url": "https:\/\/youtu.be\/nXFH2L6vNbs"
            }
        ]
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "on their professional experience?\n\nInstagram is particularly popular amongst people involved in creative and visual industries, so on that side of things I think it can just generally be a useful networking tool for discovering, keeping in touch and meeting fellow 'industry professionals'. It sounds like you are somewhat more inclined towards personal\/non commercial photography, so maybe seeking out commercial photographers whose work you can appreciate or at least understand why it is commercially viable would be worth trying out using social media? When you mention being most excited about photographers who do it as a hobby, it really makes me curious about what kinds of work they do. Please do share more about some if them if you feel like it!",
        "ts": "1537434113.000200",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-09-20\/438827052049_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]