[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "No problem, I'm happy to help!\n\nGreat reel dude, it's cool to see that your skillset is so broad. Your work is really good and definitely demonstrates your ability, the main thing that sticks out to me is that if you were to send that off for a compositing role, then it may not land as well with it not being specific to the role. For something like comp, a recruiter is gonna want to see a reel with nothing but comp &amp; roto\/prep, with it being such a specialist role.\n\nI would say it would be a good idea to cut a reel for comp, lighting (maybe one for lighting &amp; comp combined for the 3D animation jobs) and one for look dev. That way you can show the recruiters for each job a reel that is specialised to the role, rather than have them see lots of work that isn't relevant to what they're hiring for. I think that would be a good start, and get those new cuts sent out to all of the jobs you find that you're interested in.\n\n- on a side note I love the look of the project with the 3D animation mixed with toony 2D elements for the dust etc, looks great!",
        "ts": "1568285314.002000",
        "username": "Liam Barlow (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-12\/751376995665_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thank you, that is great advice! I will try to keep the reels exclusive to individual specialisms.\n\nAlso, do you think large VFX studios such as MPC, ILM for example appreciate the composited cartoony 3D animation work or should the reels for those studios be exclusively live action or realistic animation projects?\nMore recently I have been working on personal live action VFX projects but I'm not sure whether to wait until I have a substantial amount of good composited live action work or just apply and demonstrate my compositing skills through the cartoony animations I have already.",
        "ts": "1568304025.002100",
        "username": "Michael Bond (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-12\/745433204530_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]