[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I have certainly heard of people being asked to remain until term starts at the end of their internships by the company that has taken them on. Something that you may not currently be aware of though is that the film industry is based around people being taken on for short contracts, so there are definitely prospects for getting something to fill a gap! As I am sure you are already aware, the hard part is getting your first break. Once you have a film under your belt it's much easier to build it into the career that you want. I would suggest having two demo reels at this point, one for comp and one for paint and roto (p&amp;r). That way you can tailor what you show based on what you are applying for. When I used to recruit for p&amp;r it was always interesting to see someone's comp reel, but what I wanted to establish first and foremost was whether they could do the job that I was hiring for rather than what they wanted as their next job! So a short reel of just strong p&amp;r work 1 minute to 1:30 ish duration would get my attention much better than say green screen keying or integrating CG renders. I can't speak for other companies (but imagine it's much the same), here at Framestore we do hire junior p&amp;r artists and also have a well established runner development program where runners are mentored into p&amp;r positions by more senior artists. If there's lots of work around and you can demonstrate that you are comfortable with the software that a vfx house uses you may well be recruited straight into p&amp;r. As far as I know, it is pretty unusual for someone to get recruited straight into comp, at least it is with the big companies. But don't let that put you off from trying, it can happen!",
        "ts": "1542387468.002000",
        "username": "Neill (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-16\/481160418801_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]