[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Sophie, Sorry for the delayed response. I have just wrapped on Detective Pikachu and been promoted to lead compositor :relaxed: so things have become very busy very quickly! Great to hear that you have been working on a short film, that kind of experience will definitely help with applying for future positions. Any experiences like that look good on a CV. I would be more than happy to look at any material that you are thinking about including in a reel. I don't really have any additional advice for applying for work \/ internships without seeing a reel. Having a good, succinct cover letter, cv and a short reel of your best (most relevant to the position) work should be sufficient in my opinion. Something that might be worth investigating would be <https:\/\/www.framestore.com\/work\/launchpad-pro> I don't really know a whole lot about it tbh but it's an initiative that framestore have undertaken to help get students their first step on the VFX career ladder I believe. I would assume that other companies run similar things, but from what I have heard internships tend to be oversubscribed and very competitive.",
        "ts": "1551286033.000200",
        "username": "Neill (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-02-27\/562494511940_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "Framestore",
                "title": "Launchpad Pro",
                "title_link": "https:\/\/www.framestore.com\/work\/launchpad-pro",
                "text": "Training students in the specific skills and knowledge expected within a junior role, this hands-on program acts as an accelerator for artists who want to kick start their careers in VFX.",
                "fallback": "Framestore: Launchpad Pro",
                "image_url": "https:\/\/www.framestore.com\/sites\/default\/files\/styles\/slideshow_images_medium_1400_788\/public\/case-study\/images\/apprentice-image-for-website.jpg?itok=BEMMOTX7",
                "image_width": 444,
                "image_height": 250,
                "ts": 1504796760,
                "from_url": "https:\/\/www.framestore.com\/work\/launchpad-pro",
                "image_bytes": 760863,
                "service_icon": "https:\/\/www.framestore.com\/sites\/all\/themes\/framestore\/img\/touch-icon.png",
                "id": 1,
                "original_url": "https:\/\/www.framestore.com\/work\/launchpad-pro"
            }
        ]
    }
]