[
    {
        "type": "message",
        "text": "yeah it was the module and I don't mind staying in London, I just really want to move out",
        "user": "U5YA86ZKJ",
        "ts": "1500211235.774221",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "g2349dfa2a91",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/a2349dfa2a91f67874ec7e1cac8356d0.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0010-72.png",
            "first_name": "Ugbad",
            "real_name": "Ugbad sharif",
            "display_name": "ugbad1",
            "team": "T4UUTPV18",
            "name": "ugbad1",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    },
    {
        "type": "message",
        "text": "Unfortunately there's always at least one really boring module they put in for 'classic' literature! My worst one by far was an 18th century literature module in second year where I couldn't bring myself to read all of the books because even the blurb sounded boring :see_no_evil: there was one about a man roaming around Scotland and jotting down his thoughts and observations...you get the gist. The good side is that you're free to write about which texts you want so you can dodge the worst ones. And see what choices you get in third year to make up for any dull modules. I did one on witchcraft and magic in literature which I really enjoyed\nDefinitely move out so you get the full experience, just check how much loan they give London students these days. A few years back I knew someone who went to Imperial and had to get about 75 quid off her dad a week cos rent ate up her loan, and you may not be the position to get that kind of assistance. Having said that, my brother is at Leicester and he gets twice what I got so they may have upped the loan for London students too. Just bear in mind how much more you need for travel and food and life here compared to everywhere else!",
        "user": "U5XFGLR7X",
        "ts": "1500211893.820069",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "1df66bfa0e19",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-21\/202263735607_1df66bfa0e1959635bd6_72.jpg",
            "first_name": "Sonal",
            "real_name": "Sonal Patel",
            "display_name": "sonal",
            "team": "T4UUTPV18",
            "name": "sonal",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    }
]