[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Dharita,\n\nNo worries at all. So I have recently qualified as an architect, you may or may know about the process but in short there are 3 parts. Part 1 is an undergraduate degree, I did mine at the University of Bath from 2007 - 2011. The course at Bath was four years long with two work placements in the 2nd and 3rd years. I worked in a medium sized practice in Bath called DKA and then in a small practice and a building contractor \/ property development firm in London the following year. After that I took a year out and then returned to do my Part 2 Diploma in Glasgow in 2012. I graduated from that in 2014 and moved to London permanently where I got a job at a fantastic firm called Allies and Morrison. I've been working there for the last 3 years and in 2016 I began my Part 3 which is the final leg of architectural education which is undertaken at the same time as you work. I finished my exams in the summer just past and so now I am able to officially call myself an Architect. \n\nAll of this probably seems like a lot when you hear about it all at once but you take one step at a time and although it is certainly hard work, I love what I do and the ability to be creative.\n\nWork experience is a great idea! You could start by getting in touch with architecture practices to ask about what sort of opportunities they have for work experience. I certainly found that taking the initiative to contact employers yourself is a great way to find out if they have schemes for students. You have nothing to loose in at least asking!\n\nDo you have any ideas about the kinds of architects or firms which you would be interested in? Don't worry if not, I can send you some names of different sized practices. Where are you based? Just so that I can help you gather a list of architects to approach.\n\nI'm not sure if the firm I work for have work experience opportunities at the moment but I will send an email to Human Resources to ask if you would like me to? If London is too far to be practical I can help you find some experience near you.\n\nBest,\n\nColeen",
        "ts": "1508080602.000042",
        "username": "coboyle (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-15\/255907914912_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "P.s. Apologies for the delayed response. I don't think my notifications are working so I'm going to try and fix them now! ",
        "ts": "1508080659.000087",
        "username": "coboyle (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-15\/256698625013_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]