[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "So with the closer of Telltale games, what are your thoughts on game developments ethics?",
        "ts": "1537692239.000100",
        "username": "Nana (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-09-23\/441103250115_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I say I understand where the employees are coming with their complaints of working overtime, but I have 2 main grips:",
        "ts": "1537692329.000100",
        "username": "Nana (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-09-23\/441208892738_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "1. I believe if you love something and want it to succeed, sometimes health is secondary. I get not working overtime unless you are paid, but sometimes that's part of the grind.",
        "ts": "1537692480.000100",
        "username": "Nana (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-09-23\/441017110900_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "2. The team itself seemed to be a little over-ambitious after the walking dead.",
        "ts": "1537695974.000100",
        "username": "Nana (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-09-23\/442571802806_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Ok, this is actually a very important discussion, because I've experienced it first hand. The film industry is incredibly similar to the game one in regards to it's ethics and crunch time, and it's something you have to be very aware and careful with.\nTo elaborate on your points.\n1. I understand what you mean, when you are passionate, you \"don't mind\" skipping meals, working 14hr days and sleeping 4hrs a night. But, you should avoid that at all costs, being mindful and healthy will keep you working better, and for the long term.\nStaying within your working hours will actually help you become more efficient and smarter in your workflow, because you have a set amount of time a day to get things done. The people who do work overtime, without being asked or payed, set unreal expectations of deadlines to the company, that later gets applied to the general and cascades to the whole structure.\nIt took me a while to figure out that a work\/ life balance is *integral* to long term productivity. There is absolutely \"burn out\", I've witnessed some of the most passionate Animators leave the industry from it, it's really disheartening...\nJust to be clear that you are free to do what you think is best Nana, I just want to share with you my opinion from experience. I'd suggest, if you can, speaking with other professionals about it, to give you different perspectives on the subject.\nMoving on to 2. I think they took more than they could handle for sure, but I don't agree it's the team's fault. Seems like it was poor management and business decisions, the team only does what they are told or allowed to do by the higher ups. And for a company that size to close in such short notice, means something was very wrong. Lets see what they say in a statement, maybe they'll shed some light on the reasons.\n:smiley:",
        "ts": "1537718629.000100",
        "username": "Juba (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-09-23\/441466594677_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]