[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Addison!\nSorry for really late reply, I've been on my work slack channel this whole time and didn't realise I got a message :persevere:\nI am really excited to meet you and really curious how did you get to where you are now. Did you study at University? or are you self taught? Did you go through intern\/apprenticeship or got a job straight away? Were you working somewhere else in the industry before?\nSorry, that's quite a lot of questions for the first message but I'm really curious.\n\nI've graduated from University last year (june 2019). Even had a job as junior compositor for a few months straight after graduating but I still feel I don't know enough. At the moment I am working as motion designer at an esport company in Poland as my motion graphics portfolio from University is way stronger than the compositing one. In my free time I'm slowly working on my compositing reel. \n\nIf there's anything thing I want to get out of the mentoring scheme, it could be some knowledge and a nice reel. I would love to join Framestore as they worked on His Dark Materials and having a chance to work on the next season would be like dream come true for me (I hope they will, you might know already but won't ask about it yet) . If not Framestore then any other studio will do as well. I loved working as a compositor for these few months during the summer and being able to control the shot and imaging other people reaction to it was something that brightened my days and I just want to be able to do it again. \n\nOnce again, really sorry for late reply. I turned all my notifications on now so I shouldn't miss your next message. I might be slow in replying due to work but for sure it won't be longer than a day or two.",
        "ts": "1579555182.000100",
        "username": "Klaudia Skalska (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-20\/914289136000_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey! Great to meet you. No worries, I find this with Slack all the time, if ever I don't reply in a day or so just send me another message as most likely the same thing has happened to me again. \n\nRegarding how I got in to the industry I was lucky enough to be one of the first apprentices which is now a really great well developed scheme and an amazing way in to the industry. I actually had the same problem as you, I was previously very interested in motion graphics and built up a really good reel of that but was lacking in the VFX but that's easy enough to sort (we can definitely discuss that as I'm working on an unpaid project on the side for a bit of fun I might be able to give you a couple of shots from) id love to see your VFX showreel?\n\nFunny you should mention His Dark Materials, I was the lead on that and it was so much fun to work on that project (and hopefully the second one) which is starting in a couple of months.",
        "ts": "1579555575.000200",
        "username": "Addison Petrie (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-20\/902826370499_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]