[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Sorry for the late reply, its been hectic at work this week. There are many ways for graduates to get into the industry, you can apply for junior roles but they are very difficult to get straight out on uni. Another option is applying for internships and graduate schemes at certain VFX houses. But the most common option is to apply to be a runner, which you help around the office for a year whilst you get further training in your desired job role then they move you into that role when your ready. I started in the industry as a runner",
        "ts": "1581065811.002300",
        "username": "Connor Woodey (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-07\/943706776022_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "It’s okay, I don’t mind I’m sure it gets super busy and I don’t mind waiting on your reply. That’s great that you were a runner, I’ve heard that a lot of senior artists all started from a runner position. I am hoping to gain an internship in the future but I’m sure they’re very high in demand. I hope you don’t mind me asking but what was the position you moved into after being a runner?  ",
        "ts": "1581090262.002400",
        "username": "Thomas James Harrison (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-07\/941622994724_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Internships are in high demand because lets be honest being a runner sucks. But you only do it for a short period of time and never again, and its the most sure fire way of getting into the industry. I was a runner for a year and now im a texture\/ lookdev artist with experience in hard surface modelling and character\/ creature sculpting",
        "ts": "1581092276.002500",
        "username": "Connor Woodey (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-07\/930680254931_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Being a runner doesn’t seem like the most glamorous job, but like you mentioned your working towards becoming a junior while still developing the necessary skills. That’s really cool, you have such a broad range of skills. If I were to land a runner position do you know what type of salary I could expect?",
        "ts": "1581093499.002600",
        "username": "Thomas James Harrison (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-07\/942211272373_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Well Cinsite is the highest paying at £19000, so  not alot really. But your money will increase once your a junior",
        "ts": "1581103749.002700",
        "username": "Connor Woodey (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-07\/942535586101_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That is a lot as I’ve heard of some around the £16000 mark. My friend recently got a position as a runner at Cinesite. I’m know that contracts don’t really last that long and you usually get 3-6 month contracts. I was wondering how you would negotiate your salary without under or overcharging?",
        "ts": "1581115762.002800",
        "username": "Thomas James Harrison (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-07\/942369265556_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]