[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thanks for all this information, really helpful, I know this is a hard one to judge but if I do narrow down my areas of choice, where would you say more job opportunities are in, being an artist or animating. Like I said I enjoy the whole process but at this point I'd rather focus on an area that i am more likely to get a position or experience from.\n\nAlso how would you approach getting experience, is there anyway that could help?\n\nRegarding interviews as well, what does a typical interview consist of working in 3D?",
        "ts": "1580464841.002100",
        "username": "Owen Calderbank (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-31\/930279894164_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I've been using indeed mostly to look for opportunities but is there any job sites that are really good for creatives?",
        "ts": "1580464900.002200",
        "username": "Owen Calderbank (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-31\/932946748310_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I understand the desire to just get a job but I really value happiness in a job. It's easy to say now that I'm in my current position and I've definitely been in yours before so I understand it's not always that easy. If you enjoy everything then I would say to pick the one you enjoy the most. If you can do everything then you've got good chances of getting a job. I don't know that I could tell you which areas have the most jobs as I've only ever looked for animation jobs. You'll have to do your own research for that I'm afraid. Just check the company sites and see what they're advertising. It will likely always be different depending on a number of factors like what employees the company already has, what they need in the future, employees leaving etc. It's really hard to tell which jobs are more available than others.\nAny job you get that you enjoy doing will likely give you a positive experience. Remember you'll be doing this for 40+ hours a week so it's important to enjoy it.\n\nGetting experience really only comes from working or practising at home. Your reel looks like you have quite a bit of experience already so you've got a good start. Sometimes you may have to take the less desirable jobs to get a bit more experience. You may find you get a lot of short contracts to start and then once you build up a bigger portfolio and some more experience you're likely to get longer contracts or extended contracts.\n\nI have to admit I've only ever really had 2 interviews. One for matchmoving, one for animation. Both were very relaxed and more of a chat than a real interview. They still want to know what your experience is and how you are as a person so just be relaxed and your usual self and I'm sure you'll be fine. In a lot of instances they will know your skill becuase they will have seen your reel. The interview, if you have one, will be just to have a chat and see what you're like.\n\nIndeed is not a great place to look because it covers all bases. Like <http:\/\/Reed.com|Reed.com> and those types of places.\nSign up for some agencies. I'm signed up with Aardvark Swift, Amiqus, OPMjobs, Datascope etc. Although they've not been especially effective for me because I'm really quite specific about the job I need. Because you have a wide discipline you might have a bit more success. Apply through their websites and you'll likely get a phone call soon after to have a chat with a recruiter so they can flesh out your profile to make it easier to get you a job. They will probably be better at telling you what positions are most available at the moment actually.\nAre you on LinkedIn? If not, get on that and fill out profile as much as you can. Sign up for groups on there. Make connections etc. I get quite a lot of my job offers through LinkedIn rather than the recruiters.\nOther than that it's just a lot of Googling and apply direct through companies websites.\n\nI was shown this recently.\n\n<https:\/\/docs.google.com\/spreadsheets\/u\/2\/d\/1eR2oAXOuflr8CZeGoz3JTrsgNj3KuefbdXJOmNtjEVM\/htmlview?sle=true#gid=0>\n\nIt's a continually updated spreadsheet of current jobs. It's worldwide and for all disciplines. You can filter then as well to make it easier to search what you want.\n\nI know what it's likely to be in your position and I know it can be quite difficult at times. As long as you throw yourself at it and push to get a job, with a bit of luck thrown in I'm sure you'll find something.\n\nI know it's all quite vague and there are no real straight answers but hopefully it helps.\nOf course, keep asking questions if you need to and I'll keep helping where I can. =]",
        "ts": "1580473162.002300",
        "username": "Steve Kimbrey (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-31\/919429248115_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]