[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Shana! Just to let you know that I read your  messages and I will write you properly asap! It’s been quite busy and I want to take the proper time to check everything and get back to you!",
        "ts": "1579093691.003300",
        "username": "Enrico Buffa (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-15\/895906465619_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Take your time Enrico, I completely respect that you must be very busy working at a studio. I am flexible and happy to wait between responses.",
        "ts": "1579114780.003400",
        "username": "shanapoly (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-15\/910216599942_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thanks Shana,  I appreciate your patience. So I started my first children’s book when I was in Ireland and it took me one year from writing the story to the finished book. Since it was my first one I had to do it after work in the evening and during my weekends! It was intense but I’ve been happy with the result. After writing the story and what words to use on every page, I did a storyboard in black and white to plan the images and see if it was working and I was liking it. I used watercolor at this stage just as fun\/practice and pencil.\nOnce everything was ready I started realizing the final illustrations on big A1 pages. I used watercolors and pastels on top. I self-published as I wasn’t having an editor, so I did my editing on InDesign and then printed copies in a shop. I can say I’ve learnt alot, what to do and what to avoid. I hope to write something new soon.",
        "ts": "1579118762.003500",
        "username": "Enrico Buffa (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-15\/909984858423_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I saw your tumblr and website and I like what you are doing. I can see that you have a clear direction and it’s very illustrative. I like how you try to give the mood and depth just by using the color, always focused on the story. I like those about Bologna! Your work is very inspirational especially when it comes too mood and storytelling, very important also on features. I would say, that if you want to do more concept art for animation and visual development for a production (also for tv!) you can try more also using perspective, placing the characters with the correct size comparisons... if you are on a 2D or 3D production, is really important to give a correct sense of space for the action...and of course you can still place the camera wherever you prefer in order to tell the story!",
        "ts": "1579119791.003600",
        "username": "Enrico Buffa (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-15\/908163018245_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "if you want to also get better at characters I would suggest (to add to gesture which is a great exercise) to do more life sketches of people and try to do their caricature. after the caricature step you can simplify the shapes into a second drawing and this is how you can create a cartoony character that could work for a tv production! Simplicity and simplify the shapes is necessary especially when it comes to productions where many artists are working on the same characters! this is different from a personal character or gesture drawing where you can have the “expression” of the hand.",
        "ts": "1579120088.003700",
        "username": "Enrico Buffa (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-15\/910019975639_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "your work also reminds me of this amazing artist which is art director here in London. He also simplifies the shapes but keeping in mind the production needs! (structure like perspective and dimensions, stylization of shapes, story, color and mood) ",
        "ts": "1579120288.003800",
        "username": "Enrico Buffa (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-15\/907710378628_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "<http:\/\/www.aurelien-predal.com\/mune|http:\/\/www.aurelien-predal.com\/mune>",
        "ts": "1579120372.003900",
        "username": "Enrico Buffa (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-15\/907712722772_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Oh yes! I know of Aurelene Predal, Lock Smith animation Studios is close to where I live and so I was very eager to learn about the artists that work there when they first founded the company- the building was empty for a while. I am very excited that there is a feature animation studio and was thinking on how to approach them as a runner, but I do not think they are taking any runners or interns.\nI really do like the works of Aurelene pedals, I really enjoy his use of colour, sharp shapes, and how he’s able to also control chaotic strokes. I am also inspired by the works of Chris Appelhans, Tadahiro Uesugi, Hans Bacher, Zao Dao and Claudio Acciari as well and would love to find ways where I can construct scenes that uses scale, pattern, simplification and colour\/lighting as they do to tell story and moods.",
        "ts": "1579126762.004000",
        "username": "shanapoly (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-15\/910542885750_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I can focus and do some character studies in the way you have described this week?\nand maybe there is an exercise I can set my self to see how I can construct one scene (paying attention to perspective) and insert a character to show some sort of sense of space through scale and mood? \n(maybe thats a lot to do in one week, but I can give it a go)",
        "ts": "1579126846.004100",
        "username": "shanapoly (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-15\/907881559556_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "May I ask, when it comes to things like this, how can you structure your project\/practices\/development without getting too overwhelmed by trying to do to much at once?\nWhat sort of self management\/pacing has worked for you in order to keep focussed\/ disciple yourself to work through\/start on a project?\nfor example what made you want to start your storybook project, and how did you maintain consistency\/motivation working on it for the whole year?\nAlso what inspired your story to make the Illustration book?",
        "ts": "1579126919.004200",
        "username": "shanapoly (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-15\/908349460757_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Another Artist that is currently working at Locksmith that I really like is Mike Redman, I suggest you to check his work, you can find him on instagram as well. Actually I saw they are currently looking for a runner or a similar position if I’m not wrong. I would suggest you to check their website in case. I’m super glad you have *great* artists and designers as inspiration! Means you can understand and recognize good design! These artists have a great sense of composition and design, is not easy of course to be at that level. The most important thing of course is always the story and the action, what is happening. I guess is always good at this stage to make a research of pictures and photos. You can divide you research by: what is happening (example, lady in a coffee place) , location (how is the coffee place) and mood (is it a night or daytime, sunset etc). Then you can start planning your image by doing some quick thumbnails, where you can chose how to frame it, where to put your perspective points if view, if you want your image to be more or less dramatic or very stable and symmetric etc. After you are happy with your thumbnails you can pick one or mix some elements you have on paper and start planning the final image. ",
        "ts": "1579133488.004300",
        "username": "Enrico Buffa (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-15\/908465103136_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "yes you can start doing some copies of people, that gets close to caricatures. (for this exercise I would suggest to pay attention at some feature of the person we are copying, not as loose as in life drawing\/gesture but trying to keep a more defined sense of design and structure\/anatomy. This exercise is not for you to have a nice ‘stroke’ or ‘expressive line’ but mostly to quickly observe, get inspired and put on paper a caricature of what you just saw, eventually creating a little story(like adding a second character or a prop to interact). After a bunch of these studies\/caricatures\nthe next step will be develop those you like the most into a proper character design that could work for animation. At this stage you can add\/change\/ explore different shapes and details, solutions based on the caricature\/character you did previously. Is basically going from real life to stylized\/cartoony. In every stage a sense of correct anatomy and geometry (even when you start simplify the shapes) should be there. Thinking about 3D volumes like spheres, cubes and cylinder can help. Let me know if it’s clear!\n",
        "ts": "1579134426.004400",
        "username": "Enrico Buffa (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-28\/890308838518_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "A good exercise are little thumbnails! you can quickly experiment with perspective and characters without wasting too much time and have lots of different solutions!",
        "ts": "1579134520.004500",
        "username": "Enrico Buffa (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-15\/898275938577_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "the pacing and management depend also on how much time you have to dedicate to sketching and work on your personal stuff! Like, in my case, I could do only after work...and on weekends! You don’t have to kill yourself of work, otherwise you just get tired and becomes not fun! It has to be enjoyable time you give to yourself. You can decide to give a day for each exercise: on Monday morning I do thumbnails with perspective exercises\/cameras and characters. In the afternoon I practice my character design skills by doing life drawings\/caricatures and some character development (can be a cartoony character with different costumes, poses, a turnaround and expressions) -&gt; I know it’s a lot of work!! but it’s exciting!",
        "ts": "1579134831.004600",
        "username": "Enrico Buffa (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-15\/898281091089_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "When I did my book I really wanted to tell a story because I felt my job was killing a bit my inspiration and soul ahah. So I needed something that kept alive my passion for drawing and painting. Working on a production sometimes can be draining. I was really committed to finish the book so I was working on it every evening, so it became a routine to me. And I was impressed when at the end I realized that I did it! So I know that I could do that again! At the beginning I wrote this story for a short film, but then decided to switch and adapt it for a book as it was more doable by myself - I had no a team for a short film! But still I had the chance to tell that story and I’m happy with the result. And very creative and free since no one was telling me what was wrong or not , so it’s been very liberating!",
        "ts": "1579135147.004700",
        "username": "Enrico Buffa (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-15\/895705877474_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I guess creating a schedule\/ calendar can help to keep you focused day by day on your exercises: you can divide the day in two part and two different exercises for example. Don’t keep it too busy tho, otherwise is just too overwhelming.",
        "ts": "1579135263.004800",
        "username": "Enrico Buffa (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-15\/908036217028_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]