[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hello Enrico, I had a look at the nextgen apprenticeships, and I do think I can apply to this, But Thank-you!",
        "ts": "1581165293.004800",
        "username": "shanapoly (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-08\/943231941733_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Regarding the schedule. I definitley struggled with this schedule and realised very quickly that I could not keep to it- additionally my frustration led to me unable able to maintain productivity. In part I think It was very difficult to maintain productivity across so many different projects in a single week. I think this is because all of these projects are completely self initiated and is quite mentally exhausting to come up with so many new project ideas- and so I am not only illustrating and animating, but i am also having to research, manage, produce, and to juggle between so many different projects with different processes that required different approaches\/needs was difficult.",
        "ts": "1581165605.004900",
        "username": "shanapoly (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-08\/943233917189_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "The picture book and animation project are both big undertaking- especially since it is my first expirience to work on these two types of projects- There is a lot of trial and error and so I will need to factor in some flexibility for days when I am unable to find inspiration and lack productivity. How did you manage this when working at your employed position and doing your passion projects- did you have days when you could not progress with the project very much and what did you do?",
        "ts": "1581165764.005000",
        "username": "shanapoly (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-08\/933067398449_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Also, because I have had not much expirience working under a studio or artist I am also having to learn skills and managing projects completely on my own which requires extra time just to learn these things-and I completely forgot these aspects- I realised my expectation of myself was perhaps unrealistic.",
        "ts": "1581165851.005100",
        "username": "shanapoly (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-08\/943235522469_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I feel that perhaps at the moment I should focus on building confidence in my drawing and storytelling skills as a illustrator through shorter projects. and work on the animation project bit by bit by using what I am learning from the shorter projects to feed into it.",
        "ts": "1581166065.005200",
        "username": "shanapoly (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-08\/943216640992_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Regarding the picture book, I feel that I should slow down with it and focus on just getting the manuscript done with thumbnails, to a point that I have a full story outlined, but work on it  whenever I feel I have an idea rather than forcing a day or hour of each day to work on it- therefore I am not forecfully pushing myself to have an idea, but letting it develop. This is because despite having said I am in the process- the themes\/story is still rather unclear though there are some elements I know I want to include.",
        "ts": "1581166386.005300",
        "username": "shanapoly (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-08\/942764207892_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I have a question about maintaining creativity whilst in a full-time role as a concept art\/ visual development. Since your role is quite often coming up with ideas and to visualise them- have you got a process that helps you find ideas everyday? have you a process or method that helps you best to come up with ideas? and how to a manage a productive day compared a not so productive day look like for you at the studio.",
        "ts": "1581166926.005400",
        "username": "shanapoly (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-08\/931754372675_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]