[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Cool. Again I really like the reference. That is completely the type of thing I might be asked to do for work and I dont think it is overly ambitious. And you can do whitewater and it is not a river shot like everyone else has. Off the top of my head I would maybe recommend you think of a few things. First see if you can split up the spaces in to separate sims and blend back the meshes together after simming. Maybe do the stairs and about 2-3 feet around the bottom of the stairs as one flip sim. Then treat the rest of the area around the ground as a separate sim, just make sure you have a bit of overlap between them. That way if you want to change stuff on the stairs you dont have to resim all the stuff on the ground. Also work low res and sim small areas first to make sure everything is working as expected. So for the stairs, dont sim the total width of the stair case, just sim a quarter of the width at low res to make sure it is working. Also try to make your setup so you need as little preroll as possible. So dont start with dry stairs and just dump water down them. Start with a layer of water on the stairs on the first frame to get everything going faster, it will save you a ton of sim time. Most of my fluid sims at final res should be in the range of 1-3 min a frame. 3 min is actually fairly high, but sometimes necessary. Your low res sims should be around 20 seconds a frame. I'll think if there is anything else I'm forgetting. But thats a good start. Oh also maybe think of building your scene so the stairs are aligned on an axis like x or z. It is common to get weirdly aligned tracks or geometry from tracking. When that happens one of the first things I might do would be to align the entire scene cleanly along an axis, do my work and then transform everything back before rendering or exporting geo. Let me know if you run in to any technical issues and if you have anything you want me to take a look at.",
        "ts": "1580226159.001200",
        "username": "Eban Byrne (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-28\/925514130053_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thanks so much. That's awesome advice, and I will try and put it into practice; however, since I'm extremely new to fluid, I do have a couple of questions. \n\n1. How would you go about simming the areas separately and blend back together? I've heard reference to this method before, but never fully explain how to it's achieved. If the stairs are creating ripples at the bottom of the specific sim, how can this be transferred to the surrounding area sim afterwards?\n2. What would your recommended solution to creating a layer of water on the stairs to reduce preroll? Up until now, everything I've seen or been taught has mentioned the previous method of dumping water down the staircase? \nOn a side note, I forgot to mention that for the time being, the sim aims to try and recreate the water as photo-real as possible but would be rendered on a CG background, with the possibility of integration at a later date. I'll let you if any more questions arise. Thank you.",
        "ts": "1580267826.001300",
        "username": "Luke Vuilliomenet (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-28\/928777373270_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]