[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I came to my A level choices completely on the basis of my own wish. During my time in High school I have always enjoyed English Literature, Sciences and Math, however I found Mathematics always challenging but enjoyable at the same time hence chose Mathematics as an A level after getting a B at GCSE level.\n\nI found about ACCA on the basis of my own research. \n\nSchool is going good, before i started year 12 my head of maths teacher told me i could not do A level mathematics because obtaining a B at GCSE level maths was not good enough for A level hence advised me to change the subject.\n\nHowever I really wanted to do A level Mathematics hence arrived at the decision to do in independently, on my own behalf hence convinced my head of sixth form to permit me to do 2 A levels (English and Biology) and Math was the subject i will do independently.\n\nBy the time Year 12 exams arrived, I managed to get a B for my AS mathematics and obtained two Ds for my other subjects I did at school. Which I think is pretty funny. \n\nI am now in Year 13 doing my last year of A levels and have practice exams in a week. The preparation for it is ongoing and will let you know of the results once theyre completed. \n:blush: :blush: \n\n",
        "ts": "1540401012.000100",
        "username": "Iram (Mentee)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-10-24\/463465562467_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I would like to know more about the world of finance and what it is like to be working in such a developing industry and what are future prospects like for ACCA accountants? ",
        "ts": "1540401176.000100",
        "username": "Iram (Mentee)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-10-24\/463565049634_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]