[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi, I am Iram,\nI am currently studying 3 A levels in English literature, Mathematics and Biology. I plan to gain an accounting apprenticeship after Y13.\n\nMy future goals is to complete all ACCA exams and become an ACCA member.\n\nTo kickstart this conversation, I would like to ask you, How you ended up in the industry of Finance? \nWhat was your educational journey\/career path like? \nWhat A levels did you study that has helped you in your career in finance? (What skills did you learn during your time studying for A levels). \n\n\n\n\n",
        "ts": "1539850650.000100",
        "username": "Iram (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-18\/458917531538_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hello Iram,\n\nI am really happy to be your mentor and I am hoping I will be able to help you. \n\nTo answer your question, I ended up in Finance mainly because of my Mum:-). My parents had a restaurant and when I was about 13 year old she asked me to do her purchase book and her cash book:-)! Big books they were. I had no idea but I started doing it and I liked it. She also then asked me to bring the Cash of the restaurant at the bank because I was in college in the big City. I must have been 15 year old. She trusted me so that is something that stayed with me. \nMy A levels were almost like yours: littérature, Mathematics and Economics. \nSo I did not know yet at that time that it was going to be finance but I knew I wanted to go to a business school and I did not want to go to University. It had also to be International (I knew that as well). \nSo it became an international business school. I had to take some loans because my parents did not have the money....\nI will tell you later about ACCA.\n\nHow did you come to your choice? \nHow do you know about ACCA??\nIs school going ok??\n\nChristèle \n",
        "ts": "1539895039.000100",
        "username": "Christele Brouste (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-18\/459357747588_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]