[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "glad you got it sorted. I have been using redshift for a while now, its incredibly quick (as it runs on a gpu) but does have quite a lot of shortcomings, its a bit like driving a very fast car that your mate built in a shed.. quite fun and exciting, but slightly scary and prone to breaking. We were taught arnold, which is much more stable and compatible (redshift has a habit of having a lot of its own nodes), but is very slow and cpu based - i think they've released\/are releasing a gpu accelerated version, which will be great if it can compete with redshift speeds. Haven't really used renderman, so i won't be much help with anything RM specific. Have you put any of your tests up on artstation or anything?",
        "ts": "1569932988.003000",
        "username": "Alex (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-01\/781315087367_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I think it’s a shame that some of the bigger companies don’t put out student licenses. I can understand why but it’s hard for people to learn something if it costs £1000 + and they’re not sure if they’ll like it. That said all seems to be ok at the moment. I’m a bit of a perfectionist so I haven’t put anything on art station because I don’t feel like there’s much to put. Especially since some of the stuff on the front page is incredible. I’m currently going through one of the Houdini tutorials from the website you talked about earlier. Have no idea what going on but I think I’m picking up some of the stuff. There’s definitely some key codes and stuff you need to know to get the stuff up and working. I think I might post it if I can get it working and textured",
        "ts": "1569943146.003100",
        "username": "Harry Wilkinson (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-01\/779259094708_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]