[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "i dont have any personal xp with c4d, but we've had freelancers based in c4d - my two pence is that c4d seems to be a lot quicker for getting something decent, and there's a lot more you can do in render, more lens fx and that kind of stuff, but with less fine grain control to do that final 10% polish, I think maya is generally a lot more clunky, and as you say, it's finicky to get where you want, but that's kind of a sacrifice for having more control. C4D has some brilliant motion graphicy tools and seems a lot more stable than maya, i used to be quite envious of some of the tools in it, but generally gets used more by one man band kinda freelancers, who and it married up with after effects for compositing, whereas maya tends to get put in pipelines with nuke, and used more by people who don't also wear compositing hats, if that makes any sense..!\n\nHave a play, and see if you gel with it i guess, at this point it's almost less important what you're using, there's so much to learn that's transferable! I learned 3ds max as a teen and then switched to maya for university",
        "ts": "1581508105.000200",
        "username": "Alex (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-12\/948633585813_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "*and is married up with after effects for compositing",
        "ts": "1581508141.000300",
        "username": "Alex (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-12\/950475939095_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yeah I’ve been looking around on reddit and most people are saying that maya is the way to go rly. Tbh I’m trying to focus on houdini at the moment because seem rly rly powerful stuff, no idea how to marry it into maya tho cus no idea the different file types for different simulations",
        "ts": "1581543091.000400",
        "username": "Harry Wilkinson (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-12\/949715107189_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]