[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "My journey into the industry is a little varied but pretty similar to a lot of peoples.\n\nI studied computer games design and production at university which taught a broad range of subjects some better than others. For my Dissertation I researched subtle player navigation techniques and how they can used to guide player. This had a heavy emphasis on level design which was what I wanted to specialise in. I built a demo that incorporated some of the techniques.\n\nI didnt do a placement year and went straight into my final year. During final year I interned as QA and a designer for nosebleed interactive which allowed me to see what it was like to work on a live project. This meant shortly after graduating I had been credited on a released game. This isn't a opportunity that will be available to everyone but one I happened to discover through networking within the local industry.\n\nCoatsink was my first full time gig where I started out as a junior designer and worked my way to becoming a Lead. In my time there I shipped 5 titles and worked quite heavily in VR. All the games I helped develop there were made using Unity.  I was with the company for for just over 3 and half years before leaving to go freelance while I figured out what I wanted to do next.\n\nWhile freelancing I worked closely with Pocket Money games where I helped the studio to consolidate its portfolio and get a handful of projects off the ground. I helped put together the studios booth and demos for EGX REZZED 2019. One of the main projects during my time there was the Superhot quest port.\n\nThen in May of 2019 I moved to Brighton and joined Hangar 13 as a level designer.\n\nOther things I have been involved in\/done:\n• Established a game dev meet in Newcastle \n• Create and ran a Unity User group in Newcastle\n• Helped to create and curiate speakers for NOVA game Conference \n• MCV\/Develop 30 under 30 2019\n• Full Bafta member\n",
        "ts": "1576675684.002500",
        "username": "Jonathon Wilson (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-18\/865824874578_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]