[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi David. Nice to meet you. Also, thanks for taking time chat. Much appreciated. \n\nI’m currently working at an architectural company in central London as a visualisation artist in the Lighting team. And have been doing so for the last 7 years. I studied computer visualisation and animation at Ravenbourne and graduated in 2010. I’ve always been looking move into the entertainment industry ever since. \n\nThe team I currently work with need visualisation support for client presentations etc. But its always abit as and when. Ive been developing my portfolio over the last 3 years or so to focus more on concept art and attempting to expand into 3d more to avoid narrowing my job options. \n\nI noticed you currently work at Framestore. I worked there briefly after graduation as a Runner. Feels like a while back now though :joy: \n",
        "ts": "1575881463.001600",
        "username": "Sam Saunders (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-09\/865089633397_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Sam! Great to hear from you.\n\nI’m intrigued by your work in lighting in archviz, do you have any examples? Also I have no idea what software you use or are used to etc. But it sounds like you have a good background and experience to make the move into entertainment\/film\/tv so I guess it’s just about presenting your work in the right way and plugging any gaps. I have so much advice on getting into the industry as I didn’t do it so long ago. And although I came through a masters degree I know lots of different routes (having tried a few myself!)\n\nYes I’m at Framestore at the moment, I’ve been here for three years. It’s really good that you had runner experience here, there’s probably a lot of the same people still knocking around!\n\nDo you have a specific area of the industry you want to get into? Or dream projects to work on?",
        "ts": "1575904354.001700",
        "username": "David Sheldon (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-09\/852783612706_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]