[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Toby, nice to meet you, I’m Marie\n\nFirst of all, such a cool showreel! I see you have a lot of creature animation- is that what you are most passionate about?\n\nMy knowledge of the VFX industry is rather limited so it would be really cool if you could tell me a bit about how the VFX pipeline works. I would also love if you could give me some feedback on future animation projects!\n\nI’m currently studying animation at Bournemouth Uni and now entering my third year. I’m from Denmark and have previously studied graphic design and fine arts doing a looot of life drawing. I’m tilting towards the more artsy side of the industry as I’m really passionate about character design, storytelling and most of all animation. I have only been animating for half a year so everything is still very new to me so I would love if you could guide me through the process and let me in on all your great animation secrets :smile:",
        "ts": "1570044747.001800",
        "username": "Marie Geert Jensen (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-02\/770129139187_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Btw, I’m doing a pitch next Tuesday for a major project so if you have time at any point I would love your opinion on the idea, the storyboard and the character designs",
        "ts": "1570044791.001900",
        "username": "Marie Geert Jensen (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-02\/770129899763_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "hey, Thanks! I started off more on the character animation side, but now I seem more into creature stuff. That was mostly out of necessity due to available work at the time though. Theres a lot more opportunities for animators who want to just do acting and character work.\nI would be more than happy to get in there and offer you animation advice and feedback (I feel like thats where I would be most useful)\nand of course happy to listen to your pitch - I'm by no means an expert on design and story etc but happy to offer an opinion.\nIm trying to organise a skype or discord sessions with my other students this weekend (probably Saturday) Would that be something you would be interested in ?",
        "ts": "1570046874.002000",
        "username": "Toby Winder (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-02\/781188986116_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]