[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Julien,  it's good to hear from you. I hope I can be some help over the coming months.  I see you have some interest in vfx and previs.  I also understand where you're coming from, when you're wondering what type of animation you want to do.  It might be a case of getting work where you can at first and seeing if you fit in to a certain industry.  We had a guy on our team who then went onto work on the Spiderverse movie.  I worked in VFX final animation for years before jumping at the chance to join the third floor, as i found it the most creative part of the film making process for me.  But you've got to go with what you love doing.  You may want to join a company like axis animation, as they're work is pretty stylized.",
        "ts": "1568146019.002400",
        "username": "Stewart Ash (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-10\/742834931202_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I can tell you a little about myself if you like.  I studied animation at Newport, but they never really taught us that well, and i went away with just teaching myself how to do stop motion animation.  But that was a dying art and not many jobs so i eventually taught myself maya whilst working at a commercials company in Soho.  That luckily gained me enough of a showreel to get a job at DNEG, which was a pretty small company  at the time.  I then spent almost 8 years at dneg doing animation, previs, lighting and rendering and anything else really.  I found that i really didn't enjoy the final animation side of things as you could spend weeks tweaking an animation, and then when it came to the final render you might not be able to see it behind all the fx in the comp.  I guess i realized that i really enjoyed previs, and that i was quite good at it.  So I jumped at the chance to join the third floor when it started in London and I've been there ever since.",
        "ts": "1568146654.002500",
        "username": "Stewart Ash (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-10\/742848427010_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That’s really interesting and great to hear, thank you!",
        "ts": "1568147996.002600",
        "username": "Julien Rashti (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-10\/757866138918_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I hear a lot of artists move where the industry takes them to different corners of the world but it’s very refreshing to hear that you stayed here and made your success here",
        "ts": "1568148077.002700",
        "username": "Julien Rashti (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-10\/744188519283_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]