[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hmm, I think once you know the basic software interface it becomes your wider artistic and technical skills that set you apart.\n\nFor the MA how about a Google search - search VFX supervisors and 2D Lead and Comp Lead and then see what and where they studied. That might give you some hard data.\n\nThing about the industry is that there are changes. I don't think Nuke is going anywhere soon and even Maya which has improved very little is so deeply embedded. But things like realtime, machine learning, even Blender become more professional.\n\nI have some similar debates going on. One of Us offered a 1 year contract and have some very cool projects, I also had a second interview at Dneg and I have never worked at one of the big studios so I'm pretty tempted to give that a go.\n\nFor python, it's not a VFX course but Automate the Boring Stuff with Python I found really useful  - I was able to create automatic Slate tools for Molinare with that stuff. There's a Coursera Rice University one where you make an asteroids clone. That stuff is pretty fun and with that base it's easy to get your head around the manual and make some useful things. Nuke Python courses tend to just teach recipes so it's hard to extrapolate. Learn Python the Hardway will drill the syntax which makes coding less frustrating (most times a script fails because of a typo). With that knowledge just try downloading some useful python scripts from Nukepedia and tweaking them to suit your needs. \n\nLife drawing and perspective drawing is really great to get down and definitely keep up the photography - very helpful to be able to look at a shot and ballpark the lens by eye. \n\nComputer Science is great for Pipeline roles and super technical roles like FX Tds but even then not all Houdini artists are as super technical as you might expect. Suck it and see works for most. \n\nRight now I would say your reel is not in a bad place you have industry contacts and a client you've already worked with so I would probably advocate just getting out there. When you're working your ideas about what to study will become clearer.\n\nCleanup\/Prep is where you learn most Compositing skills and develop your eye for detail, lens, colour and movement.\n\nFor online courses FXPHD has some great ones especially Victor Perez, Russell Dodgson and Tahl Niran.\n\nOn Set and soft skills can't be taught this way but  soft skills you can learn from people around you and going to events.  On Set skills may change completely in the time it takes you to actually get to supervisor. Most I know who have made that step did it by supervising short films weekends and in gaps between comp jobs. That's another reason try to maintain a little crew from your fellow students. If you are tight with a director when both of you are starting out then they will probably call you first when they are big, provided you're keeping pace with them in terms of advancement.",
        "ts": "1573504954.000700",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-11\/829698073220_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]