[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Wow! I get that, even when I was growing up I'd be fascinated with those films. Ghostbusters and Back to the Future were strong inspirations for me too because my parents loved those films. It can be easy to forget how much accessibility to the industry has shifted. I've only ever been met with support when I say what work I do (even if they have no real idea what I'm on about!) and the fact that there's now a good few known paths into the industry is pretty mad. I originally wanted to become a film editor when I studied media but one of my tutors in college got me into VFX. I love the consequential move to Italy. Did you do a lot of your learning and freelancing there then? I've heard a lot about Shake. It seems a real shame that Apple bought it and ended up killing it off considering the legacy it had. It's pretty amazing that you're doing all of this and having a family at the same time. Congratulations, I hope they are well! How did you find freelancing compared to your permanent positions, since it seems you've got good experience with both and changing between them? How was Molinare? Do you have a favourite show you worked on there or a particularly memorable job? Possibly a stupid question, but what does specifically being a contractor entail?",
        "ts": "1568201897.002600",
        "username": "Michael Vodden (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-11\/755886824964_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Forgive me, there's a lot of big questions, so please just respond at your convenience!",
        "ts": "1568201958.002700",
        "username": "Michael Vodden (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-11\/743578264546_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Also, how is it now working at One of Us? You've got quite a wide range of experience so I'm really curious how it compares to the work you've done before and if it's different (or not) to what you did or might have expected earlier in your career? Thanks so much in advance. Sorry to just sorta bombard you!",
        "ts": "1568202154.002800",
        "username": "Michael Vodden (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-11\/758219967575_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey, I'll try to get these one at a time:\n\nThere's not a lot of work in Italy but I did do my first gig on a film called Baaria, but I taught English and did a lot of tutorials and short films, low budget music videos After a bit I moved to London and freelanced. Back  in the day Escape ran an agency and even though I didn't study there they got me a few gigs, a mix of commercials and TV. Nice thin NG about those gigs is you can get material for your reel much quicker than with film where you might be working 2 years and still have your student reel.\n\nHaving kids meant I aimed for permanent work. As a freelancer you don't get sick or holiday pay, paternity etc... That's why I chose McCann over a job at Cinesite at the time. As a freelancer are a business and receive gross pay. That means you have to put money aside for the end of the year when you pay your taxes. Keep those receipts! If you buy a camera, graphics card, rent Adobe or pay for a tutorial that's all tax deductable some other things are too so check up on it.\n\nAs a contractor you are PAYE and possibly with holiday and sick pay too, but your contract has an end date. Both Molinare and one of Us have lovely teams and a great atmosphere. I have written a longer thing about small vs mid sized studios about the differences which I will send you.\n\nAt Molinare I really enjoyed working on Yardie because I got to work with Idris Elba, being a smaller movie and being the lead I was in client attended sessions. I also really liked a Nat Geo show Year Million as I got to be really creative making futuristic effects. I am really enjoying the show I'm on now but under NDA for the moment!",
        "ts": "1568233717.002900",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-11\/745654985075_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Small facility:\n\n\n\nUsually start between 9 and 10. Very often there won't be separate departments for roto, cleanup and matchmove so a lot of these tasks will be done by compositors too. \n\n\n\nJunior artists will do more roto and cleanup but will also get more opportunity to do simple comps (like screen inserts) and even some bigger comps. \n\n\n\n\n\nSenior artists on the other hand will be expected to perform simple tasks much quicker and will also handle trickier shots that come in or even take over a shot a junior has been struggling with. \n\n\n\nUnlike a larger facility senior artists will still be expected to handle some cleanup shots. \n\n\n\nMost work will be 2D and 3D will be limited to simple things (a plane in the sky, background elements etc...) full CG environments, CG creatures or big simulation stuff is unlikely. \n\n\n\nOn TV and advertising shots are bid by the hour, you have to  think on your feet and deliver shots that are ready for final within the time location or discuss with your producer if there is an issue. \n\n\n\nAs well new shots you will be receiving notes on previous shots, maybe creative notes from your supervisor, production or client as well as tech fixes. The time allocation in theory should include this but itvs much harder to bid creative shots! \n\n\n\nYou also need to flag things that will make a shot bigger, harder or more expensive than it is bid. Maybe you were assigned to remove a boom mic from a shot but there is also a reflection of it visible in a car or sunglasses, that is extra work and production may wish to bid this with the client! So you don't just do it unless it's super quick.\n\nTBC",
        "ts": "1568235157.003000",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-11\/750744396913_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Mid sized facility, film:\n\n\n\nThis is like where I am currently working. Shots are bid in days and often involve CG.\n\nSeprate departments (sometimes outsourced) deal with roto matchmove and prep (cleanup). This means that as a junior comp you will be a roto prep artist and doing roto and cleanup exclusively. On the other hand as a Compositor you will receive most roto and cleanup done for you. You will often receive a matchmove camera from 3D as well as geometry for projections. You will still need to do do 2d tracking yourself though and there are often bits of rot klike a hand passing through frame) that are just quicker to do yourself. \n\n Since CG is much slower than comp you will often start several big shots, get them to a point and park them as notes are addressed by 3D.\n\n\n\nJust because shots take several days does not mean you can dick about. You need to present work in progress in Dailies - a screening with the Supervisor, Comp Supe and producer. You will then receive notes and be expected to address them before delivery. There is often a set time for delivery and it is very likely that you will be sending work in progress shots quite often to get feedback on specific things even with unfinished CG or roto (does the director like the timing, animation, do they like the background or the interaction etc...). \n\n\n\nSo the journey to the \"Proposed Final\" is much longer! A proposed final is only actually final if a director signs it off kit is Approved). Shits can get unapproved too as directors change there minds, continuity issues arise (your shot looks great but doesn't match with later shots). Also there are often other people with a say: Exec Producers, Show Runners (on episodic TV these people are above directors as directors are often 1 or 2 episodes only but show runners are for the whole season at least), there also client side VFX supervisors too. \n\nSo there's a lot more back and forth and a lot more people involved in any given shot.\n\n\n\nHope this stuff is useful too you, ask any questions you have!",
        "ts": "1568235179.003100",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-11\/759015711815_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey! Thanks for getting back so quickly. Baaria looks like a lot of more ‘invisible’ effects but it’s hard to gauge it from IMDb! Was it a big project? That extra reel material is definitely a good benefit!\n\nThat makes a lot of sense. I hadn't really considered the actual business side of freelancing before. I did a bit of what I suppose is paid freelance work for a small studio in Paris a couple of weeks ago. Escape always teaches us about getting work in studios so I didn't really know what sort of standards or rules there are around the work I was doing going into it or even now, honestly. I just followed their direction and sent an invoice when we were both happy. Do you have any key advice for freelance work? As far as I can tell they were pleased with how I did so if I can be more in-the-know if they ask for my help again that'd be really handy!\n\nI see. Do contracts get extended or people brought back in much? I hear a lot about people moving around frequently between facilities. I’ve never heard any bad stories about studios before but it’s always good to know when somewhere is a nice place to work!\n\nThat’s brilliant! I can’t say I’ve seen either before but they’re both in my interest, Year Million especially. That sort of grounded sci-fi is a huge interest of mine and futuristic effects are some of my favourite things to work on. The last major project I did at the end of last year was building our own futuristic narrative over multiple shots and designing and delivering them from the ground up. It was easily the most rewarding and challenging project I’ve worked on yet. I’m quite proud of how the second shot we made turned out. If you’ve got time to give it a look at any point and offer any feedback at all I’d really value that: <https:\/\/www.youtube.com\/watch?v=2Sl32UC2QX0> I’m guessing the work on Yardie was mainly ‘invisible’ effects and the gunfire\/action sequences? I’m really glad you’re enjoying your current work and completely get it, don’t worry! I hope you don’t mind sharing what you’ve been working on when you’re able to!\n\nThanks for sending the studio comparisons over, they’re honestly really insightful! It sounds like small facilities are under a good bit more pressure for time and resources than mid-size ones. Obviously there’s still that same kind of pressure when it’s bid for in days but would I be right in figuring there’s more room to breathe and opportunity to experiment in a mid-size facility?\n\nIt sounds like Escape’s trying to prepare us a lot more for mid-size and possibly large facilities. We’ve had dailies with the tutors and occasional industry guests for all of our projects last year so I’ve got some experience with them, obviously in a more sheltered environment (they were also only weekly but they definitely didn’t hold anything back with their notes). We also worked in our own pseudo-departments and used Shotgun to get to grips with the pipeline. We don’t get to learn very much about freelancing and small facility work so I really appreciate what you’re sharing with me. Would you say that mid-size facilities can feel (for lack of a better word) slower? As in you’re spending more time on notes and iterations of the same shots, whereas a smaller studio has a quicker turnover? Also, while you get assets from people in other departments or stages of the pipeline, is there any amount of collaboration, feedback, and sort-of outside help at the comp stage outside of dailies?\n\nObviously, I’ve asked a lot, so please take your time. Thanks again Daniel!",
        "ts": "1568238980.003200",
        "username": "Michael Vodden (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-11\/759436555606_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "YouTube",
                "service_url": "https:\/\/www.youtube.com\/",
                "title": "Dust Storm Evacuation - VFX Breakdown",
                "title_link": "https:\/\/www.youtube.com\/watch?v=2Sl32UC2QX0",
                "author_name": "Michael Vodden",
                "author_link": "https:\/\/www.youtube.com\/user\/Artifexan",
                "thumb_url": "https:\/\/i.ytimg.com\/vi\/2Sl32UC2QX0\/hqdefault.jpg",
                "thumb_width": 480,
                "thumb_height": 360,
                "fallback": "YouTube Video: Dust Storm Evacuation - VFX Breakdown",
                "video_html": "<iframe width=\"400\" height=\"225\" src=\"https:\/\/www.youtube.com\/embed\/2Sl32UC2QX0?feature=oembed&autoplay=1&iv_load_policy=3\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen><\/iframe>",
                "video_html_width": 400,
                "video_html_height": 225,
                "from_url": "https:\/\/www.youtube.com\/watch?v=2Sl32UC2QX0",
                "service_icon": "https:\/\/a.slack-edge.com\/80588\/img\/unfurl_icons\/youtube.png",
                "id": 1,
                "original_url": "https:\/\/www.youtube.com\/watch?v=2Sl32UC2QX0"
            }
        ]
    }
]