[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Pinocchio is great, quite dark and arty(itvs Garrone, not Disney) , still four weeks to go and then my contract runs till 20 Dec so I guess they'll put me another show. If the interview with Dneg works out I'll hopefully have something lined up for the new year. I will definitely want to work at OOU again, they are a great company. Kbtw a lot of people there have risen up from runner\/entry level positions) I would like to set up with 2 or 3 regulars i can bounce between. Also my wife is itching to move away from the city so I want to get all the big names while I'm here in case I need to work remote.\n\nI have a private reel <https:\/\/vimeo.com\/254949750> password: WholeThingsAFake but I am putting together some personal work too including a short to shoot next year. \n\nGood luck with your short, make the most of it, those shots will be unique and if the film gets seen that's a big plus. Interviews often ask about personal work. \n\nI'm sure they'll be some cleanup to do in your short and it will be realistic because it will be unpredictable. There is nothing wrong with 1 or 2 familiar shots as long as you have enough distintive work to set you apart. The music vid stuff is already a start. Is your boyfriend shooting anything you could help out on and up its production values a bit?",
        "ts": "1570879542.000500",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-12\/795120985847_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "It does look like it has a really fun and interesting aesthetic to work on! I do hope so! I'm glad, and it's good to hear they've got good progression. That's fair enough.\n\nI really like your reel! The sort of 'invisible' TV work you've done is exactly the sort of stuff I find most interesting. I absolutely loved Bodyguard and would never have noticed the VFX in it. I'm quite surprised to see you did environment work on it, particularly that dark outdoor shot. What did the show involve?\n\nThank you! I will do. The films we make will be shown at festivals and entered into The Rookies if they're successful. I've got a strong team and I'm proud of our work so far so it's looking good!\n\nThere is cleanup work but it's fairly limited. The entire film takes place on a kitchen counter so the majority of it is brand removal and label replacements. Nothing is particularly advanced, which is what my reel is lacking at the moment. Noted! My boyfriend mostly does producing and scriptwriting outside of uni and is busy with a heavy scriptwriting module at the moment so he's not doing a lot of filming for now. Between us I think we could make some fun shorts but we're struggling for time between our different schedules and demanding coursework. However, we did both work on an independent film over the summer with a mutual friend and I'm expecting a first edit any day now. I signed up to do visual effects for it and they want some surrealist, psychedelic effects so it should make for some interesting and unique shots!",
        "ts": "1570916920.000600",
        "username": "Michael Vodden (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-12\/793000229332_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thanks! The stuff on Bodyguard was mostly cleanup, screen replacements (some were hard because they shit with an insert then changed they're minds!) Recolouring cars for continuity. The environment work came about as they did a pickup shoot and couldn't get permission to return to that location. They did have lots of reference photos though so I did some tracking in Pftrack, built some geo in Maya and projected onto that. For sure at One of Us I would have got the geo and camera track and just done the comp. That's why it's good to vary the size of studio you work at over your career.\n\nSounds like you've got plenty on the go! I wouldn't take any more on, just concentrate on getting what you do do tight. A simple shot executed to a high level is better than a super advanced shot you never finish or bodge. Surrealist stuff sounds fun and yeah it will stand out.\n\nGood luck with the short!",
        "ts": "1570918629.000700",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-12\/795680273574_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]