[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "No worries, I volunteered to help with questions, if Ivm busy I'll just take longer getting back. \n\nFirst thing about networking is it is a long game, you don't meet someone and ask for a job. You can just say hello, mention you liked their talk, work or whatever, and just say who you are and what you do. So you're not saying, give me junior comp and roto work, just saying, \"I'm a roto artist and junior comp, I've just finished at Escape and already had a few gigs.\" if you just let people know who you are and what you do then if that s useful to them they might get back. Itvs about them and what they need, and that's why they may prefer talking to you than a pushy extrovert. \n\nEvents usually have a talk or presentation or something which makes a good opener to start conversations afterwards. Go with a friend if you can, especially one who's better at approaching people than you are, that can help. \n\nBut your best network is probably your fellow escapees, because if I hire a roto artist and need 2 more the first person I'll ask is the roto artist! Make sure you know who s good and who's slack on your course so you can put forward. Aslo work at being the go to guy if they get asked who to put forward kthe low income family is actually an advantage as only someone wealthy can afford to slack off at Escape!)\n\nBest bet for weekend work is the studio you already worked for, same for remote kmake sure your Internet connection, pc and software is all set up and good to go before going for remote work though). <http:\/\/Creativeheads.net|Creativeheads.net> is good for international jobs and indeed. Co. UK for UK.",
        "ts": "1568895911.000900",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-19\/754520669411_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]