[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Michael,\n\nSo I watched the shot on an HD projector so it was a pretty brutal test. I think that while most of your reel should be the job you're going to do, showing shots you've attempted from the next step up is a good thing. So showing a but of comp is good. Showing 3D modelling or some other field is not good on. Compositor field because it shows a lack of focus - for a roto\/junior comp role the reel with all roto and prep will get the job over the reel with shots from across the spectrum of VFX. (autocorrect has decided to correct 'shots' to 'shits' btw so apologies if I miss one).\n\nAnyway smaller facilities are more interested in people with a range of skills while the big shops are super specialised - at Molinare you would probably get some squibs and monitor comps but at Dneg you would just be doing roto.\n\nAlso as soon as you have production experience you will ditch all your non pro work from your reel (it's literally just for your first job). \n\nAlan Mckay has a good free ebook on showreels.\n\nStuff that have made us bin candidates reels:\n\nNot focused on the job being applied for. (check the studio reel) \n\nBad tracking.\n\nCruncy keys.\n\nBlack levels not matching (when you move into comp judging colour is literally your job)\n\nSlippy roto mattes. \n\nMaking a meal of things (a simple shot with a super long breakdown) \n\nObvious tutorial footage followed to the letter.\n\nGet all your shots reviewed by your tutors and fellow students. Be brutal! \n\nSince you've done some pro work ask if you can use it, even if that means you need to put a password on your reel. Professional work shows that you've got production experience (who knows how long you spent on a student project?) and having been reviewed by a supervisor and client is less likely to have any schoolboy errors (having said that we laughed to see a shot from a well know Compositor with a shot completed at ILM where a boat was missing a tiller)\n\nAs a student the one advantage you have over pros is time. Use it and get things right.",
        "ts": "1568448422.000100",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-14\/759824105460_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]