[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Daniel! How have you been? I’ve been quite busy with the film and my specialism. Life outside of work has also been all too demanding the last couple of weeks. I’m sorry for not messaging as a result. The short film should be entering comp next week! I’m looking forward to it, since despite directing, it does feel like I’ve been sitting around twiddling my thumbs with regards to the film while it’s in 3D’s hands.\n\nI had a meeting with my personal tutor yesterday and it’s had me thinking. He suggested that I stay on for a fourth year to complete a masters. I hadn’t really considered it before. He said that all of the artists he knows that didn’t wished they had but it’s a lot more difficult to go back from the industry and do it rather than continuing from a BA and doing it at once. It also teaches a lot of the business side of VFX and freelancing, and would give another year to network and work on my reel. I’d still do my best to work in the industry over the summer but it’d mean another academic year. I can’t help but feel like it’s more just sharpening my pencils for another year but some of what he said made sense. I’d really value your perspective on staying on for an integrated masters.",
        "ts": "1573040869.000100",
        "username": "Michael Vodden (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-06\/825824994854_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hmmm, that's a tough one with no right answer. It gets hard to go back once you have a family and of course it means more debt. What do you do in the masters? Could you send me a link. I do not think you will ever stop studying in VFX, I mean stuff like fxphd and online courses etc... On the other hand most of the material in a masters is going to be most useful steppi g up from. Mid to senior or senior to supe so it's sort of knowledge you are banking for later.\n\nLastly the state of your finances is a big factor - don't get too far in debt, it's a fair while before you'll make decent money. \nWhatever you decide remember that leaving uni is not the end of learning (arguably it's the beginning).",
        "ts": "1573046608.000200",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-06\/823250050052_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "The materials they have available about the masters are quite vague. They explain the 4th year here but it seems to be copy-pasted from the game art course. <https:\/\/www.pearsoncollegelondon.ac.uk\/find-a-course\/undergraduate\/ba-ma-the-art-of-visual-effects-integrated-masters.html?intid=ESC_CL_CB2_1>\n\nYeah, I’m expecting to only learn more as I leave and continue to work in the industry. It does sound like valuable knowledge, even if it’s not immediately useful. I think even in early career it’s good to know how a facility runs from their standpoint.\n\nFinancially, I was prepared to get into more than I have. My course fees are only £6,000\/year compared to almost all other unis of £9,000\/year+. Repayments are also extremely generous on student loans and barring any unlikely change in the terms and conditions they’re likely to be wiped before I can pay them off. Obviously the less debt the better but UK student debt is uniquely palatable. That’s very true. Part of me wants to dive in but another wants to make the absolute most of uni while it’s most possible. A lot to consider!",
        "ts": "1573067835.000300",
        "username": "Michael Vodden (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-06\/816396749009_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "title": "BA\/MArt The Art of Visual Effects | Undergraduate | Pearson College London",
                "title_link": "https:\/\/www.pearsoncollegelondon.ac.uk\/find-a-course\/undergraduate\/ba-ma-the-art-of-visual-effects-integrated-masters.html?intid=ESC_CL_CB2_1",
                "text": "Do you dream of working in the Visual Effects (VFX) industry on the latest commercial or next blockbuster? Our course is perfect for those looking to gain knowledge of 3D VFX and Compositing.",
                "fallback": "BA\/MArt The Art of Visual Effects | Undergraduate | Pearson College London",
                "from_url": "https:\/\/www.pearsoncollegelondon.ac.uk\/find-a-course\/undergraduate\/ba-ma-the-art-of-visual-effects-integrated-masters.html?intid=ESC_CL_CB2_1",
                "service_icon": "https:\/\/www.pearsoncollegelondon.ac.uk\/etc\/designs\/region-core\/uk\/pearson-college\/favicon.ico",
                "service_name": "pearsoncollegelondon.ac.uk",
                "id": 1,
                "original_url": "https:\/\/www.pearsoncollegelondon.ac.uk\/find-a-course\/undergraduate\/ba-ma-the-art-of-visual-effects-integrated-masters.html?intid=ESC_CL_CB2_1"
            }
        ]
    }
]