[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey I have more respect for people that need to work through uni as opposed to those that don't!\n\nYour work being part of a bigger whole is not a bad thing, in fact it may even be a plus s it shows you can work in a team.\n\nGenerally on your reel you should have titles on each shot listing your role and the project\/client nothing too big as it'll cover the shot).\n\nAlso you should include a text document breaking down your role. One thing which will lose you friends and jobs is claiming other people s work as your own or even the impression that that's what you're doing so making it clear both on the reel video itself (Roto, Sky Replacement) and in a doc covers you for that. \n\nObviously. Roto\/prep reel will often have fully comped shots but I have seen some roto artists not make this clear like they're claiming they did the comp. Big no no, reel goes in the bin. \n\nPut any pro work you have right at the start, you can add the client or project name to the title if there's room, some houses give you watermarked material so that shows itvs pro, also hopefully there are some famous faces in the shot g when HR, production or other less technical people view your reel that can be a big factor! \nEnjoy your week back! \n\n\nSo",
        "ts": "1568633554.000300",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-16\/763274274455_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey! Thank you! It can get pretty rough when the uni work adds up but I come from a low income family and the bills have to be paid somehow! It’d be nice to do something more relevant to my interests but the consistency of the job is quite important. It might be a stretch but have you known anyone to be able to freelance part-time? I figure it’s a possibility for experienced professionals but not really outside of that.\n\nOh! That’s good, I hadn’t thought about it that way. Noted. That’s more than fair. I don’t want to take any credit I don’t deserve so I’ll pay close attention to that. Integrity is something I take really seriously, especially in an industry like this.\n\nI see! It makes sense that that would be a big deal when you’ve got a pro reel. I’d be surprised if the HR employee watching my reel is particularly into the French underground music scene (fingers crossed!) but pro work is pro work!\n\nThanks very much! We’ve already been chucked in the deep end but I expected nothing less. We’re doing three modules alongside each other this term. One’s a 60 second short film we make entirely ourselves in groups of ten, one’s making a specialised shot focusing on one of our weaker skills (odds are I’ll focus on keying as I haven’t done that as much as anything else yet), and the other is focusing on employability like making a reel and all of the job application bits you have to do. It’s gonna be a busy term but it already looks like exciting stuff.\n\nThe new job-hunting-focused work has me curious. Have you ever had to read cover letters? If you have, do you have any key advice\/things to avoid? Another one of the requirements for the module is to have business cards printed. It makes enough sense but I’ve not actually seen them used personally? It feels odd to ask but have business cards held any significance to you in the industry? As someone that rarely deals with any kind of physical media anymore it’s an honest (and probably quite funny) curiosity to me. I hope work is treating you well and wish you all the best in the coming week!",
        "ts": "1568672904.000400",
        "username": "Michael Vodden (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-16\/749516307730_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "You d be surprised how many copy paste errors we'd get. So an application to Molinare would say: 'I've always wanted to work at Framestore' also spell the company name right and double check. We had a Producer applicant claim attention to detailv but apply to Molinair. Obviously they weren't successful.\nTry and get a name and write to a direct contact. Small companies will just ask their staff so once one of your classmates starts working chances are they'll mention you (big places like Dneg etc are more formal)\n\nYou can totally get bits of roto prep work, not regular part time but maybe a few days on a project here and there or even remote (but I wouldn't hire someone new remote tbh) weekend work comes up around crunch time.",
        "ts": "1568702837.000500",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-16\/764803449574_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]