[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey how's it going?",
        "ts": "1570779912.000100",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-11\/793776007047_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Daniel! I’m alright, and so sorry for the relative silence on my part. It’s not for lack of effort, I’ve honestly had little time to breathe between directing the current project at Escape, contracting the flu, and a few family issues popping up in quick succession. I was trying to finish the roto before I messaged you again because I didn’t want to come back empty-handed but retrospectively that was an unrealistic way to handle things!\n\nHow are you? I’ve been enjoying your Instagram posts!",
        "ts": "1570780378.000200",
        "username": "Michael Vodden (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-11\/785493255073_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Haha, very well, finalling shots on Pinocchio and I've got an interview with Dneg next week. Yeah I'm trying to build up an Instagram - tricky as I don't have rights to my best work.\n\nYeah finish the roto whenever and keep me posted o what you're up too!",
        "ts": "1570799267.000300",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-11\/794460784486_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Oh wow, exciting stuff! Did you enjoy Pinocchio and\/or are you glad to be finalling?Best of luck at DNEG! That’s a shame about your work. Are you allowed to use it on a private reel at least?\n\nI should have the roto done this weekend if all goes to plan. Escape is going quite well! I’m the director for our 60-second film and we’ve got to the matchmove stage and mostly-finished modelling. I’m working on the grade for that at the moment.\n\nI’ve also got to find footage to key and cleanup for my specialism module. I think I’ve found a decent, not-over-used shot from Escape’s library. I’m not sure where to start or what to look for in a cleanup shot though. It needs to be as advanced as possible and I don’t know where I can find that on the internet.",
        "ts": "1570816707.000400",
        "username": "Michael Vodden (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-11\/792230911620_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]