[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Here's some email advice:\n\nFind right person - Google search, LinkedIn, industry events, try to send an email to a named relevant individual. \n\nFollow instructions: if they say send email to <mailto:x@vfx.co.uk|x@vfx.co.uk> with xyz in the subject line then do exactly that. \n\nNice subject line: either the one they told you to use or: Job Title - Place Advertised Application\n\nDear Person, \n\nLittle intro: specific to the company - why would you want to work their and not at Dneg (yeah I know you're applying to Dneg too but here it should seem that company  X is your favourite. This should show youvre read up about the company, at least their website and a Google search. If you just read an article about them on Beforesandafefs or fxguide you can mention this.\n1 paragraph, polite but not too corporate.\nDon't copy paste this part.\n\nAbout me: who you are, skillset, experience level, direct working link to showreel (working link, click and check before you send). These are the main reasons they should hire you for this job. 1 para.\n\nSecondary reasons: Fine art skills, Python scripting, awards, short films. Basically the cherry on top. 1 para.\n\nPractical: Availability, location, Citizenship visa requirements. 1 para.\n\nPolite sign off: This or future projects, thank you etc... (if they don't hire you for this gig hopefully they will keep you on file for another.",
        "ts": "1568795764.000600",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-18\/751429389298_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hello! I always read about making everything specific to each studio you apply for but figured that would be the standard thing to do anyway. It’s surprising that that happens so often.\n\nRight! That's understandable. Do you know what sorts of places I could look for or reach out to for weekend work? I know larger facilities like DNEG etc. are unlikely to but what sorts of facilities would? I’ve been told before that advertising facilities are a good bet but I’d appreciate your perspective.\n\nAh, thanks so much! It’s how to first approach industry professionals that I particularly struggle with. I don’t want to get things too heavy but I feel it’s worth saying I have a social anxiety disorder that means I really overthink networking. I can gladly work with anyone without issue because there’s an established professional link in place there. Making new connections is a big sticking point for me. What’s a polite and constructive way to introduce yourself and start a conversation? I worry a lot about being a burden or taking up their time. Can you really just email someone, start talking to them, and ask what you might be able to do for them? It all sounds like obvious or normal stuff but this is genuinely the thing I worry about being the biggest barrier between me and the industry. I’d really value your input as a working professional that is taking their time to speak to students like and including me.\n\nThanks again Daniel!",
        "ts": "1568842565.000700",
        "username": "Michael Vodden (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-18\/765280826949_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Also, please tell me if I'm asking too much or you don't want to talk about anything. It's been great and really insightful talking to you and I don't want to make things inappropriate in any way.",
        "ts": "1568843172.000800",
        "username": "Michael Vodden (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-18\/758874168305_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]