[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thank you! That means a lot to be told.\n\nI have seen that! I’ve got a good understanding of NDAs now, I’ve signed a few and seen quite a lot of NDA stuff through Escape and events plus my boyfriend’s already done some NDA work in TV. A focus really does help. QVFX has been wonderful so far and a safe space is exactly what they’re going for. The main point of it is to act as a constant community for artists as they move between different facilities regularly. Everyone there is a really positive force so I’m really glad to be able to participate.\n\nThat’s a good idea and a good challenge! Thank you!\n\nThat’s true. I’ve used Maya so far thanks to their free student licenses. I’ve had a bit of experience with Mocha through Silhouette but I’ve heard it around quite a lot so I’m definitely gonna get some practice in.\n\nIt is important. I still struggle with imposter syndrome to an extent. I tend to compare myself very critically to other artists but it’s a process of learning to be kinder to myself. Experiences like showing my reel at MPC and the interview have been really helpful and it’s really motivational. That’s gotta be a good feeling. That makes sense. I appreciate you pointing that out.\n\nTwo very good points! There’s an undeniable instant credibility you get from DNEG. It would create more opportunities itself going forward.",
        "ts": "1573820640.001100",
        "username": "Michael Vodden (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-15\/835656799668_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "For comparison the best exercise is to only compare yourself to yourself. Compare your recent work to last year's.",
        "ts": "1573859476.001200",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-15\/837040847509_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]