[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That’s a good idea. I’ll do some research.\n\nYeah, Nuke’s holding down a real monopoly right now. I’ve already seen how inevitable Maya is too. I’ve seen a lot of hype around realtime and machine learning on social media, like Unreal’s applications for VFX and Adobe’s content-aware fill for video.\n\nThat’s brilliant, but a difficult choice too! Another year at somewhere you know is really good is a nice option to have. Do you have enough time to get an offer from DNEG too? I think it’s probably best to go for new experiences but you can’t knock the stability staying at One of Us would offer.\n\nThanks for the recommendations! I think I’d rather not learn from something VFX-focused for much the same reason you said.\n\nI will keep up with photography! Unfortunately I can’t really work with an actual camera for now but using my smartphone still keeps my composition and colour skills going. Professional camera apps still let me change as many manual settings as possible, but I’m still limited to fixed lenses and apertures.\n\nI don’t think I’m suited to a really technical role. I’m very much an artist at heart and don’t think I could focus on the technical side beyond facilitating my artistic work.\n\nThank you! That’s a good point. Right now, I’m definitely leaning a lot more towards just graduating. I had a mock interview yesterday with Union VFX’s head of talent and I had a great time and learned a lot. She said that I interviewed really well, had a strong CV, and said to apply to them next year. After being validated by multiple people in senior positions I think I want to keep up the momentum I’m already building to leave this year.\n\nI’ve had some limited on-set experience thanks to Escape, did a lot of on-set work in college, and get to be on sets sometimes through my boyfriend and our film friends. It’s not the same as working VFX on a set but it does mean I’m not unfamiliar with it. I’m going to as many events as I can and I’m in therapy for my social anxiety so I’m being really well encouraged to push myself in that regard. My confidence has really been boosted in the last month so I’m finding it easier by the day. That makes a lot of sense.",
        "ts": "1573646288.000800",
        "username": "Michael Vodden (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-13\/832695248981_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Unreal academy is running right now, maybe see if you can catch some of it. Lots of VFX people there not just games",
        "ts": "1573652969.000900",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-13\/834674462695_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Anyway overall I think you are doing all the right things professionally and personally. \n\n As I hope you've seen, most events are pretty safe places the only thing you need to avoid if you're presenting professionally is NDA - always check if you can talk about a project before you do. For the rest I think having an actual focus for the event makes it a lot easier. And I imagine QVFX is very much designed as a safe space - was that your experience?\n\nHere's a really useful first Python project for your  home setup - create an \"auto write\" tool that uses the name of your Nuke script to make a sensibly named output file with the image sequence in a like named folder - give it options to create a final output and custom named precomps. You can add options for jpg temps and mattes too if you want. You can work a lot faster when you have a sensible setup like that.\n\nAs a comper you are vt really beholden to the 3D software of choice, if you want to do 3D in Blender you can, just as long as you keep your comp skills industry standard. Also I would say learn Mocha - it's planar tracker is so handy for anything where you need to stick something on a flat or nearly flat surface - which is pretty much every shit at some point. Don't worry about it's more exotic features as they are far less useful. Just make those corner pins for Nuke.\nAnyway you've got a good base and you've got 5 months to make it killer.\n\nUnion do some good work, size wise I think they are somewhere between Molinare and One Of Us so probably a good place to pick up some all round comp skills in cleanup.\n\nValidtion is important, I had a big of a rough patch and ended believing I wasn't very good for a while. The recent positive experience from OOU and my interview at Dneg have both shown that my skills hold up pretty well against artists from the big companies. All I will say is that when people don't want to give you a raise they sometimes make out like it's your fault - of course sometimes it is, never be arrogant - but also be aware that this is a tactic people use. Know thyself. Basically know which is which. \n\nOne other motivation for going to Dneg is I could finish that trilogy of \"typical day\" from earlier in our Slack with a big company! Another is that if I ever leave the country it's a name that's known all over. \n\nAnyway signing out for the day. Keep it up!",
        "ts": "1573686237.001000",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-13\/820949009650_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]