[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That's brilliant! I'm really glad. I've been well, thank you! Christmas was a welcome break and it was great to spend so much time with friends and family. I’m back at Escape starting tomorrow. We're finishing our specialisms (I'm finishing cleanup on the external short film and my own keying shot) until mid-February and then we start another short film all over again, this time without animation.\n\nJust today said short film got a lot more intense! After weeks of radio silence over Christmas the supe reached out to all of us and we’ve got to get working versions of every shot done for Sunday. I’m just trying to be as helpful as possible and I’ve ended up becoming effective 2D lead. Exciting stuff but it’s gonna be a busy three days! The shots I’ve already worked on I can have finalled by the end of tomorrow if nothing goes wrong. He’s already said he’s really happy with my work so it’s going well so far. \n\nSorry it’s taken so long, but I can show you March of the Potguins now! It’s being sent off to festivals so we can’t publish anything at all online yet but I’ve got the file on the college’s Google drive so it’s protected. Here it is: <https:\/\/drive.google.com\/open?id=1GKUvc4aJQJQFisLTs_s0zxid8jNSx6lk> \n\nDark Summer is going well. Quite a lot changed from the original brief so my work mainly came down to grading and a screen replacement. A lot of effects the director wanted were easy enough to do in Premiere so he did all the surrealist stuff himself. It’s being screened by the BFI sometime this month and Autograph Gallery in Shoreditch in March.\n\nI’m a bit worried about the keying shot I’m doing for my specialism at this point. I worked until Christmas Eve between the latter two films and have taken a break until now. The keying’s taken a back seat the whole time so I’ve got a lot of ground to make up. I’ve managed more major turnarounds though so fingers crossed!",
        "ts": "1578607860.000200",
        "username": "Michael Vodden (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-09\/900022928996_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]