[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey dude,\n\nThnks for the support. Yes the UK corona policy is insane, it reminds me of the umbrella scene I the 80s movie Whoops Apocalypse.\n\nStudy and work from home if you can., encourage your boyfriend, friends and family to do the same. Social distancing.\n\nIvm doing okay, my wife works in a London hospital so it's pretty freaky. No separate wards for covid 19 patients.\n\nWe were asked about our home workstations and internet but no real system in place. It's weird I have like the most minor cold but will probably stay home.\n\nWriting is really a great thing and having personal projects is important.",
        "ts": "1584307491.000200",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-15\/1003682949078_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That scene is dreadfully accurate. It's horrifying to see the economy having priority over human life in full practice like this. I just hope they take a u-turn sooner rather than later.\n\nI've stayed at home since last Wednesday and classes at Escape were cancelled from Friday onwards. I won't be going back for as long as I can get away with. Our entire group for the current project is working remotely too. My boyfriend and I are social distancing as much as we can now, especially because it's likely we're both carrying the virus due to close contact he had with a friend who's been diagnosed with it since. Convincing my mum and family is a real task but I'm putting my foot down now. We have a trip to Jersey for a funeral planned this Thursday and she's dead set on it.\n\nI'm glad you're okay. I hope your wife is managing okay and all the best to your family. It's hard to imagine how difficult life in hospitals must be right now.\n\nWriting certainly is and you're right there!",
        "ts": "1584310368.000300",
        "username": "Michael Vodden (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-15\/1001522560101_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]