[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Apologies for the delay in getting back Johnny hope you had a lovely weekend! I only recently learned substance on my internship, I made a security camera asset for a live action short film, so I learned the basics of PBR shading through that. Substance painter is definitely something I want to get using in my modeling workflow from now on, it’s amazing! Would that be what the texture artists in DNEG use? ",
        "ts": "1566200933.002600",
        "username": "Chloe O’Connor (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-19\/732634122806_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Good morning ! Don’t worry when you get back me ,it’s whenever it’s better to you . \nI would like to see more of your work and specially WIP , any changes you can set a google drive or any place you can store your work for me to have a look? \nCan you tell me your current workflow ? From model to render ? \nSubstance painter and also designer is a good part of the workflow we use . Also Mari until painter becomes stronger ",
        "ts": "1566207907.002700",
        "username": "Johnny Grilo (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-19\/730095147492_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Sure! I can set up one tonight and put up what I have, I’ll link it to you when it’s sorted. \nAt home, I mainly use Maya for modeling and photoshop for painting textures, and I render through Arnold. I also try to use Unity if it’s an asset I want to implement into a game, to see how it renders in real time. I’ve been practicing ZBrush in my own time when I can.\nIn my internship I’ve been working in Maya for making the assets, Substance painter, then Redshift in Maya for rendering and Nuke.",
        "ts": "1566223910.002800",
        "username": "Chloe O’Connor (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-19\/724455248929_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]