[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Amazing! Hahaha my wisdom:joy: but thats great to hear you have questions!! I understand from reading you’re profile that you’re enjoying texturing? And what year of university are you in? :)\nWell where to start haha! I currently work at Framestore, as a Lighter and Texture Artist! I have been working there for 3 years; starting off as a Runner and working my way up!\nI graduated in 2016 from Teesside University where I studied Computer Animation and VFX",
        "ts": "1574412873.001800",
        "username": "Michael (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-22\/845198366912_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yh, I want to go into look dev and texturing. I haven't done lighting as much but it's something I'm dabbling in for my projects this year. I'm a third year Computer Animation student from Bournemouth University, so I want some guidance this year! I only realised I want to go into look dev like.... half a year ago when I was working on a group project and had to take on that role, so right now I'm trying to self teach myself a bunch of stuff since I picked to do more technical units last year :sob:\nIs it nice working in Framestore? What was the process like to get in?? And what are your go to programs??",
        "ts": "1574415545.001900",
        "username": "Mulan Luu (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-22\/847458166070_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Well that’s all groovy with me! It’s the perfect time to start thinking about some guidance and feedback on you’re reel for applications! :) If you’re finding Lighting difficult I’m sure we can do a crash course on the basics or answer any questions? Shall write it down for us to look into! So you’re eager and ready to get into the industry? :wink:\nOooohh it is a lot of fun, and very busy Haha!\nOur department at Framestore is Texture\/Lookdev\/Lighting so we dabble in and out of these areas!\nBeing a Runner was great I worked with like minded people who are still close friends today!!! Was only running for 6 months then I got an opportunity on Paddington 2! The rest is history haha! :octopus:\nSoftwares we are using for texture mainly is Mari and Substance Painter\/Designer! \nI’m unsure how best you want to communicate, whether you prefer chat or trying to setup a call through Skype to go through what you want to get out of the mentoring! Let me know and we can try and setup something soon! :) ",
        "ts": "1574417815.002000",
        "username": "Michael (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-22\/845306021701_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "My reel definitely needs updating! I got feedback recently so I know what needs to go and what can stay:sweat_smile: my next deadlines are in January so I can include some of those projects in my reel:blush: if it's okay, can I show you some of my WIPs? Right now I'm working on my final major project, a masterclass set up by an architecture\/interior design studio, and a personal research and development project on creating iridescent textures. If you have any good tips for creating those, let me know!! And I would love a crash course on lighting! I really need it for the masterclass project :joy:\nYes! I want to be employed PLEASE:joy::sob:\nSo do you get to be in all of those roles for one movie or is it more specialised for each movie, but you have the freedom to flip flop between them for other projects:thinking_face: am I making sense?:sweat_smile: \nThat sounds amazing!!! I hope my transition into the industry is as seamless as yours! I haven't seen the Paddington movies but now I have to:joy:\nOooh okay. I'm familiar with substance painter and recently got into designer, but I haven't used Mari yet :thinking_face: should I start teaching myself Mari now?\nI'm fine with anything, whatever is most convenient! What is your schedule like? Bear with me while I try to remember my Skype login details :joy:",
        "ts": "1574425240.002100",
        "username": "Mulan Luu (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-22\/845425783952_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hahaha please feel free to send stuff anytime you need some feedback! Happy to look at it! :squid: ahhh cool! Yeah we can talk about those projects and how you can go about the texture\/lookdev during a call!! \nDepends really on the film, We recently finished on Lady and the Tramp where I did both texture and lighting work; but most time you’ll focus on one area during a show! :)\nI got quite fortunate with my timing and the opportunity! But there’s no reason why it you can’t have a seamless transition!! Haha\nI would defiantly start going through Mari as it’s probably our number 1 software :) but if you want can go through some Mari stuff with you also?\nHahaha we don’t have to use Skype, whatever’s easier for you! We can use discord even? Im busy this weekend but next week at some point okay for you?\n",
        "ts": "1574426837.002200",
        "username": "Michael (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-22\/837526204689_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Great! I'll finish off some stuff and send it over:grin::grin: thank you so much! \nWow you got to work on Lady and the Tramp?? Welp that's another thing I need to go and see! How was it? What was your favourite project to work on so far??\nI really hope that's the case:pray: last year's graduates were not as lucky, I heard :pensive:\nOh damn okay. I opened it and was immediately lost, so I definitely want to go through some Mari stuff!!:sweat_smile: \nYh skype or discord is fine with me! I'm definitely more active on discord! Yh I'm free next week! If we're working on different programs I'll probably be on call in the labs just so I can have access to them:sweat_smile: I only have the student version of Maya on my laptop, which isn't helpful.",
        "ts": "1574441291.002300",
        "username": "Mulan Luu (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-22\/845371653924_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]