[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi again!\n\nThere's a few things I like to do when I get stuck. In general, I think oftentimes when you are working on a task, you can get really buried the tiny details, when in reality, they may be inconsequential. Here's some things I like to do, which would be applicable to any part of the modelling process.",
        "ts": "1584349335.003900",
        "username": "Venezia Georgieva (IntoGames (Mentors))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-16\/1002197721968_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Regarding the animation and rigging bits, I have a few suggestions on how to tackle those. Think about what it is you would like do the most at uni and later on at work? Is it modelling, sculpting, texturing, or rigging and animation? Once you have identified your most desireable part of the process, focus primarily on that. Focus on making an absolutely stunning piece that will be the focus of your portfolio and really shows you off at your best. Making environments tends to be a great show-off piece, for example.\n\nThe reason I say this is that no one expects you to be equally good at everything, so ideally you will have some knowledge of the whole process, but you will be exceptional at one part of it. Kind of Jack of all trades and Master of one. With that in mind, it would be good to show you have a basic understanding of rigging and animation, but don't dig too deep into that if it's not what you want to be doing ultimately.",
        "ts": "1584350126.004000",
        "username": "Venezia Georgieva (IntoGames (Mentors))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-16\/1004090016903_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I hope this is making sense?",
        "ts": "1584350131.004100",
        "username": "Venezia Georgieva (IntoGames (Mentors))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-16\/992151116497_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yes I think I understand what your getting at, the aspect of the 3D process that I want to focus the most on is 3D modelling, but I don't really know how exactly to show off a good example of 3D modelling in a portfolio piece without some of the other parts of the 3D art pipeline, as an example of what I mean, a blank white environment would be kind of lacking when compared to the textured version of the same scene, or am I just focusing on something unimportant?",
        "ts": "1584350562.004200",
        "username": "Alexander Kubota (IntoGames (Mentees))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-16\/1004105356279_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I think it kind of goes back to the jack of all trades and master of one. So for example, as you are most passionate about 3D Modelling, I would focus primarily on creating sophisticated models, maybe showing a process video of how you created them, showing off their meshes, etc. I would spend the most time and effort doing that side of things and making sure it's sharp as hell :smile: Then, after you're happy with those, you polish them up with the texturing elements. I'm not suggesting that you abandon the rest of the pipeline, but more so dedicate the most time and effort to the part of the process you are most passionate about.",
        "ts": "1584351139.004300",
        "username": "Venezia Georgieva (IntoGames (Mentors))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-16\/992187256529_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I think I was getting mostly at the fact that you don't need to be a pro animator if your passion and goal is to be an expert in 3D Modelling. It's about making sure your time is directed in the best way possible. I hope that's a bit more clear?",
        "ts": "1584351315.004400",
        "username": "Venezia Georgieva (IntoGames (Mentors))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-16\/1002268767792_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Oh, and I don't use Discord to answer that :smile:",
        "ts": "1584351507.004500",
        "username": "Venezia Georgieva (IntoGames (Mentors))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-16\/989488342898_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]