[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Georgina, sorry for the late reply! I was raised playing games and always loved the art, so I guess I was always set on that being my career! Initially I wanted to be a programmer, but have fallen in love with the art instead. I've got a portfolio on the Rookies and Artstation right now :smile:\n\nThats actually really interesting that you initially wanted to become an actor, I think if I could choose any career in the world and just automatically be successful in said career, I'd probably choose to be a musical star. I really enjoyed acting and singing as a child, but I don't think I have the proper skillset for it now:sweat_smile: Anyway, 3D art is my thing :slightly_smiling_face:\n\nI think the games industry is definitely a really pleasant one. Sure, it has its downsides especially in larger studios in terms of crunch and other issues but from my limited experience I've found that the people who work in studios tend to be really nice and welcoming, maybe down to the fact its more of a \"niche\" job, comparatively.\n\nThats actually a really nice ethos... I think that might be mine too, though not consciously. I guess I really cherish having good people around me, and I guess that's one of the reasons I'm a little scared of the industry. Women are a minority in it and even just in forums and chat rooms I'm normally the only girl. It's really intimidating and I hope that changes soon. I'm not saying men can't be nice, just that I'd love a little more diversity.\n\nImposter syndrome is definitely a big thing for everyone, I know it's hitting me hard and 3d is still just a \"hobby\" :sweat_smile:",
        "ts": "1582458926.000100",
        "username": "Zahra Tilling (IntoGames (Mentees))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-23\/965017226384_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "You don't need to answer this if it's too personal, but how've you found it being a female in the industry? Has it affected you at all? I'm always scared I'll be seen as a \"token\" or looked at differently because of it",
        "ts": "1582459001.000200",
        "username": "Zahra Tilling (IntoGames (Mentees))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-23\/954899144145_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]