[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Oh that's awesome! I absolutely adore Rick and Morty (Can't say I've played the games though!) I'm based in central London, but can get around fairly easily :slightly_smiling_face:\n\nI signed up mainly to get a feel for the industry and so I can get an idea of the different jobs in the workflow and where I'd like to see myself! I'm pretty new to this whole thing, so the whole industry side of things is pretty much all unknown to me :sweat_smile: I also want to be able to build my skills for the 3D art industry and get an understanding of the kind of day-to-day job of artists in the industry.\n\nHow did you manage to land the operations manager job? It sounds like a huge responsibility and like you need to know a lot about everything! What path led you to your position?",
        "ts": "1582278154.002300",
        "username": "Zahra Tilling (IntoGames (Mentees))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-21\/962852592645_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey! I think it's really great that you've researched different industries, when I was at school I didn't even know the games industry was a thing! Have you started creating a portfolio of some of your 3D projects?",
        "ts": "1582285409.002400",
        "username": "Georgina Felce (IntoGames (Mentors))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-21\/950191752178_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I had a weird route into this industry, when I was at school I was determined to become an actor and at college realised it was probably not a realistic goal for me so studied costume at Guildhall School of Music and Drama. I had about a year working in the industry before I realised that I hated freelancing and it was really stressful constantly on the hunt for work so I took a step back and tried to pin what I really enjoyed, and that was working with people essentially :smile:",
        "ts": "1582285799.002500",
        "username": "Georgina Felce (IntoGames (Mentors))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-21\/951518815059_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "So I took an admin job and worked up, bounced around a couple of industries and started attending some parties at my partners work (he worked at King) and decided that I wanted in. The environment seemed cool and friendly and creative. Applied for an Office Manager job at Rovio and got that, then they shut the studio down and was taken in by Big Pixel :slightly_smiling_face:",
        "ts": "1582286023.002600",
        "username": "Georgina Felce (IntoGames (Mentors))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-21\/952869321265_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "(my story in a nutshell)",
        "ts": "1582286029.002700",
        "username": "Georgina Felce (IntoGames (Mentors))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-21\/962536604036_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I think once you find that thing that really fascinates and interests you it doesn't become a chore. And my ethos has always been about making sure the workplace was a nice place for people to be and work, so I'm still learning- I make loads of mistakes too",
        "ts": "1582286106.002800",
        "username": "Georgina Felce (IntoGames (Mentors))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-21\/962991431680_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I think if you ask anyone, they'll all have some sort of imposter syndrome, that they don't feel like they know enough to be working in their role",
        "ts": "1582286323.002900",
        "username": "Georgina Felce (IntoGames (Mentors))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-21\/950207677186_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]