[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Try running some tech checks on your own shots such as:\n\nA difference Merge with the plate (should be black everywhere except your comped or graded elements)\n\nA laplacian or similar to check the grain\n\nAlso do a Merge difference between the plate and denoised plate and your comp and a denoised version of your comp. The differences should show you the grain patterns and they should be the same.\n\nViewing the sequence one quarter at a time.\n\nExposure up, exposure down, gamma up, gamma down does anything become apparent? Pump up the saturation, does anything become apparent?\n\nPlay sequence on a realtime loop and a ping pong. Step through sequence frame by frame and toggle between render and plate.\n\nSpend a good half hour on this, in production this will happen after you get creative final on a shot. Somewhere like Molinare or in Advertising with shorter turnarounds you will just do an abbreviated version yourself (5 minutes or so).\n\nNever send a render you haven't watched through, even if you have checked the comp, even if production are crying out for it. It's like feeding your Mogwai after midnight - it'll bring out the gremlins.",
        "ts": "1580376799.000500",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-30\/930999120022_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Great tips! Thanks, I will use them in my upcoming projects! :slightly_smiling_face:",
        "ts": "1580380687.000600",
        "username": "Asher Hunt (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-30\/931084077606_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "For part of my module, I have been asked to interview a industry professional, would you be alright with me just asking you a few questions? It wont be for a few weeks but just giving you a heads up?",
        "ts": "1580380782.000700",
        "username": "Asher Hunt (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-30\/928420263172_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Sure no problems!",
        "ts": "1580409170.000800",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-30\/929681736432_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]