[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Asher,\n\nI'm very well, been keeping busy with work and also a short film. How about yourself?\n\nSend me the questions as soon as they're ready!",
        "ts": "1582192045.001300",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-20\/960424592724_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Cool, I've been doing a vfx shot for a film, here are the questions cheers!\n\n\n1.What is a typical day like in industry?\n\n2.What has been the most challenging project to work on?\n\n3.Are there any differences working in the VFX industry compared to VFX industry in London ?\n\n4.Do you have any favourite Nuke tools\/gizmos?\n\n5.How long do you get to work on a shot generally?\n\n6.Whats it like working with clients?\n\n​",
        "ts": "1582205097.001400",
        "username": "Asher Hunt (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-20\/963024024151_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "1. This is actually very different between companies. At a small place like Molinare, or at an  ad agency, the shots come in hard and fast. So you will arrive 9:30 - 10:00 and the producers will let you know what shots you have by email or verbally (Molinare also uses Google sheets). You will usually have to bid a time on each shot although some might have already been bid. If the bid seems off then it's important to flag this immediately it may be that you haven't understood the requirements or it may be that the bid is just unrealistic. That's okay, but once you've accepted the bid time it's important to deliver on that. You let production know when a shot is done kor you have a wip someone needs to view) and the you move on.\n\nSomewhere bigger this is done through a shot management system such as Shotgun. Also shots are often bid longer times but a version will need to be submitted regularly to dailies. There are usually 2 dailies sessions per day in which the comp supe and supervisor will view your shots with you and give notes.\n\nDays should run for 8 hours (not including lunch) but as shows come close to delivery this will accelerate and often you will work longer hours. If this gets out of hand or if there is no balance (ie leaving early when it's quieter then it's probably best to move on). It should be possible to complete your work on time if you are efficient l though.",
        "ts": "1582221595.001500",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-20\/961732418565_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "2. The most challenging project was actually the least impressive. It was a corporate video which was horribly mismanaged Nd we ended up working ridiculous hours (at one point 37 hours straight).\n\nThe most challenging creatively was Pinocchio. We had CG animals, CG water, characters who were part CG and part practical, multiple plates needing to be combined and retimed. It wasn't a huge budget but the standard was high so that was a challenge too. \n\nIt was a lot of fun and the supervisor, production and comp supe were excellent.\n\nSo those are two different definitions of challenging!",
        "ts": "1582223217.001600",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-20\/963975851734_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "3. I've only worked in London apart from a very short period in Italy so I am not the best to answer this question.\n\nIn places like Canada it is a legal requirement to pay overtime so that changes things.\n\nThe UK has the advantage that there is not only film and TV but also advertising, so there are a lot of options and there is a nice range of larger and smaller companies. It is also possible to work in more client facing roles at small post houses.",
        "ts": "1582224476.001700",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-20\/951683961425_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "4. My absolute favourite tool is Mocha, it's really worth learning (only takes a couple of hours) as you can save so much time. Camera tracking takes a long time and is expensive so for sticking stuff on walls, screens or even faces it's great. I use a script called Animated Corner Pin to Matrix to take the corner pin data and put it I to a roto, roto paint, gridwarp or splienwaro node. This can save so. Much time!\n\nThe other is the new Smart Vecotrs. They have saved my arse on so many shots - doing beauty retouching, adding water droplets to a characters face, blood or debris on their clothes... So many uses. When they don't work they are pretty unusable but they are improving all the time. Learn to manipulate STmaps and many secrets are yours! \n\nA couple of other handy tools are Richard Frazier's Rebuild Frames, some form of edge extend tool and Despill Madness (there's a new kid on the block though, APDespill). \n\nI also like to make my own tools, any time you keep making the same 3 nodes again and again you should make it a Toolset.",
        "ts": "1582226289.001800",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-20\/961884482949_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "5. At Molinare I would usually get between 2 hours and at most 3 days. These were pure 2D shots and most were at the shorter end of that spectrum. At One of Us the average is about 5g10 days but there will be multiple versions delivered including creative iterations.",
        "ts": "1582226416.001900",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-20\/963731332439_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "6. Depends on the client! It's not for everyone and there are some very talented artists who could never be  client facing. Having said that I think it's really rewarding, you need to be prepared beforehand in a client attended session - setup your shots so you can make a lot of changes quickly kmove this element to the left, make this element brighter etc... Without breaking another part of the comp ( like the key).\n\nThis is a good habit for yourself anyway as addressing notes quickly is a valued asset.\n\nAnother thing with working with clients is that they may be wrong but it is still their decision. You can only influence their ideas by making them think it is their idea. So it requires a certain detachment from your work (sometimes you may really hate their decisions). \n\nThe cool thing is that you can really get a lot more done and have shots signed off then and there.\n\nI think this is possibly one of the most useful skills to learn if you get the opportunity.",
        "ts": "1582226897.002000",
        "username": "Daniel Mark Miller (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-20\/964092948982_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]