[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Nice! That looks great, there's always more you'll want to do to something, but it came together really nicely. I like the post fx, they really help sell it I think :slightly_smiling_face: Hope you managed to get some rest over the weekend! Ah nice, definitely keep me posted of your practise :slightly_smiling_face: got a busy week this week before I head off, going to Spain for a few days to see my girlfriends family for Christmas, then up to Nottingham to see my own after xD looking forward to the break haha are you going anywhere?",
        "ts": "1545039407.001900",
        "username": "Steven (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-17\/504811324448_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Haha woah that does sound like a busy Christmas!! I will go have linch with my dad and grandad soon in Wood Green :sweat_smile: Dad’s going back to Poland today to his wife :face_vomiting: and grandad’s going to Cyprus tomorrow for Christmas, i will be staying here :sweat_smile: may go Santorini,Greece to see my mum and hopefully 2020 going Korea,Japan if i’ve saved enough :yum:",
        "ts": "1545040828.002000",
        "username": "Anthony Nikolaou (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-17\/505398118948_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Lunch***",
        "ts": "1545041001.002100",
        "username": "Anthony Nikolaou (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-17\/506621888807_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "( Santorini in the summer)",
        "ts": "1545041026.002200",
        "username": "Anthony Nikolaou (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-17\/504832440144_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I know right, I was planning a chilled one, but it kept escalating xD next year maybe...the studio closes over the holidays! Enjoy your lunch :slightly_smiling_face: Oh wow, quite spread out then! Did you move here from Greece? Ahh I'd love to go to Japan one day, loads of people in the studio have gone, and said it was amazing! Most of my time off is spent visiting my girlfriends family with her, since she moved here from Fuerteventura! Actually hoping to go to Vegas in 2020! haha Did you guys find any extra help for the big project or will you go on as 3?",
        "ts": "1545047083.002300",
        "username": "Steven (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-17\/507044190006_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I was born in Serbia, lived in greece 17 years and have been here for 4 years! I have triple nationality :joy: Serbian, Cypriot and British . I have been waiting to go to Japan for nearly 7 years... still waiting! Vegas? Niiiiiiice ! The big project is gonna be a 4-people effort wince the ex got denied by the other group so had to stick with us, i will try and practise my rigging and animating skills and will just retarget animation when i get the final characters. I hope you guys have an amazing time with her family and then after that with your family!!  I just realised yesterday that i plan on going to Korea during the Olympics :sweat_smile:i may have to go earlier or later . Hopefully will save up enough by 2020 if i find a job in the industry by the end of 2019",
        "ts": "1545049669.002400",
        "username": "Anthony Nikolaou (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-17\/505671341250_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Oh cool! Are you fluent in all three languages too? That'll be a long time coming then! Ah I see, that's good in a way then, are things okay enough between you? Thanks! :smile: Oh man haha yeah that'll be chaos xD You'll graduate in the summer right? Do you think you'll focus on work in London or are you open to moving around? As for your practise I'd recommend AnimDojo (Blue Zoos new animation training for post grads, there's a bunch of free lessons and great tips on their Youtube, and if you really wanted to get in-depth with it it's only £15 for a month access)  <https:\/\/www.youtube.com\/channel\/UCBUmTtoTwbjd5UtPDiT3VHQ> and also would recommend keeping things short and simple, I find it really easy to get lost in things and want them perfect, but being able to drop things and balance your time\/quality bar is a good skill to keep developing :slightly_smiling_face:",
        "ts": "1545056128.002500",
        "username": "Steven (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-17\/505956974565_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "YouTube",
                "title": "AnimDojo",
                "title_link": "https:\/\/www.youtube.com\/channel\/UCBUmTtoTwbjd5UtPDiT3VHQ",
                "text": "We've developed a new, affordable way of improving your CG character animation skills, through purposeful practice and helping you to hone your self-critiqui...",
                "fallback": "YouTube: AnimDojo",
                "thumb_url": "https:\/\/yt3.ggpht.com\/a-\/AN66SAzCj2xMSsSbhnTCRmrNDMtioZ9VMW8XbN1_kQ=s900-mo-c-c0xffffffff-rj-k-no",
                "from_url": "https:\/\/www.youtube.com\/channel\/UCBUmTtoTwbjd5UtPDiT3VHQ",
                "thumb_width": 900,
                "thumb_height": 900,
                "service_icon": "https:\/\/s.ytimg.com\/yts\/img\/favicon-vfl8qSV2F.ico",
                "id": 1,
                "original_url": "https:\/\/www.youtube.com\/channel\/UCBUmTtoTwbjd5UtPDiT3VHQ"
            }
        ]
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I speak Greek, Serbian, English and a decent amount of Japanese, enough to have a basic conversation. I want to master  Japanese and Korean and that’s all from me as far as linguistic interests go. Ideally, i would like to stick to London and mostly work my way up in VFX probably as a Compositor. Will begin working on my showreel after February (animation deadline) and I don’t think i will touch much 3D afterwards. I want to focus mostly on compositing, some matte painting, clean-up, keying, roto. Just need about 3-4 shots that show each of these skills to a decent extent. At the moment i am adding things to what i wanna do in 2019... i want to make a showreel\/find a job in the industry. Take some Japanese\/Korean lessons and go back to developing games because someone commented on my game and asked if i am developing more games, that made me super happy knowing that someone random from the internet want to play more of the stuff that i am making.",
        "ts": "1545075786.002700",
        "username": "Anthony Nikolaou (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-17\/506316783509_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]