[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "It was really cool, thanks! I loved it, went to New York and Boston to eat and watch sports pretty much haha! I've sadly not done much game development at all, I learnt unreal and a little coding in college but moved straight in to animation really! We made some flash games that I've long lost, and I made a little 3d platformer in Gamebryo which was a lot of fun! Playing wise I'm a bit of a Blizzard addict haha WoW, Diablo, Overwatch, and then generally most RPGs\/occasional sports games. How about yourself? The game looks awesome did you do it all yourself? It's great to keep building other skills. I really love nuke, and struggle to go back into adobe programs now. The node based stuff just works so much better for me coming from Maya haha. Oh man, that's tough! I'm sure you'll manage to get it done, try to make a plan and simplify things that seem out of scope now that you're down a member, and of course I'd be happy to listen\/advise on anything you might want to know! How long do you have for the project? The sculpt is awesome, I love the texture. Being a jack-of-all trades is great - in my opinion - while you're learning. You'll have a solid foundation and understanding of different departments, which will make you more valuable, and easier to communicate with for other people! Seems to me like you have a great set of skills, try not to sell yourself short :slightly_smiling_face: I dabbled in a bit of everything during college\/uni, and still do when I get the chance!",
        "ts": "1542806580.002100",
        "username": "Steven (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-21\/485352646613_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "<https:\/\/www.artstation.com\/artwork\/WYLdQ> here's one of my projects from a couple years ago! It's hard to find time for personal stuff lately haha.",
        "ts": "1542806612.002200",
        "username": "Steven (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-21\/485050230147_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "ArtStation",
                "title": "Early Hours, Ste White",
                "title_link": "https:\/\/www.artstation.com\/artwork\/WYLdQ",
                "text": "Hello artstation! So my first post here is a personal project I've been working on in my spare time. You can see the full video here: <https:\/\/www.youtube.com\/watch?v=PvL9QO2rcLY&amp;feature=youtu.be> It's based on a piece by one of my favourite artists Pascal Campion <http:\/\/www.pascalcampion.com> For this I used Maya, and rendered in Arnold. Comped in nuke. For the sake of the time-frame that I wanted to complete this in I rendered 4k and cheated the 'camera' in post. Render times were just too long in Arnold for such a piece. I created everything from scratch myself, using the original image for reference. It's been a great chance to keep up my generalist skills while working as a Lighter\/Comper. I wanted to keep the painted look, and cosy feel",
                "fallback": "ArtStation: Early Hours, Ste White",
                "image_url": "https:\/\/cdnb.artstation.com\/p\/assets\/images\/images\/004\/089\/303\/large\/ste-white-endframe-v001.jpg?1480264071",
                "image_width": 444,
                "from_url": "https:\/\/www.artstation.com\/artwork\/WYLdQ",
                "image_height": 250,
                "image_bytes": 87464,
                "service_icon": "https:\/\/www.artstation.com\/assets\/apple-touch-icon-72x72-precomposed-3b85c10e44b449dec56beb39bf218107.png",
                "id": 1,
                "original_url": "https:\/\/www.artstation.com\/artwork\/WYLdQ"
            }
        ]
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I really like the piece of work! ( project is due in march or May but i would like to have finished the characters by February(rigged and animated) so we can do the fx,lighting and rendering. We are using snow and with the amount of particles we will need quite a few days or weeks for rendering . As for your piece of work, what i would change is just the way the building la render out, since they are in different depths, i would have the front one have some more detail and then between that and the one behind it i would add some atmospheric fog to give it more depth in layers, overall great piece of work, love the lightning ",
        "ts": "1542840866.002400",
        "username": "Anthony Nikolaou (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-21\/485053208337_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]