[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Ah Jeeze, that's intense! I hope you find something soon man. Cool, how is the teaching going - Is that a paid gig? I have a friend who went over to Japan to teach English (and then met a girl got married had a baby haha!). I'd love to live in Spain for some time to help me to learn the language, love the culture...and food :smile: How are you settling back into Uni? I've pretty much remembered how to work now...",
        "ts": "1547570053.000700",
        "username": "Steven (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-15\/525268107079_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Unpaid teaching for now, it’s a business we started with a Korean friend, we do a free Skype level test and then paid lessons. We started a week ago or so, i have a paid lesson tonight!! I was going to apply for the English teaching in Japan but my previous relationship kinda ruined my plans a bit... still considering teaching in Korea though through a similar programme! I sent off all of my paperwork for my british passport today and just waiting for it so i can finally book tickets to Santorini. I booked tickets to Panic!At the Disco though! I’ve only been to uni one day and it’s already getting a bit tiring but I believe i can get through it. My game has  reached  nearly 700 players!!! I think i need to invest time for it and get it to the AppStore after i re-work on it. As far as Spanish goes,  try to get immersed in it. Watch series or movies or even watch series and movies in English with Spanish subs. Try to use whatever Spanish words to communicate with your girlfriend instead of English words even if it’s 1\/5 words of a sentence.Try shadowing for the pronunciation and flow and make a list with the most common phrases and words that you use. In my case, i care more about grammar because through it i can express myself in the right tone. It’s an interesting thing the whole language learning. Working on anything interesting at the moment? ( anything without an NDA?)",
        "ts": "1547589919.000800",
        "username": "Anthony Nikolaou (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-15\/523813068896_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]