[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey! I played a bit of the remastered version, was alright! I have been playing a bit of League of Legends lately but that’s all :sweat_smile: if you ever decide to join in, let me know! I am still rigging and animating for the group project.. characters are not in yet... (as expected). Looking for a new job now to pay the bills :sweat_smile: I cannot keep doing 2 days uni and 5 shifts just to get by. I have refrained from working in restaurants but I believe I should... pays better but it’s a lot more work... any work ideas for the new few months? Ideally looking for £800+per month",
        "ts": "1548939800.001300",
        "username": "Anthony Nikolaou (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-31\/538295892691_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey! Oh nice, I played a tiny bit of League, is fun - I'm a bit of a Warcraft addict aha going to a DOTA tournament later in the year for a friends Stag party! Never played it but should be fun! Ah, how's it going refreshing yourself in rigging? Do you have any sort of proxies to work with while you wait? Have you gone any farther with your final major project? Man that's rough! I only ever worked part time in retail before this really, but was lucky enough to live with my parents. What sort of location are you looking? Anything that gives you more time outside of work to focus on uni and rest would be an improvement I think, even if you are having to put more in while you're there! Do you have a CV\/Reel together? Perhaps there's something you can do with your languages to earn some money teaching? Cafes and pubs\/bars could also be worth looking into, maybe a bit less intense than a restaurant",
        "ts": "1548953798.001400",
        "username": "Steven (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-31\/537947855440_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]