[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Haha the game looks awesome! Reminds me of Crash bandicoot and my childhood!(not that long ago :joy:) what kind of blender project do you have in mind for blender? I would definitely check Andrew Price’s videos\/tutorials ( AKA Blender Guru). I decided to change my Final Major Project from VfX to Game Design, I haven’t told my tutors yet, hopefully they don’t freak out :joy:. Going Sky Gardens tomorrow!! Woohooo!\n\nPS. I messaged the people from Indiexpo( website i’ve had my game on for nearly a year) asking for a boost\/promotion and they said i could have an interview for that :sweat_smile:",
        "ts": "1548245907.001100",
        "username": "Anthony Nikolaou (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-23\/531081422821_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Aha yeah it's a cute game, I love crash - have you played the remastered? I replayed the first but then swapped it for a switch version instead, buut have been too addicted to diablo 3 to play anything else haha Oh I'll check him out for sure, kinda struggling to thing of anything to get started, though think I need some more storage on my PC before I do haha Oh wow, quite a change! Is that from the group project that you were looking at rigging for? What sort of thing do you have in mind for it? It's important to do something that keeps you passionate! Oh wow, I hadn't heard of that but it looks amazing!! Enjoy it! That's great news about the interview, try to stay calm and focused, and show them your passion for it, you never know where it will lead :slightly_smiling_face: keep me posted man!",
        "ts": "1548257361.001200",
        "username": "Steven (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-23\/532482761094_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]