[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Sam,\nI took a look at your portfolio and it looks really cool to me. I don’t have much experience working as matte painter or photobashing. It’s surely an approach that is more required for feature films or games.  To be honest the quality that I see it looks at a professional level to me. Have you thought about including more 3D model\/environment works or character samples? Showing some blocking in a 3D software (I don’t know which one you can use ) and then the final 2D artwork. Also having a page for realistic props could help and show that you can develop and design them.",
        "ts": "1582805130.002800",
        "username": "Enrico Buffa (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-27\/973740865239_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thanks for the feedback. Yeah I’ve noticed photobashing techniques tend to be used for feature film and games over other industries. \n\nRegarding 3d models - Do you think showing work in progress blockouts would be a benefit? I’m using SketchUp for blocking at the moment. So I could include more of that to show development. \n\nI feel my portfolio lacks showing my work process \/ development and only displays the final concept. So maybe more thumbnail sketches and test compositions would be good to include?",
        "ts": "1582826677.002900",
        "username": "Sam Saunders (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-27\/962443066881_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "absolutely! you can include thumbnails, sketches for environments , how you develop the image. Just remember to put at the beginning your best works and avoid the ones you’re not sure about if you have.",
        "ts": "1582827804.003000",
        "username": "Enrico Buffa (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-27\/961119051747_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I think as long as it doesn’t take one full page just for the Sketchup model, I think is good to show!",
        "ts": "1582827863.003100",
        "username": "Enrico Buffa (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-27\/972589417024_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]