[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Happy New year to you to Dani!!! :confetti_ball::tada:. Hope you had a great winter break and Christmas! I think my resolution is to improve my movements and push myself to create more dynamic stuff! \nI don't think I'll continue working on it but rather jump back to some shots and redo them if I feel I've understood animation better and if I think I can do it better. ",
        "ts": "1547806122.000200",
        "username": "Joshua (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-18\/526946859188_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That's an amazing attitude! Well done. Have you seen Spider-Man yet? Totally dynamic and worth a study of the poses. Lots of the animators that have worked on it have been releasing their shots on Twitter and sharing some of their process. It's so inspiring!",
        "ts": "1547813484.000300",
        "username": "Dani Abram (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-18\/526592381329_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I worked at Cartoon Saloon last year and it really taught me about pushing past my 'safe zone.' My supervisors would draw over my frames with suggestions on how to push my characters, very good to be reminded that I'm always learning and pushing, even with 10 years animating experience! I'll see if I can find any of their screen grabs",
        "ts": "1547813559.000400",
        "username": "Dani Abram (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-18\/526593173361_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I have seen spiderman, its amazing! I'd love to watch it again though. I actually already follow some animators from the movie and I find what they post really helpful.\nAnd I think I need something like that, or I just need to continue studying other people's animation I love ",
        "ts": "1547839682.000500",
        "username": "Joshua (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-18\/529052890182_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]