[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi there Adeshewa, that's great, I'll try to answer it all but if I miss something feel free to ask again :)\n\n1. The great thing about animation is that you can't learn it all, I mean, it's a lifelong learning process. There's so much to learn, and there's definitely not just one way of doing things, so you can keep learning and experimenting as you go.\nIt's not easy as a career in terms of stability and continuity of work and income, even if you work permanent of fixed term contract, and that's worldwide. It certainly doesn't compare to people who happen to get some job in well stabilished company and they might work there their whole lives and move upwards in a clear career path. But I assume the kind of work you'd do also doesn't compare. What I know for experience is that you've got to really like it as a thing for your life and day to day. You'll be in a studio or at home working with animation for at least 8 hours of your day, dealing with people who do animation. You must like it as something you'd want to be part for most of your life",
        "ts": "1573594686.002900",
        "username": "Marcelo Perin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-12\/819118604978_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I usually write too much, please let me know if it's too long haha I could manage to be more to the point",
        "ts": "1573594730.003000",
        "username": "Marcelo Perin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-12\/833763191943_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "In a more practical way, it's important you learn to manage your money, learn to save and to live on the very basics when needed, because you might be out of work for some irregular periods. I tell that more from my perspective coming from Brazil and from a developing market point of view. It's just 4 months I've been in the UK but the animation market isn't much different around the world.",
        "ts": "1573594875.003100",
        "username": "Marcelo Perin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-12\/831447058772_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "2. A great animation portfolio comes either from a long time working or from a long time working for yourself - it takes time to have worked on many good projects so you can have several good shots, backgrounds or illustrations for your portfolio. Or else, if you can afford to just study and work hard on your own stuff, you could end up with great material for a portfolio, even though when you're looking for a job, it's usually more important if you have any commercial project than a perfect wonderful scene you've been doing by yourself for the last 2 years",
        "ts": "1573595130.003200",
        "username": "Marcelo Perin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-12\/831925343285_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "So in that account I'd advise you get any job in animation, doing any step of the animation process, that I truly believe you'll learn so much and get to know people that will make more difference in your chances of getting a new job than working on your own to prepare a beautiful portfolio that isn't commercial.",
        "ts": "1573595284.003300",
        "username": "Marcelo Perin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-12\/820449602819_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "3. There are several types of jobs in an animation studio, also depending on the technique they're working with.\nRoughly you have \n1 - administration work, that isn't directly related to animation, but people might need to understand the whole process\n2 - production work, either executive production, People  who work with funding for the projects, who pitch and sell the ideas, go to festivals, forums and markets to network with broadcasters, companies and investors to get the money for the studio, and also production management people, who manage the time and amount of work in a studio, so to say. They keep track of what is being done and make sure people have what they need for the production to be made",
        "ts": "1573595593.003400",
        "username": "Marcelo Perin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-12\/831463949780_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "3 - then you have pre production and production departments, where people do scripts, storyboards, layouts, characters, backgrounds, animatics, animation, effects, composition, lighting, texturing and so on. Everything that is directly related to animation. Usually for every step of it there can be an individual artist, so you might think of some step you'd like to do and there would be a position for that function",
        "ts": "1573595748.003500",
        "username": "Marcelo Perin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-12\/831939963749_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That includes post production as well, where compositors will put everything together, editors and so on will finish the piece",
        "ts": "1573595803.003600",
        "username": "Marcelo Perin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-12\/831932996096_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]