[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Stephen, really nice to e-meet you. I have read your files, but please tell me a little bit more about yourself when you get a moment.\nI'm fully working remotely so might take a little extra time to get back you.",
        "ts": "1586421358.001900",
        "username": "Mariano Melman Carrara (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-09\/1051232067315_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That's ok, I fully understand right now how mental it must be for you and your workmates, especially for something like producing which is so interaction driven.\n\nIn terms of more about myself, over the course of the last year I've decided I want to take a producing career route. I realised that it wasn't what I was doing on the project that mattered; but what the project was, and being involved in anything animation related. Seeing Clare and Tyler (Producer and Production coordinator) working on The Tiger Who Came To Tea, I found their work much more fascinating, and wanted to be in that chair.\n\n I've given it a go on a few university projects this year including a live client brief which I feel went really well, having managed a team of people who normally don't finish their group endeavours. I've been told there's a need for good producers who understand animation and the software side of things and I'd like to be that, if it's true! I find the whole spreadsheet process and keeping track of workflow to be really satisfying.\n\nMore personally I still like doing animation in my free time, usually involving birds. I also watch football when it's not suspended and would love to learn to play properly. I'm learning the guitar and I'm a huge musical theatre fan! My third year film which has hit a bit of a speedbump due to Covid is about a Refugee penguin who gets adopted by a childless couple in Leeds; animated in a mix of Puppetry and 2D, and that'll probably be my project for a while given the present situation and me being stuck at home in my parents house; though I'm lucky I have somewhere to go to. I also play some video games when I have nothing better to do, which at the moment means very little!",
        "ts": "1586426565.002000",
        "username": "Stephen Quenet (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-09\/1046136865527_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]