[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Adeena - my apologies for the delay in getting back to you. Things have been crazy (as you can probably tell from the media :eyes:)\n\nSo good to hear all about your future plans &amp; what you're currently up to. I studied Psychology too at A-Level and I absolutely loved it. I got full marks I loved it THAT much haha :nerd_face:\n\nI guess a good question to ask yourself is what annoys you in the world? That can help you narrow down which field in Biology\/medicine etc might suit you. For example, let's say you don't like the idea of having a physical condition getting in the way of achieving highky, you might find physio a really enjoying job etc etc.",
        "ts": "1586784170.002300",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-13\/1079853689376_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "What grades are you expecting? That way I can advise you better on getting to university &amp; your genuine choices etc",
        "ts": "1586784232.002400",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-13\/1058599369589_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "In fact, sometimes you don't need to specialise just yet. And sometimes its not a good idea to. For example, I wanted to be a forensic scientist once upon a time, but now I don't. Had I studied a forensic science degree I might have been stuck in terms of keeping other pathways open (if that makes sense!)",
        "ts": "1586784314.002500",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-13\/1053999326470_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Here is a really good place to start in terms of roles within the Health industry. You might have seen it? &gt;&gt; <https:\/\/www.healthcareers.nhs.uk\/explore-roles>",
        "ts": "1586784413.002600",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-13\/1069302629041_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Also, the NHS have a great tool on the website to help you think about where you might fit.\n\nWhy don't you give it a go!? <https:\/\/www.healthcareers.nhs.uk\/FindYourCareer>\n\n*In terms of my role...*\n• I'm a Programme Manager at the NHS which means I am in charge of running various large-scale projects (for example, deciding to change a key supplier or creating a new more streamlined - and cost-saving - process!).\n• I'm lucky that I get to work with multiple teams across the NHS to get the project over the line (as well as our suppliers\/customers)\n• I need to make sure we meet the project's budgets, timelines, hit our KPIs (which stands for Key Performance Indicators i.e. the targets we want to meet) and also communicate with a wide variety of stakeholders (i.e. lots of different people might need to be aware of changes in they way they work as a result of the project, doctors, nurses, general managers, etc etc ).\n• I also work with senior management to decide which \"Projects\" we will work on in the first place, so I do a lot of strategy work and creating business plans which we analyse and decide whether or not to persue them!\n*To help you get a sense of my job &amp; you asked about challenges, here are some of the pros &amp; cons (in my opinion!):*\n\n*Pros:*\n• I'm learning leadership\/management skills which I can take with me to any future job and any industry. Each programme I run feels like a mini business that I'm running!\n• I get to mix with lots of people across the NHS + customers\/patients etc so I feel like I have a great overview of the entire industry in just a few years of working on the job\n• I get to see the impact of the decisions we make. For example, if i was a consultant making recommendations about what projects the NHS should go ahead with, usually they will move on to the next client and never know what impact they had or whether it was the right decision. I get to see what happens next &amp; actually implement it!\n• I'm constantly learning and meeting new people\n• I get to see the direct impact of government policy\/decision making ... which is good because I'm really interested in politics\n• The work I do has a big impact ... covid-19 has shown us more than ever that effective NHS operations are CRITICAL!!\n*Cons:*\n• Can be long &amp; irregular hours. Given a lot of staff work shift hours etc it means I can be working those same hours in order to work with them and get stuff done\n• I have to manage lots of different stakeholders who all have different wants and needs and inputs and concerns. I can never make EVERYONE happy its just not possible, so I constantly have this battle.\n• Some of the decisions we make can profoundly affect peoples lives. This makes it a bit stressful to make sure you make the right decision!\n• I feel like I have a creative side to my personality which I dont use on the job! But thats' what hobbies are for i guess :smiley:\n",
        "ts": "1586784666.002700",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-13\/1079879754704_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Wow so that's a massive wall of text from me :sweat_smile:",
        "ts": "1586784681.002800",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-13\/1065268892900_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "But hopefully gives you a bit of an insight! Let me know how you get on with the NHS links I sent you (hopefully they come in useful?)",
        "ts": "1586784715.002900",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-13\/1054005416086_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Let me know!",
        "ts": "1586784715.003000",
        "username": "Samantha (Mentor)",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-13\/1054005422726_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]