[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I did marketing at University and had to do a thesis which I chose to do on tv programme sponsorship which was very new back then (think Coronation Street sponsored by Cadburys, I'm A Celebrity sponsored by Aunt Bessies etc.). To do this I had to contact the commercial managers at all the regional commercial television stations (at this time we just had 4 TV channels!) . The one at Scottish Television offered me a job after I graduated.  I'm from Edinburgh in Scotland.  I worked there for about a year before getting the opportunity to move to London as they had a small office there.  I took it thinking I'd maybe go to London for 6 months or a year as an experience, but I'm still here 22 years later!!  I moved quite quickly to a job in a post production company, then worked at the BBC in their graphics design arm that did all the idents and trailers, then took 18 months off to travel the world (best thing I ever did) then worked in a physical effects company (prosthetics, pyrotechnics, models, animatronics etc.). I then spent 8 years in a VFX software company (have you heard of Foundry who make Nuke? <http:\/\/www.foundry.com|www.foundry.com>) before joining the VFX company where I am today.  All my roles have been in marketing and operations.  Wow! Epic message.  :slightly_smiling_face:",
        "ts": "1532422041.000194",
        "username": "Lucy (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-07-24\/403972733893_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "thanks for detailed explanation, wow what a journey. It must have been amazing to travel the world, that is what I want to do also. Out of all the places you worked at which was your most challenging?",
        "ts": "1532424601.000037",
        "username": "Guian (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-07-24\/405178015478_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Every job has had it's challenges.  All companies are different and learning how to work well with different types of people and get things done is always challenging, but does get a bit easier with experience.  There is also a big learning curve when you join places, but I find that you should never be shy of asking questions. It's how you learn and people are flattered that you're asking their advice and expertise.  I learn new things every day, which keeps life really interesting and rewarding.",
        "ts": "1532434117.000116",
        "username": "Lucy (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-07-24\/404970439959_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "What are you hoping to get from mentoring Guian?  Are there specific things that I can help you think about or work towards?",
        "ts": "1532448481.000092",
        "username": "Lucy (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-07-24\/404254858933_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I would really like to know the best type of experience and skills needed for more exposure in the industry. Also ideal practices and things I could incorporate into my daily life that would enrich my chances in the industry. ",
        "ts": "1532450814.000107",
        "username": "Guian (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-07-24\/403432894080_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I'm applying for university but I'm also interested in apprenticeships so if you have any advice or tips on these things I would really appreciate it.",
        "ts": "1532450975.000165",
        "username": "Guian (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-07-24\/403434940112_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]