[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thank you, Steve, for your very useful insight on my situation! I have been busy with interviews and got the job answer from Framestore this morning... I got it! I will start in January as a VFX production assistant!! I am very happy I got the position even though it worries me that I might not be able to get back to a more creative position anytime soon.\n\nBut I guess that's all right, as I will be learning a lot from both work and the training provided. Getting the job also helped in the decision making of what to do next year, which is good as I can now focus on one thing, which is getting good at my job! I know what the hours are like in VFX and at Framestore, I guess that means putting 3D on hold for now, and maybe gather enough money to do a course at some point... But it will be so good for my CV as you said, and will give me a great idea what working in a super busy company looks like, as well as a good understanding of the movie production pipeline.\n\nI used to try and do personal work in the morning, it worked for a while, until I crashed from tiredness. I can agree with you and the other mentors on this one, working on personal projects alongside with a job (especially if demanding and with long hours) is far from being ideal, probably does not bring anything but stress and tiredness..",
        "ts": "1575372224.003800",
        "username": "Thais Ondet (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-03\/849657727105_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That's great news, Thais! Congratulations on the job. I hope you enjoy it.\nI've been thinking a lot about this and it's difficult to think of something. I think what I would do is try and schedule in some time for personal work and stick to that schedule. Like going to the gym, or taking a lunch break. Make it part of your daily routine.\nYou could start but just saying, for example, \"ok, Wednesday evenings I will do 2 hours of personal work\" and see how you get on. If it works and you can feel more you can add an extra day, and then maybe more days etc. If you have to miss a day because of work commitments you could just push it to Thursday instead. Or something along those lines. Once it becomes a rigid part of your usual routine you may find it a bit easier to commit to it.\nIn the meantime, you've got a pretty good entry into the industry and for a huge company, so enjoy it =]\n\nAgain, if you have any other questions or want some advice I can try and help you out.\nGood luck at Framestore =]",
        "ts": "1575395126.003900",
        "username": "Steve Kimbrey (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-03\/850252542097_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]