[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Don't worry Craig, I might just be tired but i'm thinking i'm a bit of a hopeless case. Hard to keep my spirits up with the uncertainty of ever getting job. My age is the problem I think. It just takes soo long to get a reel looking right doesn't it. Just to keep my mind active I think I might do an online computer science degree as a second degree. At least it will keep me thinking. I'll probably never pay back the loan though.",
        "ts": "1580143477.000200",
        "username": "Oliver Canovas (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-27\/925987856230_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I was thinking about your delay question - not sure what situation you’re using this in but if its in a solver you can make an age increasing per frame so like i think you’d need to set an attribute to mark a point ready to kill and what frame it was set, then you can compare that to the frame you’re on to know if it should be “kill_red”. I think this sounds more complicated than it is i can probably make an example? Haha",
        "ts": "1580151575.000300",
        "username": "Craig Tonks (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-27\/924036617152_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I feel for you, it does take a lot - but you only need a chance and once you get going companies always need extra hands. Its just getting over that hump!",
        "ts": "1580151707.000400",
        "username": "Craig Tonks (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-27\/913867022945_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]