[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Marnie, how are you doing? Has your son fully recovered from the operation he had?",
        "ts": "1554301306.000100",
        "username": "Alina Fedaseyenka (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-03\/596367338320_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "If you have a moment, could you please tell me how you handle payments with your freelance customers? Do you sign any contract before you start working or are you just arranging things via email? Do you ask any prepayment before you start? Thank you in advance for your answer",
        "ts": "1554301446.000200",
        "username": "Alina Fedaseyenka (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-03\/596371378272_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi thanks for asking about my son, he is well, operation was a success, just no sports for a while. So this depends on the client, if the work is a short contract for an individual or a company and the kind of job it is. I often arrange through email. I like it because you then have everything in writing. I always get a contract. So if you have agreed upon a job ask them to send you a contract if they are a company. If a different situation and they don't have a contract you can send then yours.  So if it is a company I would invoice them weekly include your terms of payment (how many days) on invoice. If it was something like designing a book cover I would ask for about 30 percent up front another 30 at a landmark point halfway through (like delivery of concepts) and remainder at end. Just make sure you have these discussions before you start anything and both sides are clear and have it in writing. Feel free to ask more",
        "ts": "1554320375.000300",
        "username": "Marnie Pitts (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-03\/596929016768_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thank you very much! Could you please share an example of a contract that you would normally send to a client?",
        "ts": "1554321756.000400",
        "username": "Alina Fedaseyenka (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-03\/596964761040_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]