[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Marnie, I hope you are doing well. I wanted to ask you about your freelancing experience, because I'm getting some projects to do now and I'm not sure about when I should register myself, about invoices for clients, tax etc... Could you please share your experience with me? If you have a free minute:)",
        "ts": "1553251146.005500",
        "username": "Alina Fedaseyenka (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-03-22\/576342669329_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Sure, so in the UK you get around 10000 pounds per year tax free. After that you need to pay tax. So if you are freelancing I have found it is best to register with hmrc as self employed. You invoice the person you are working for, they pay you. However, unless you are on payroll they won't take out the tax. So I calculate what I owe in tax and set it aside in a separate account to be paid once I do my return each year. You will also need to pay both class 2 and 4 nic. Class 2 is a small weekly payment and class 4 is a percentage of your profits (again calculated at tax time). Definitely make yourself an invoice template that you can use for all clients. Make sure you give each invoice an individual number and date and keep a digital folder of all invoices to make your life easier at tax time. If you ate then employed in a company and added as payroll you can do a self employed return which includes your freelancing and staff work. I can expand if you like. It sounds complicated but it is easy so don't let it stop you taking freelance work.",
        "ts": "1553297935.005600",
        "username": "Marnie Pitts (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-03-22\/587125913542_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]