[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yeah I think for me it's important to know the impact of the work I've done and what the final outcome is it helps to motivate me! Yes definitely there are so many biochemical research areas :grin: oh wow thats convenient timing for you to learn about membranes :joy: its good you have opportunities to practice presentations I definitely didn't have enough before starting my placement! ",
        "ts": "1511883991.000352",
        "username": "alex.gordon27 (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-28\/279646463767_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I procrastinate too its not only you don't worry! But what really helps me is writing tasks I have to do on a list so I can tick them off and trying to do x amount in a day. Also when I've done something challenging or worked for an hour or two I give myself a reward like choc or to watch a 20 min tv show so maybe that could help you too? Also writing a list of your goals and how to achieve them broken down helps me too :blush: I think look online at lots of good cv templates plus i try to tailor the cv to the company so on my cv I have a skills section where they'll relate to the behaviours required for the role with evidence of when I've demonstrated it. Hopefully that helps! ",
        "ts": "1511884195.000780",
        "username": "alex.gordon27 (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-28\/279648714663_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I've been travelling with work last week I was in Munich and this week I'm in Hamburg in Germany its pretty cool to be able to go different places as an intern :airplane::airplane_departure: but this morning I did have to get up at 5:30 am to help with trials so there are some cons haha :sleepy:",
        "ts": "1511884308.000095",
        "username": "alex.gordon27 (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-28\/277917703472_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Ahhh yes making a to do list does help out nd i do it often nd yes i think i will try out the rewarding idea. I will look online to see god CV templates because i want to start writing them out. But what kind of skills can you state ? Travelling sounds soo fun. Thats a very nice set of places to visit within Europe. I would like to do alot of travelling when im older. Do u go to companies abroad and see how things work there too? Would you ever want to work abroad? Also do you have any revsion techniques you used to do?",
        "ts": "1511900402.000214",
        "username": "shahana1812 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-11-28\/278744224258_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]