[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Morning &amp; Happy Monday :wink:\nWe usually only work on a project across multiple locations when it's really big and work needs to be split \/ one location doesn't have enough people to actually do the work. Or if the project can be split in some logical way...like the work we recently did on that BBC series His Dark Materials (although i'm not 100% sure how that was split exactly) - both London &amp; Montreal each did a lot of work on that one. Occasionally people will also jump in when there's last-minute work to be done at the other location - although that's rare, since it requires extra personnel for coordination\/production at the other location",
        "ts": "1575295626.003700",
        "username": "Christopher Puchta (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-02\/858283915318_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Nowadays it also depends on movie studios and where they want the work to be done. It's a big game of hunting tax credits\/rebates for them and that also determines where the actual work is done...basically where they can get the most amount of money is where the vfx is done. That's not the only deciding factor of course, but it's become quite a big one. That's why so many vfx studios opened branches in the usual locations (Canada, London and up&amp;coming Australia)",
        "ts": "1575296064.003800",
        "username": "Christopher Puchta (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-02\/855630054292_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Evening and happy monday :simple_smile: \nSo its not very often that projects are shared? On the occassions that they are shared would it be that each location works on certain parts or more that the files are transfered between them?",
        "ts": "1575324261.003900",
        "username": "Dhru (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-02\/856877609280_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "It's more than one location would work on certain parts of a project, and the other location would work on another part. Like on my current project, London is working on all shots that involve a character on fire and everything that has to do with that sequence - while we work on another part of the movie that deals with another character. So in that sense there's no overlap...each location can focus on their work and there doesn't need to be any back and forth over the timezones etc\nBut we would definitely share certain assets that are meant to be for the whole show...certain shader setups that are made for the show, more general fx-tools that people build are always shared cross-site once they're done, assets that are needed in multiple sequence (like a modelled location\/building\/whatever that appears in sequences that both locations are working on). So someone (or rather multiple people) make extra sure that there's no work happening twice or something :wink:",
        "ts": "1575325052.004000",
        "username": "Christopher Puchta (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-02\/856894759312_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]