[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hello Micaela, super lovely to be connected with you. How are you? Almost the weekend! : )\nI guess they encouraged us to introduce a bit about ourselves so here's me:\nI've been living in London for about 5 1\/2 years now, and been in \"the industry\" ever since, but across all sort of roles. I started out working for a company that did brand videos for Youtube (so like advertisement, but more \"authentic\", and online) which saw all stages of production, including being on \"set\". I've done some on set stuff then but through various internships landed finally in the VFX industry. For about 1 1\/2 years I have been working at ILM now.\nI was interested in this mentor scheme because I never had a mentor, ILM encouraged us to sign up to this portal, and moreover, if I am honest, I don't really know how to proceed in my career. I'm quite happy to be a Coordinator for now but I am not sure about the route of LP - PM - Producer, and I'm not sure whether I'd like to stay within VFX or dabble with other places (such as animation, or something else altogether) so it would be lovely to hear about your career path and experiences :slightly_smiling_face:",
        "ts": "1564740105.001600",
        "username": "Lisa Koelle (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-02\/716378994422_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Lisa,\n\nSo nice to meet you too! Happy Friday! I’ve actually gone away for the weekend so apologies in advance if I am a little slow to respond for the next few days.\n\nThanks so much for sharing that introduction. Here’s a bit about me: I’ve been working in the animation industry for about 10 years now. Whilst at uni I did a load of work experience and then some runners jobs on a mixture of live action shows mainly in kids tv. I spent some time at the BBC who offered me a short term contract, but decided to finish my degree. I loved being in the studio, but wasn’t convinced that I wanted to work the long hours on set, or spend so much time travelling away from home and so decided to try and get some experience in the animation sector as I’d loved working in kids tv and found that there were less egos and the hours were more sociable, \n\nThe work experience placement I did turned into doing some maternity cover and I ended up staying at the same company for 7 years. I started off as a production coordinator on a show called Mike the Knight, and then worked my way up to Production Manager on Thomas &amp; Friends working across the tv series, 60 min specials and short form, before being promoted to Line Producer and then Producer. When I was a Producer I helped to redevelop the show and also worked on a feature length special. For those shows I was working in house for the brand owners, rather than in the animation studios, which were based in Toronto. \n\nLast year I decided to make a change and to see what it was like working in a studio and took a job at Blue Zoo, where I’m currently working on a pre-school version of Paddington. It’s certainly been a change working for the client rather than being the client!\n\nI’m afraid I can’t really offer you any insight on working in the VFX industry, but I can certainly try to answer any questions you may have on PMing or producing in kids’ tv animation. \n\nI wonder too if there are any similar challenges we’ve faced along the way? I recently took part in the Helen North Achieve Programme through Animated Women and I learnt loads from it, but also found it great to discuss challenges with other women, so if nothing else, maybe that would be if some help? \n\nHave a lovely weekend. \n\nI look forward to hearing from you. \n\nMicaela ",
        "ts": "1564776320.001700",
        "username": "Micaela (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-02\/717053790518_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]