[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Micaela, Sorry for the mega late reply! I keep on forgetting about this forum, plus I hurt my hand (ouch) so I was on a bit of a forced digital detox.\n\nThanks so much for your quick reply and advice though, I had read that immediately and really very much appreciated it!\nOf course you can't know what my new company will be like, but it was very reassuring to hear about your experiences. It's not like I hate the hours so much - I'm happy to work hard on something I love and the working environments I have been in were luckily always really good and supportive! - but I just want to see if there CAN be something different out there. I fear it might not but at least I would have tried!\nThank you also for the salary advice.\nSo basically here is what happened:\nIt turned into a real bidding war between the two companies and in the end I got 4k more out of the offer than the original one. It wasn't even what I intended nor did I haggle much for it! Which I think just goes to show EXACTLY what you told me. Yes I believe I am worth that money and I am very glad because now I went from an okay-meh salary to one that I think reflects the work I do but isn't it super sad that they would offer me a salary so low to begin with when clearly they are quite happy to give me so much more??? I GET it, companies obviously try their best to make their own money go far and that is fine but I really think this was quite depressing. Anyway I decided to leave my current job because I felt even if my current job matched all this, they still see me as more junior (just becaue I started as a PA there and they can't seem to forget) than the new job, and because I felt it would have stalled my career for the next few years.\nPHEW - bit nervous but it's happening aaaah :slightly_smiling_face: excited to peek into your industry, obviously it's even more great that you are my mentor now :wink:\n\nHow are you doing?? Did you have a nice bank holiday? How is life and work treating you right now?\n\nPS I need to figure notifications on this thing out because I never get any for you!",
        "ts": "1566852974.002100",
        "username": "Lisa Koelle (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-26\/732468275329_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]