[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Rebecca,\n\nI am sorry for such a delayed response. It has been a very stressful and busy past couple of weeks. I hope you, your friends and family are doing okay in these uncertain times.\n\nI stopped going into work a little over a week ago because of fear for getting sick and passing it on to my partner. Our baby boy was also just born yesterday! My partner and I are absolutely overjoyed, and sleep deprived already ha, so I hope this message is at least semi-coherent.\n\nHow have things been for you? Are you able to continue your course work from home? In case you hadn't already seen some of this, I saw some education resources are being made available for free right now\/during this pandemic. Maybe if you have some spare social distancing time, some of them might be of interest for you? Here's one for game animation, which I've not watched before (so don't know how good the lessons are), but I thought why not share it in case it's of interest?\n\n<https:\/\/twitter.com\/shumface\/status\/1243656195623120897?s=19|https:\/\/twitter.com\/shumface\/status\/1243656195623120897?s=19>\n\nIt's fun to hear you are interested in more stylised feature animation. I think this area of animation totally offers amazing opportunities for focusing on conveying feeling and emotion through character driven animated storytelling.\n\nThanks for sharing more of your interests! Borrowed Time is really nice. I haven't seen it in a while, but I do remember loving the detail and subtlely that they went into with the character facial animation in that short. If remember correctly, I think a couple of animators\/multi-talented people from Pixar helped make that.\n\nBest friend is so really well done too. The French animation school Gobelins, which I think is where that one was made, consistently releases a world leading batch of animated shorts every year. I remember being blown away as a CG student (and I still am 10+ years later) that students were responsible for that level of work, for example an oldie but goodie out of Gobelins was called Octopadi.\n\nGames animation also seems to offer some nice animation opportunities, although maybe less common to offer the level of emotional performances often associated with feature anim.\n\nFrom what I understand about games animation, people working in them tend to get split up into two general groups.\n\nOne of those groups is working on the 'cinematic'\/pre-rendered aspects of the game, which to me are more like animated shorts rather than actual games animation, and do tend to offer some incredible character performance opportunities.\n\nThe other area of focus in games seems to be the 'in-game'\/real-time rendered side of games. I believe the in-game side has more of a focus on body mechanics and creature animation, which is still really fun to me too, although typically less character acting\/emotional performance oriented when compared to feature anim.\n\nTo try to answer your question about how focused industry professionals tend to be on one area, I think the bigger studios that work on VFX features, AAA games and feature animation all tend to be filled with people who are very focused on one particular area of expertise. It doesn't mean some don't have multiple areas of expertise as well, but this is less common.\n\nOn the flip side, commercials\/advertising and independent\/short animated film studios, as well as the smaller to medium sized VFX studios, do tend to have larger numbers of people who are well versed in multiple disciplines (3\/4+ really well developed skills)\n\nAnyhow, I did still want to apologise for not being more responsive, as I do truly want to keep this going (if it doesn't feel too slow for you).\n\nHope to speak again soon!\nJarl",
        "ts": "1585483087.000100",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-29\/1033748615093_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]