[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Rebecca\n\nIt’s nice to meet you! I’m excited you are interested in 3D animation and rigging :) I love both and can’t wait to try to help answer questions and\/or to try to give you support in your goals with either of those. I also hear you might be interested in modeling too? Those are all awesome areas to focus on, in my opinion haha :) It’s great that you are wanting to share some of your work too. Please do send it along!\n\nI also wanted to try to introduce myself a bit, just in case it helps bring up any questions \/ so you know where I’m coming from.\n\nI’m an animator and former rigger, currently working at MPC in London. I started out in VFX as a rigger at Framestore in London back in 2010 working on the movie Gravity. I worked at Framestore for over 7 years, the first 3 as a rigger\/last four as a lead rigger.\n\nAnimation has always been my biggest passion, and I finally made the leap into being an animator about two years ago. I got a job animating at a few medium-sized studios at first, and moved over to my current job at MPC about a year ago.\n\nLooking forward to getting this mentorship going!\nJarl",
        "ts": "1581977907.001700",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-17\/956320528976_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Also sorry I forgot to ask more about what you are up to! How did you get interested in 3D animation\/rigging? What programme are you studying animation in right now? Is there any particular style of animation or movie\/game\/etc that really inspires you?",
        "ts": "1581978293.001800",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-17\/944857870099_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]