[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Rebecca,\n\nI'm sorry for my delayed response. It has been a crazy week! My partner and I are having a baby very soon, and a week ago we were given 2 months notice to vacate our flat. Since we would like to avoid moving after the birth, we have been very busy this week trying to find a new flat.\n\nThankfully just yesterday we managed to find a new flat and received confirmation that the new landlord has accepted us, so things are certainly looking more positive now than earlier in the week. However, the flat isn't available to move into until 9 March, so we're now holding our breath that the baby doesn't come before then.\n\nAnyhow, I just wanted to share why I hadn't responded sooner, and also to try to give a heads up on why I might not respond as quickly as I would really like to over the course of the next few weeks.\n\nSo you've also been moving lately! I hope your move has gone okay.\n\nThanks for sharing Andreas Wannerstedt, he's got cool stuff! I'm impressed with how clean and well executed his work is. To me he seems to have a strong sense of design mixed with kinetic sculpture. Are those also areas of interest for you? \n\nI have a bunch of other thoughts below based on trying to get a feel for where you are coming from \/ what your interests might include. Please of course let me know if any of what I might be rambling on about either below or in the future feels like it's covering stuff you already know.\n\nWe are of course still getting to know eachother, so I do apologise if my below descriptions of anything do feel like I'm jumping to conclusions about what you may already be familiar with. The last thing I want to do is man-splain anything. My goal with describing various aspects of the animation industry is to try to clarify things that I hope might feel helpful for you in your career, and also to try to get more of a sense of what angle you might be coming from with your interest in modelling, rigging and animation.\n\nYou mentioned my switching into animation in a short amount of time. Switching into animation has actually felt like it has taken me quite a while haha! Maybe that is all about perspective. I did only recently take several online animation school courses, but I also spent countless evenings and weekends before that trying to build up my animation reel. In a sense I have been hoping to become an animator ever since studying in university over 10 years ago!\n\nWhen I was in Uni, I had to a certain extent already realised that what I was most passionate about was character animation. However, it was also at that time that major online character animation programmes such as Animation Mentor were starting to gain prominence. Seeing how amazing those programmes were, I realised that my Uni instructors were not nearly as well qualified to teach character animation as I was wanting. However, I had a few instructors that had strong professional backgrounds in areas such as rigging, and I also had some inspiring classmates who were a year ahead of me who were also focusing on rigging, so with these specific resources in front of me, I decided that I would pursue rigging because it seemed like the best way to take advantage of the education I could receive within that circumstance.\n\nHowever, I never really gave up hope that I might someday figure out a way into animation, and after getting my first industry job as a rigger at Framestore, I continued to spend a lot of my free time trying to improve my animation skills.\n\nTo try to respond to your question about whether it was intimidating moving from rigging to animation, I don't feel like it was for me. However, I am just so in love with character animation that it may be that I was just blinded by that haha.\n",
        "ts": "1582989867.000100",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-29\/965421856353_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I think it could feel intimidating in the sense that animation is such a competitive area of specialty. However, one thing that was very heartening for me during my studies was hearing so many industry pros talking on podcasts about how long it took them to become professional animators, and how it is totally worth it and to not give up.\n\nTo respond to your mentioning my moving from VFX to animation, I just thought it might also be worth trying to clarify in case there was any confusion about what I'm doing now, because I am still working in VFX, just as a VFX character animator now rather than a VFX character rigger. I only mention it because I myself wasn't nearly as aware of some of the divisions in types of computer animation before working in this industry. The film side of animation tends to be a very specialized workforce, so I figure it's worth trying to clarify that in case you would like to work in feature films some day and it might be helpful for you too. \n\nWhen I got my first job in this industry as a rigger at Framestore, I honestly didn't know what VFX really was. When I was in Uni, I had always imagined someday working in feature animation studios like Sony\/Pixar\/DreamWorks, and only after working in this industry for a while did I come to understand that these more cartoony types of studios are all what is called \"feature animation\", and for the most part they operate very differently from how VFX studios tend to work. \n\nAlthough in general all types of computer animation use similar skills and tools, each subsector of the animation industry tends to have highly specialized workers, and many of these people tend to mostly just work in one of of these subcategories of the animation industry.\n\nSome examples of these subcategories of the 3D animation industry are:\n\n- animation for VFX feature films and episodic\/streaming (Marvel, Jurrasic Park, Game of Thrones, etc)\n\n- animation for cartoony\/fully animated feature films (Disney\/Pixar\/Illumination\/DreamWorks\/etc)\n\n- animation for advertising (which can be cartoony, photoreal, abstract and\/or typographical\/motion graphics - to me this subcategory tends to have employees with the greatest versatility)\n\n- animation for video games\n\n- 2D animation for independent films (Klaus, Song of the Sea\/Triplets of Belleville\/Ernest and Celestin\/The Big Bad Fox\/The Red Turtle\/etc)\n\nHave you thought about whether any of these areas might be of interest to you? Or are you possibly interested in other Computer Graphics industries? There are of course further areas of specialty such as Architectural Visualization, Medical Visualization, etc. \n\nHope you are having a good weekend!",
        "ts": "1582989867.000200",
        "username": "Jarl (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-29\/965421856353_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]