[
    {
        "type": "message",
        "text": "I think you have lots of work and no time, but if you be able just text me back :) ",
        "user": "U5XGXM0PP",
        "ts": "1498594486.782948",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "75c29b255653",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-21\/201526816532_75c29b25565378adb519_72.png",
            "first_name": "Ewelina",
            "real_name": "Ewelina",
            "display_name": "ewelina",
            "team": "T4UUTPV18",
            "name": "ewelina",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    },
    {
        "type": "message",
        "text": "Hi Ewelina I am so sorry, you are right I'm so so busy. It's an interesting industry, I wouldn't necessarily say you need skills as such, you need a creative flair, the biggest thing you need to be able to do with a interior Design is to take your personal opinion out of the situation, at the end of the day you are designing for the client and not yourself. You need to build a relationship with your clients, my clients are very good friends of mine as you get so involved with their lives, the way they live etc. The job can be hard at times, it can be quite thought provoking, long long hours and hard grafting but the rewards are worth it. Have a look at some of the projects at my current work <http:\/\/www.foruminteriors.co.uk|www.foruminteriors.co.uk>\nI worked freelance for years, and basically I begged my current employer that she needed me, and the rest is history, before that I worked as a PA and then worked for a commercial design company that designed exhibitions, parties and events. \nHope that makes sense. Keep sending me questions and I promise to answer! ",
        "user": "U5WDKTPAL",
        "ts": "1498595323.085252",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "6788fd256268",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-21\/201209037828_6788fd25626825847754_72.jpg",
            "first_name": "Ellie",
            "real_name": "Ellie Faircloth",
            "display_name": "eleanorfaircloth",
            "team": "T4UUTPV18",
            "name": "eleanorfaircloth",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    }
]