[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Halima\n\nIt sounds like you'll get a lot out of the uni experience. It's definitely somewhere you can get involved as much (or as little) as you want. I made some of my best friends at uni, it was a great experience if you make it what you want it to be.\n\nYour situation with your subjects sounds really hard. I'm sorry you're in that situation and the 'adults' in your life don't seem to be listening. As you said, art is definitely something you can pick up in your spare time. I didn't do art after gcse but I've always kept it in my life through courses and museums etc. Have you definitely decided to drop it? \n\nI think it's unfair your teachers have been this way - they forget how stressful it is for young people these days. The pressure of getting into uni is real - I think we need to change this and take emphasis off grades and uni etc. But for now, you just have to get along with it until the summer. I'm sure you're going to do really well, you sound like a very diligent person.\n\nHave you thought more about a gap year? You could go away somewhere and do art. I lived in Paris for a year and it was the best thing I ever did! \n\nHope you had a nice weekend.\n\n",
        "ts": "1538927882.000100",
        "username": "Camilla Elwood (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-07\/450243316528_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Also - it's a shame about the philosophy teacher-  I always wanted to study that but I did politics instead, which was great and I did it for my degree too.",
        "ts": "1538927986.000100",
        "username": "Camilla Elwood (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2018-10-07\/450980383810_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]