[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Nya, hope you're well!\nI haven't done any personal short film, but when I start with a commercial piece, I usually write down the main ideas I have for it, like broad actions that should take place, and organise it in topics, that are basically the scenes I'm thinking of. There's many ways of doing it, what works best for you. I don't write too much - from those topics I'd then draw a very rough storyboard, really sketchy drawings with some notes on it, like the main words of the lines (if there's any dialogue) or notes to help identify what's happening there. I'd do that and than edit it as an animatic or else just draw the animatic directly on some software like flash or storyboard pro, that's what I'm most used to.\nAfter I get the right timing for the scenes, I'd redraw the panels I need to have a clearer action, and add drawings where the actions require it so you better understand what's going on. If it's needed I'd record a temporary dialogue\/narration myself, with the adequate tone and duration I want, and time the scene\/drawings to the audio.\nFrom there I'd draw the layouts of the background with proper sizes, proportions and everything base on the storyboard, and place a temp model of the character on it so I know the background fits the size of character and the action that it taking place in it.\nOnce I have the the layouts I'd start the rough animation of the characters placing key poses and determining the beginning and ending of the actions, character positions on the background (the staging), and by every scene or so that I do the rough animation, I replace it into the animatic so I can watch the whole thing and get a sense of the whole piece.\nThen you just finish all animation, see if it works as a complete film, and finalise it with what's necessary, be it final line, colour or whatever you need. If there's dialogue, you'd have the final audio added before you animate it ( at least before the lip synch, so you don't have to redo it).\nUsually when you're at the point you have a good animatic you can send it to the person who's doing the music if you have music in it.\nI hope that helps!",
        "ts": "1571661463.002100",
        "username": "Marcelo Perin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-21\/804699860919_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "It does, thank you Marcelo, I’m gonna experiment with this process and try to find a storyboarding program.",
        "ts": "1571678423.002200",
        "username": "Nya (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-10-21\/802829242548_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]