[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Victoria,",
        "ts": "1586683035.002000",
        "username": "Jake Cross (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-12\/1057130429859_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "So yes I'm aware you're currently doing an MA but you're about to head out into the real world in not too long which is surely exciting. I'm glad you've actually had that experience as an editor as it clearly gave you an insight into what you didn't want to do. This is really important and you'll no doubt go through it again within the industry. You might even end up not liking 2D, you just don't know until you've done it all in a production environment. I want to make sure that you know I'll tell you exactly how it is in the industry and I won't beat around the bush because that's exactly what I would have wanted if I was in your shoes. Funnily enough, as you mentioned shotgun, that's cool if you've been using it to organize your project pipeline as there are definitely studios that use it. Will you use it as an artist? Yes, depending on the studio to be honest. You won't be using it to necessarily organize other people per say though as you'll all be contributing assets as artists versus maintaining it like a pipeline TD would be doing among other things. From what I can tell, it's something you've enjoyed doing but ultimately not something you want to go into versus the prospect of doing 2D. Also side note, if you ever want any random advice about your project, even constructive criticism or any last minute tweak ideas to give it that extra 10%, you can totally show me and I'll bring some advice to the table. Group projects are so important looking back now. They're brutal in terms of work required which in hindsight more than prepares you for the industry mentally and physically as we all know, overtime is very common sadly but that's another topic entirely which is something I'll also openly talk to you about if you want.  Wherever you can, try to be as efficient as possible with the time you spend actually working so you do have other time to have a life and just chill out and enjoy time for your hobbies like you said. You want to avoid burn out at all costs, I've been there during final major projects too, It's really not fun. The industry right now is as you've probably seen across socials very much remotely set up and running. Different companies have had to do more or less setup to get to this point. Some studios sold themselves pre-corona on their ability to work 100% in the cloud like Untold Studios for example and then some companies like mine were more or less 100% based on physical workstations so IT have had to get solutions in place really fast. They've been amazing. I'm able to work from home and honestly the setup is great as I'm just remote logging into my machine in the office essentially. We're using something called \"nomachine\" which is amazing and free believe it or not. Provided your internet is good enough (generally speaking over 25mbit\/s, you're good to go really). We clock in and out digitally so HR can log project hours for financial reasons and also check people are working which is very odd considering we never did that in person so I'm not too sure why their trust has suddenly evaporated just because everyone's at home but oh well. To get on to the point of what I did after uni in order to get my foot in the door, here's what I would say. The first thing you want to do is realize you're essentially a service to these companies and therefore you need to market yourself by clearly showcasing what you can and want to bring to a studio. There's absolutely the human side to all of this, we're not just a service, we're people at the end of the day of course but you need to get into that marketing mindset early on when looking for jobs and get ready to use all the amazing tools we have nowadays. So what I did was reverse engineer the whole process, put myself in the recruiter's shoes and asked myself, who would be the perfect candidate for X role (X role being the one you want \/ will apply for i.e potentially a junior roto \/ paint artist or a junior compositor in your case I guess). Now, once you've t",
        "ts": "1586684513.002100",
        "username": "Jake Cross (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-12\/1046692988727_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "hought about that, you'll realise that the compnay will have a checklist in their head which will naturally go as follows :",
        "ts": "1586684513.002200",
        "username": "Jake Cross (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-12\/1046692988727_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "is their work great? can they rock up and do what we need them to do in that position? (nobody is perfect and can do it all from day 1 though don't worry)",
        "ts": "1586684629.002300",
        "username": "Jake Cross (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-12\/1077973950064_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "how do they come across during an interview, are they hard to talk to, are they boring, are they easy going, can you somewhat tell they'll be a nightmare to work with? if you've got an interview, know that they've already seen your work and they like it enough to see if you'd be a good fit within the team so they've got to see a bit of your personality essentially.",
        "ts": "1586684749.002400",
        "username": "Jake Cross (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-12\/1053490786054_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "it's really important as it can make or break an application process but honestly, please don't get scared by interviews. I'm sure both you and your fellow students are probably somewhat scared or apprehensive of them but honestly they're just an excuse \/ opportunity for them to cut down on people they don't see working with in person. With a marketing mindset applied here, it's your chance to just sell your personality so just be yourself at the end of the day and be polite, have a laugh if possible, they're only human so it goes a lot way trust me. It's never going to be a really formal process like in lots of other sectors, we're all making art let's face it. People generally speaking are all really nice and pretty cool to be honest. People that are hard to work with don't come around too often in VFX. Word gets around fast if you're nasty. So going back to what to do after uni, once you know what you want to apply for and the work required for it, you'll know how to tailor your showreel, your CV and your interview. I'd say apply to everything essentially, play the numbers game, don't be that person who just applies for ILM or MPC because they only want to work in film for example..I've seen loads of students do it, it's most often not the best way to go about it. You want to apply for anything and everything offering the role you want, ideally across each country you'd be happy to work in (being open to working abroad will obviously increase the number of places to can apply to). Treat this application process as a 9 - 5. It's boring but it's got to be done. Just get those numbers up and give yourself the highest percentage of getting replies (most places you apply to won't even answer as they'll sadly have tons of applicants). In terms of the application itself, i think the ideal candidate in the eyes of recruiters \/ companies will have this sort of setup : - A demo reel (vimeo is the way to go) - an online portfolio in case the prefer seeing it one page like Artstation (artstation is free and perfect for this as it's becoming the standard) - a social media account like Instagram or behance etc where you're clearly marketing yourself and taking it seriously (this shows you know what you want and you're already in that marketing mindset) - a LinkedIn profile (this one's pretty obvious but it's an absolute must nowadays regardless of the indsutry so make sure yours in up to date, has no typos and has a working link to your portfolio at the top for recruiters.",
        "ts": "1586685705.002500",
        "username": "Jake Cross (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-12\/1046695925239_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Once you've got all those setup and they all revolve around you and your \"brand\" - which is something you want to start thinking about now going forward as it's great to bond all your online activity together under a brand \/ name which you can essentially push on socials over time. Often in the industry it's who you know, but in a good way i.e you've worked with someone and you both worked well together so they'll put in a good word for you if they're at a different company for example. It goes a long way. I've just had an interview funnily enough for another studio where there are 3 former colleagues of mine so that's a massive bonus as the recruiter knew that and they can go to them to ask them what I'm like to work with which will do me well.",
        "ts": "1586685974.002600",
        "username": "Jake Cross (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-12\/1057757584341_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "You'll notice how I randomly came up with @dreameuur for my socials going forward, which is on my LinkedIn too so it points back to my Insta for them to check out my stuff if they're browsing LinkedIn profiles. It's all about the overall branding. I actually need to sort out my artstation now that we're talking about this funnily enough. Nobody is perfect but I need to try and be as good as I can in that sense. I think you get the idea here. In terms of your actual showreel, what we could do is tha tI get one of my 2D colleagues to view it instead of me to give you tailored advice. It's either that or for this aspect of what you need help with, we'd have to get you someone else to critique it as I'm a 3D artist by trade and I want to make sure you get the best eyes on it.",
        "ts": "1586686299.002700",
        "username": "Jake Cross (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-12\/1053495057942_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Have you thought about how you want your CV to come accross? I would certainly say that something a bit more interesting than the usual word document goes a long way. It's secretly a chance to display a bit of creativity and show that you've really put some effort into your application. A lot of people will skim read it, some will bother to properly read it so either way it's still important to get right. I've watched my boss go through applicants and it's really boring for him. Most reels aren't great and their CVs are rather boring. It's nice to be visually entertained i.e not just boring black text. What's worked for me so far is something visual, short, clear and to the point of what I'm offering. I'll try and include the CV here actually. It's the one I've recently been using to apply for different positions (they really want to keep me at my current company but I want more pay and a change of scenery long story short). Also side note, I'm not against talking about the topic of money, I personally don't see the stigma around it. It's important and I think people should be open and talk about it so we can move forward as an industry so if you want to know what I earn or what others earn at various positions within their careers, just ask :slightly_smiling_face:",
        "ts": "1586686675.002800",
        "username": "Jake Cross (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-12\/1057760940037_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "text": "",
        "files": [
            {
                "id": "F011P50HC2X",
                "created": 1586686693,
                "timestamp": 1586686693,
                "name": "JAKE CROSS CV 2020.pdf",
                "title": "JAKE CROSS CV 2020",
                "mimetype": "application\/pdf",
                "filetype": "pdf",
                "pretty_type": "PDF",
                "user": "U6D2VCN07",
                "editable": false,
                "size": 1753201,
                "mode": "hosted",
                "is_external": false,
                "external_type": "",
                "is_public": true,
                "public_url_shared": false,
                "display_as_bot": false,
                "username": "",
                "url_private": "https:\/\/files.slack.com\/files-pri\/T4UUTPV18-F011P50HC2X\/jake_cross_cv_2020.pdf?t=xoxe-164979811042-1081742544354-1080362743317-fee6284c0ee20406565ca4cadf37d845",
                "url_private_download": "https:\/\/files.slack.com\/files-pri\/T4UUTPV18-F011P50HC2X\/download\/jake_cross_cv_2020.pdf?t=xoxe-164979811042-1081742544354-1080362743317-fee6284c0ee20406565ca4cadf37d845",
                "thumb_pdf": "https:\/\/files.slack.com\/files-tmb\/T4UUTPV18-F011P50HC2X-73c6bf1644\/jake_cross_cv_2020_thumb_pdf.png?t=xoxe-164979811042-1081742544354-1080362743317-fee6284c0ee20406565ca4cadf37d845",
                "thumb_pdf_w": 909,
                "thumb_pdf_h": 1286,
                "permalink": "https:\/\/prospela.slack.com\/files\/U6D2VCN07\/F011P50HC2X\/jake_cross_cv_2020.pdf",
                "permalink_public": "https:\/\/slack-files.com\/T4UUTPV18-F011P50HC2X-5787680adc",
                "is_starred": false,
                "has_rich_preview": false
            }
        ],
        "upload": true,
        "user": "U6D2VCN07",
        "display_as_bot": false,
        "ts": "1586686694.002900"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "You'll notice I've actually gone a step further and included QR codes for the super lazy people. It may be overkill and that's the one thing I'd potentially say isn't worth it but if it shows them I'm thinking out the box then it will have served its purpose beyond linking them to my socials (make sure they definitely work goes without saying).",
        "ts": "1586686789.003200",
        "username": "Jake Cross (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-12\/1077997004960_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Just noticed Slack has absolutely butchered my text within that pdf for some reason. That's very odd. But you get the gist I think. Keep it short and to the point.",
        "ts": "1586686849.003300",
        "username": "Jake Cross (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-12\/1046698608775_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "So now you're armed with a cracking reel, CV and portfolio to match on the major platforms, you're in the perfect position to the apply for different places. The way all the companies recruit is mainly online nowadays so that's good for you as it's accessible 24\/7 anywhere. As discussed earlier, play the numbers game because you can count on most of them not even replying sadly. I rinsed LinkedIn, various google documents acting as job boards, generic google searches, facebook groups, the whole lot.",
        "ts": "1586687059.003400",
        "username": "Jake Cross (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-12\/1067441706945_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "To be honest, in the scheme of things, LinkedIn is quickly becoming one of the best social networks because it not only acts as your online CV for certain applications where they don't want your own uploaded one but also acts a job board for companies to share job offers etc. It's honestly so good and this past year I've watched it blow up in terms of artists marketing themselves whereas there was somewhat of a \"boring business only\" vibe to it all and art was almost frowned upon.",
        "ts": "1586687270.003500",
        "username": "Jake Cross (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-12\/1057763694069_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "During applications as you'll notice, you'll have to sometimes write a cover letter. I'm half way between advising you to write a one off tailored letter for each company and telling you to just use a template. I sit in the middle in the sense that what I did which worked but helped me keep my time input to a minimum was check out tips and advice on how wot write a great one first and foremost. Once I had that sorted out and tailored to 3D generalist roles at the time, I only had to change the name of the company I was applying for and sometimes a line or two about how I'd love to work in the city they were located in. It's a fast way of having your own \"template\" so to speak which still has quality marketing talk built in tailored to the company and position you're applying to. Win win.",
        "ts": "1586687572.003600",
        "username": "Jake Cross (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-12\/1046700304199_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I think that should cover the application process as a whole really. During an interview they sometimes ask you how much you're looking for, sometimes it's actually part of your application from the get go. As a junior I would say, generally speaking you won't be able to get much but that's fine to an extent as you'll be using that first year or so to gain the most experience possible so you're more valuable to the company you work for which in turn gives you leverage to command more. It's all about leverage, as heads up.",
        "ts": "1586687731.003700",
        "username": "Jake Cross (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-12\/1078006756512_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I think I'll let you process this first so I can give my keyboard a break and you can have a think about how you want to go about landing your first role :slightly_smiling_face:",
        "ts": "1586687828.003800",
        "username": "Jake Cross (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-12\/1057766387557_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]