[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Juba, thank you so much for taking the time out to look at it! \nThe comments you made were super helpful and and just what I needed to take it to the next level (the first and last poses never felt quite right, but the sketch you made over them made me realise how much I can push those poses :D)\nI'm planning to put this piece in my showreel so any additional feedback you can give me is always greatly appreciated :) I'll most likely come back to this shot after I've made some good progress on my creature anim\nIt's a great insight to hear how you found working remotely as well, I haven't heard much about it at uni but I'll be sure to keep in mind your take on it if the opportunity ever arises :o it sounds a little similar to my situation at the moment admittedly - I find myself having to work at home a lot of the time as my back condition prevents me from working in our uni chairs (those darned seats!)\nI'm hoping that I can convince my lecturers to let me use their desks as I've heard they can used as standing desks (fingers crossed!)\n\nSo far the process for our project has been a fun time, it's been interesting to see how our vertical slice\/narrative has evolved over the last semester! I'm currently working with three other animators, and we're using UE4 to render our film - I was able to gain some knowledge of the pipeline back during my second year games project which was fortunate :D\nWe have some freelancers helping out with the project as well, with one modelling the burger, the other modelling the spy and the last being our rigger for both our spy and burger (specifically making bun decorations\/squash when the spy holds it)\nAt this point we're at the final stages for both models, our freelancer for the spy is making some final tweaks and then it'll be off to our rigger, in the meantime my main group have been making adjustments to the environment\/props - am very keen to start animating now as modelling isn't one of my fortès haha\nI'm curious to know how did you find creating your final year project? Were you also in a team or was it solo?",
        "ts": "1580350816.000300",
        "username": "Alex Selby (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-29\/916956584179_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Apologies for the late reply (and the massive text I just sent there :sweat_smile:), hope you're having a great week!",
        "ts": "1580350901.000400",
        "username": "Alex Selby (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-29\/930636430326_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]