[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I think its important to make sure your idea is feasible for the time you have available. It would suck to have a potentially incredible, unique film which can't be fully executed how you imagined, due to the time limit you have. It is great you're going down the live action route since I believe Framestore really values seeing seamless visual effects integrated into live footage. For instance, if you shot a building and then tracked it &amp; remodelled it in CG to break, then that would already stand out because its about being able to make a shot believeable and realistic rather than showing simulation in isolation without any sort of scene integration and context. I'm not sure about the brief for your 2nd year film but I think it's also important that your vfx helps add to the story you're trying to tell and you're not attempting to be overly complex and then falling short. With showreels, it isn't necessarily about quantity of what you have in there, but the quality, which is something to keep in mind too - so don't worry about having to churn out lots of FX examples for your application.",
        "ts": "1575495290.001900",
        "username": "Lucy (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-04\/862159424423_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Also, in case you didn't already know, we have a podcast :slightly_smiling_face: <https:\/\/www.accessvfx.org\/podcast> please let me know if there is a topic you think should be covered and I can suggest it!",
        "ts": "1575496108.002000",
        "username": "Lucy (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-04\/859862671668_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]