[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Why thank you! Honestly I don't really animate outside of work. I do extra things sometimes through work, but at the end of a long day of animating the last thing I want to do is animate more. For me I need to do other things that I enjoy outside of work to keep me happy and motivated at work. Is there anything you like to do outside of the animation world?",
        "ts": "1562919221.003900",
        "username": "Chloé Deneuve (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-12\/681209448083_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I totally feel you there!! I currently work an administrative job and sometimes I have to go home and write essays for my course. Sometimes I just can’t bring myself to look at another computer screen after my 9-5 job! Working in animation must feel the same. It feels so nice to switch off from the online world and just do normal daily things ahaha. \n\nI have so many things that I enjoy doing outside of work. I love to draw original characters and learn more about the human anatomy to improve my drawings! I’ve been doing that for a few years now. I few years back I started a webtoon but could not continue with it as my life got so busy. I am still working on my story and I hope to some day make small animations for it!! I have bought Zbrush in a hope to learn the software and make my own 3D characters for animation one day! (Ahaha I just realised it came full circle back to animation, dang it :P) it totally keeps me motivated to work hard on animation as I’m determined to bring my characters to life one day!!\n\nI also like to brush up on my Japanese language skills as I don’t want to loose them after coming back from my job there a couple of years back. Among other things, I recently started taking a keen interest in interior design! It’s so random but it just brings me so much satisfaction being able to create beautiful spaces. \n\nWhat about you? What interests do you have outside of animation? :) ",
        "ts": "1562931956.004000",
        "username": "Sahra Al (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-12\/681373163122_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]