[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Sahra! \n\nYeah I hear you there on having to write essays after a long work day. I also studied anatomy at uni and I loved it, I think it’s really good an animator to know it. What was your webtoon about? It’s great that your passions still come full circle back to animation. \n\nOh interior design sounds very cool, have you done any for anyone? Seeing as I am sat at a desk all day my passions usually envolve movement. I run, cycle and box a lot. I also love to cook and go to evening events involving powerful female leaders. I think it’s really important to have great women to look up to. ",
        "ts": "1563433893.004100",
        "username": "Chloé Deneuve (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-18\/686903057251_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Oh wow you’re quite the active person! It’s great that you’re getting a healthy dose of activity after being sat at your desk as a day job! It’s great that you try to be involved with these kinds of events! As you said, having great women role models are important! Which events do you attend? There is this group that I joined a while back called Animated Women that seem to have good events like this. I never actually got to attend yet as I didn’t find a good time that didn’t clash with university but hopefully I’ll be able to attend some of their events in the future. They recently uploaded a list of animation podcasts that I am absolutely obsessed with at the moment!\n\nMy webtoon is basically about this dude going through a magic mirror into a different world and pretty much gets stuck there. He faces many cultural struggles and racial struggles. The story has super powers and magic :’) I love designing characters for this story! \n\nI haven’t had a chance to design for anyone yet, but hopefully some day! I’m still trying to learn interior design tips and tricks! :’D",
        "ts": "1563519350.004200",
        "username": "Sahra Al (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-18\/701449079303_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]