[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Good morning Sahra, my appologies for not responding earlier. I had a very busy day yesterday. Yes I was on AnimDojo in an interview actually, I need to go and check out what's new on the website too. Do you have a show reel you can show me yet? I was talking to our recruiter yesterday and we were talking about simplicity being something really nice to see in show reels, epecially in Blue Zoo's case. I am just in the middle of animating a little something for Gay Pride which will be released on Saturday on our social media feeds and you'll be able to see what I'm talking about a bit more. Then we can have a chat about it together and talk about why it's good to have in a reel. I actually started off my career at Mikros in Paris as a previs artist. I've been at Blue Zoo for three years now and made my way up from Junior Character Animator on season 1 of Numerblocks (you know it?), to now Senior Character Animator working on Paddington Bear the series.",
        "ts": "1562142461.002400",
        "username": "Chloé Deneuve (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-03\/685432282823_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I agree that there are many things to talk about when it comes to putting yourself in the best position for companies to recruit you, but we have time to talk about these things :slightly_smiling_face:",
        "ts": "1562142503.002500",
        "username": "Chloé Deneuve (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-03\/685432871015_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "<https:\/\/www.eventbrite.co.uk\/e\/access-vfx-animation-summer-school-tickets-60202941619> I've also just been sent this if you're interested?",
        "ts": "1562143493.002600",
        "username": "Chloé Deneuve (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-03\/683127027492_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "Eventbrite",
                "title": "ACCESS: VFX Animation Summer School",
                "title_link": "https:\/\/www.eventbrite.co.uk\/e\/access-vfx-animation-summer-school-tickets-60202941619",
                "text": "Do you love animation? Are you a parent, teacher or carer of a keen animator and want to find out more about how they can channel their love for animation into an exciting career in the visual effects (VFX), animation and games industries? According to a recent Screen Business report released last October, the UK’s visual effects and animation industry generates more than one billion pounds of added value for the UK economy. This shows VFX to be a vital component of the UK’s successful film, TV and advertising industries. This Summer ACCESS: VFX will partner with London SIGGRAPH, 3Dami, Escape Studios and We Are Stripes to host our ‘Animation Summer School’ a 3-day family-event for 11-16-year olds interested in a career in the exciting UK animation industry. We will host a range of free workshops across 3 days on: Thursday 8th August Friday 9th August Saturday 10th August Please express your interest in attending by signing up for a free ticket on a date of your choosing. We will then get in touch separately to confirm your place at the event and keep you posted on our plans for the day. We are currently working on building the content for the workshops across the 3 days, but can promise that the experience will provide a fresh perspective on attainable creative careers, a chance to connect with industry professionals first-hand and gain optional mentorship. We hope that by spreading the word to fresh and inclusive communities of people, providing Inspiration, sparking Aspiration, will in time, lead to Application. About our partners: Escape Studios offer undergraduate, postgraduate and short courses in visual efects, game art, animation and motion graphics. Escape work with an impressive list of industry partners to design and deliver their courses, from MPC, Cinesite, Framestore and The Mill, through to Jellyfish, Milk and BlueBolt. 3Dami is a non-profit organisation founded to promote digital art amongst pre-university students, by linking them with each other and industry. It runs free seven day summer and half term camps, getting groups of nine students to run their own studios, and make their own short 3D animated film using Blender. London ACM SIGGRAPH is a local non-profit, volunteer organisation run and made up of local professionals. They host events for the computer graphics community in London, reach out to other communities and aim to promote contact and information exchange. We Are Stripes create and increase opportunities for individuals from ethnic backgrounds by educating on career entry into the industry and supporting current BAME (black, Asian and minority ethnic) individuals in the industry with career progression. Animation Mentor is an online animation school that teaches students character animation skills where students are taught by mentors; experienced animators who are professionals working in the animation industry. Animation Mentor is a distance learning school at which animation professionals teach character animation to students in over 105 countries. #avfxsummerschool",
                "fallback": "Eventbrite: ACCESS: VFX Animation Summer School",
                "image_url": "https:\/\/img.evbuc.com\/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F60202876%2F64872761663%2F1%2Foriginal.20190411-121528?w=1000&auto=compress&rect=0%2C0%2C2160%2C1080&s=247687868cd4521d754e48905f968861",
                "fields": [
                    {
                        "title": "Where",
                        "value": "190 High Holborn, London, WC1V 7BH, United Kingdom",
                        "short": true
                    },
                    {
                        "title": "When",
                        "value": "Multiple Dates",
                        "short": true
                    }
                ],
                "from_url": "https:\/\/www.eventbrite.co.uk\/e\/access-vfx-animation-summer-school-tickets-60202941619",
                "image_width": 500,
                "image_height": 250,
                "image_bytes": 47466,
                "service_icon": "https:\/\/cdn.evbstatic.com\/s3-build\/perm_001\/eba891\/django\/images\/touch_icons\/apple-touch-icon-180x180.png",
                "id": 1,
                "original_url": "https:\/\/www.eventbrite.co.uk\/e\/access-vfx-animation-summer-school-tickets-60202941619"
            }
        ]
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "No worries at all, Chloe! I’d love to discuss the short animation on Gay Pride with you once it’s out! :D Must be quite busy putting it together before the debut :) I have heard of Numberblocks from Blue Zoo’s news feed but haven’t had the chance to try out the app yet. I was pleasantly surprised to find BZ animating for apps as well as TV series! \n\nWorking in pre-vis sounds like a good place to start as an animator! I didn’t realise there was a Paddington bear series until you mentioned it! That’s so awesome!! I watched the movies and quite enjoyed them actually! How are you finding the work? Is it challenging working on a TV series? I hear so many horror stories about having to animation many frames per day and it really makes me nervous as I’m not the fastest person in the world! Working on it though! :muscle::muscle::sparkles:\n\nI don’t have a proper reel with which to apply for jobs yet. I have compiled my year 1 work into a “student reel”. I realise that it needs a lot of work in terms of fluidity. I hope to refine what I have so far and add to it by the time I graduate next year. Please check out my website: <http:\/\/Sahra-al.com|Sahra-al.com> . On there you will find some of my character design work and student reel. I also have a blog in which I ramble about a few things I’ve learned while studying. Please feel free to look around :’) if you have time, I’d love to hear your opinion :relieved:",
        "ts": "1562183294.002800",
        "username": "Sahra Al (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-03\/678008914353_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "In regards to the Access event, I had a look at it previously and found that it’s aimed for 11-16 year olds, so I would most probably not be able to go :laughing:",
        "ts": "1562183463.002900",
        "username": "Sahra Al (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-03\/686506617302_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]