[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Chloe! how was Thursday?? I saw the pictures on Facebook and it looked great! I would have loved to attend! One person I got to know via access VfX landed their first job with Blue Zoo!! I’m so happy for him!! He totally deserves it!! :D ",
        "ts": "1564147123.000400",
        "username": "Sahra Al (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-26\/700781736769_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Sahra! Thursday was another huge success! Did you watch the stream at all? Ah, who is the person you know that got a job with us here?\nI took a lot away from the programme. First of all, confidence in myself and what I can do, self-compassion and friendships. It's funny when you're in a room full of women and they tell you about their stresses and worries because it turns out that we all worry about the same things most of the time and it just feels good to not be alone and have their support. It was also really interesting getting different peoples viewpoints on things.",
        "ts": "1564152659.000500",
        "username": "Chloé Deneuve (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-26\/695829987234_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That’s awesome!! Its great when someone reaffirms your worries and fears so you know that your thoughts are genuine issues rather than silly ones. Sounds like a fantastic program to get into!! I’ll definitely keep tabs on it :D\n\nI was unable to watch the stream that day assuming it would be available to watch after it ended like with the first event but now I cannot find it on the Facebook page. Hopefully I’ll watch it once it’s uploaded on there :) \n\nThe person I was referring to was Lehi! Totally awesome guy with a tonne of amazing animation skills! Very best of luck to him! I’m sure he’ll do well!\nAnother person I met at the Access VFX event is Muniza, whom you’d be familiar with as you mentor her. We were both so happy and excited to have you as a mentor!! We’re both big fans of BZ and were chatting over some lunch (during the access vfx event in June) about our application to the internship program that neither of us got in the end :laughing: nothing will stop us from applying next year though!!! :muscle::muscle::sparkles:\n\nWe should all totally meet up for a cup of coffee one day or at another access\/qvfx event :smiley::sparkles:",
        "ts": "1564180794.000600",
        "username": "Sahra Al (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-26\/707732678912_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]