[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Sahra, I would say that the minimum salary needed to survive in London is around 21K but that really is the minimum. I started on 23K here myself and I managed to save costs by cycling to and from work. Are there any particular companies you're looking at?",
        "ts": "1573739634.001600",
        "username": "Chloé Deneuve (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-14\/834548863125_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thanks for the response Chloe! I appreciate that it’s a sensitive topic to discuss and thank you for revealing your starting figure! \n\nIf I was moving there alone then 23k would be enough to start me off but since my partner will be moving with me, I’m not sure it will work out for us under that salary. I saw an advert for junior animators by jellyfish so that’s why I asked :’) In any case, I will most probably not be able to work in London for the next few years due to responsibilities here in Cardiff. I just thought if the pay is good enough, maybe it would be worth considering. It’s such a shame that Cardiff doesn’t have any 3D animation studios anymore! Maybe Blue Zoo can come and set base here :rolling_on_the_floor_laughing:",
        "ts": "1573750165.001700",
        "username": "Sahra Al (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-14\/837074215910_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Of course! Sharing that kind of info is always helpful especially when starting out. It stops companies from being biased. What does your partner do? Maybe freelance would be a possibilty for you in the meantime if you're in Cardiff?",
        "ts": "1573750980.001800",
        "username": "Chloé Deneuve (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-14\/837101086838_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]