[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Sahra. How are you? My appologies for a late response, it's very busy here as per usual! Is the talk by James up yet on the facebook page or not? If not I'll ask for it to be put up.\nAh Lehi started here last Wednesday, he came along to both Q-VFX events so far and seems to also want to get involved in it which is great. How funny that you also know Muniza too :slightly_smiling_face: I'm very happy to have the both of you as my mentees. Yes, don't let this years not getting into the internship stop you. There were over 2000 applicants! And maybe I can guide the both of you in terms of getting your show reels ready for it. The next Q-VFX event is on Tuesday the 13th at a pub if you'd like to go then, I will be there and we could have that cup of coffee\/beer haha.",
        "ts": "1565001724.000700",
        "username": "Chloé Deneuve (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-05\/716193865360_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Chloe :) I’m good thank you! I hope you’re well! That’s okay!! No pressure on replying straight away! To be honest I panicked at first thinking I only had you as a mentor for 6 weeks only but it turns out there is no time limit on this so apologies for bombarding you with messages earlier :laughing: \n\nThank you so much! I’ll really appreciate your help on future internship applications! I’ve recently applied to the Framestore traineeship opportunity with what I have from my first year of university. I really wanted to make a new demo reel but since they are looking to have the interns start in September I thought it was too late to do anything now so I just submitted it as it is with a cover letter. I hope they read it :sob: I heard that recruiters don’t really read cover letters and focus on demo reels so if that’s the case I may be screwed :’) \n\nI didn’t know there was an event on the 13th! I don’t think I’ll be able to go to this one but I know there is an event on the 26th of September that I mayyyyy be able to go to! I’ll try to convince Muniza to come along! :D  As a side note, the video has not been uploaded to Facebook yet :’) \n\n",
        "ts": "1565010878.000800",
        "username": "Sahra Al (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-08-05\/709990558977_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]