[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Adam,\n\nI hope this doesn't sound strange but I really enjoy reading about you and how you think about things. I'm currently in counselling myself and it's fascinating to me to hear that there are others out there that spend time thinking about themselves in the deep way that you seem to. I am an deep thinker too! You seem to have such a lot on your shoulders and I'm so glad to read you have a psychologist friend - good grief I wish every one came with one of those friends! ^-^ Really well done for everything you have achieved against the odds. I hope every now and again you can understand just how amazing it is that you made it here!\n\nI'm not 100% sure what mentoring is either, but I'm happy to figure it out with you, if you're happy to allow me to do that to?! I don't feel like an expert, even though I have nearly 12 years experience! I am still learning and falling further in love with my industry every day! I was originally thinking I would treat this like having juniors on a job, something which I absolutely love to have. I love Junior animators that are fresh and keen, I can build them up in skills and confidence and speed. I love to do that when I can. But also, I can be an industry friend to you, not so much a boss! I hope that makes sense ^-^\n\nI am sad to hear about the structure of your course!! It seems incredibly frustrating to you, and I'm not surprised. However, you also have shown great independence already and I think you're obviously extremely dedicated to 'filling in the gaps.' I think this is the key to University if I'm honest. The learning that not everything is given to you, and you have to source your own time and resources to learn. I studied 3D Computer Animation at Swansea University and they taught Maya and Maya only, and yet I have worked in 3DS Max (very first job!!) After Effects, CelAction, Blender, Moho, Spine and a whole heap of others. Learning one software never stopped me entering the industry and I know it won't stop you.",
        "ts": "1543406453.011100",
        "username": "Dani Abram (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-28\/489932161219_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "•  Can I ask your opinion about 3ds max?\n\nYou sure can. I LOVE 3DS Max. I have spent roughly half my career animating in Max and still get jobs to this day where I will need to buy it for the month and work in it quickly. I think it offers great tools and I like the work flow. I have *normally* but not always used Biped. CATRig is something I got to work with in Children's TV and picked up quickly. When I finished my University degree, we had only worked in Maya, and I was put up for an interview for a games company. I didn't know the game when i went into the company, and I didn't know that the software was Max, not Maya. I think the hardest thing to learn and master is *actual character and acting animation*, I honestly think if you know that, software comes second and no one will turn you down if your showreel is amazing. I have, myself, argued the case for someone who is the better animator when hiring, because I know an animator can learn the basics of an animation toolset in less than a week and with my teaching have approved shots\/cycles quicker then someone who already knows the software but doesn't show a flare for motion.",
        "ts": "1543406765.011200",
        "username": "Dani Abram (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-28\/489869091828_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "•  What are the animation aspects employer looks at when you submit your portfolio to get a job?\n\nFor myself, I look for acting and a sense of fun. I love quirky, funny characters with a ton attitude and a clear character or emotion, rather then a showreel of ten run cycles. This is probably because I am a character animator, and I know a good character animator can bash out most things on a job. This is from a personal point of view however! At other studios, or on certain projects, we've been looking for specific things. For example, I worked at Aardman heading a CG team making facial animation for a movie called The Pirates. When we hired, we were looking for someone with excellent facial and lip sync skills above most else. So, again, a showreel of run cycles didn't get passed the first round. (Aardman get too many applications, we had to whittle them down quickly!) My counter question would be: what is your dream project to work on? Do you want to work on a super-awesome, extremely realistic, high-end fantasy game? Or do you want to work on a cartoony, funny, full of character TV show? Tell me what your dream character is, or your favourite animation you've ever seen that made you think 'bloody hell I wish I worked on that!' and I will tell you what they recruited for ;D",
        "ts": "1543407115.011300",
        "username": "Dani Abram (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-28\/489939804851_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "•  What are the animation skills (for example - good posture [easy pose readability], strong silhouettes and etc.) that I have to develop and have to put more effort in on the first place?\n\nTHIS IS A BEAUTIFUL QUESTION AND I LOVE YOU FOR ASKING IT! If you were on my team with this attitude you'd rise to the top of the pile so quickly. You seem hungry to learn more and more and more and that's exactly how I feel, still, now, back then and every day!\nI think the answer is broad, but encompasses quite of few of the principles, and that is 'emotion.' If you can develop your understanding of why a character is feeling a certain way, then that will inform immediately the POSES. During a shot or a sequence, the character is telling a whole story to the audience, through their speech, their poses, their actions, their movements and even their placement on the screen. Strong silhouettes and poses go hand-in-hand. Readability and strong silhouettes go hand-in-hand. They're all linked, linked by story. And there's no story without emotion.",
        "ts": "1543407467.011400",
        "username": "Dani Abram (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-28\/490245575941_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Send me what you're working on, and tell me why you're working on it. I'd absolutely love to see it! Even if it's in first stages\/blocking. I have to block my own work remember, none of us have forgotten what 'rough' looks like, I promise :slightly_smiling_face:",
        "ts": "1543407528.011500",
        "username": "Dani Abram (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-11-28\/489877669684_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]