[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "For my own workflow, I would always want to reposition that hand myself. So I would set a key on the hand, move to the next frame, set it to IK and then reposition that hand from there. I don't quite remember if there's a way of anchoring it with that rig - I don't think so. I know what you mean about being able to do it in Max - it's one of the reasons I love Max!! Same for the layers - much easier to work with in 3DS Max. But there is absolutely nothing wrong with doing it yourself - it teaches you more about posing, motion, where movement comes from, what moves what etc. It is funny now how animation is kind of going the way of 'tools' instead of 'I know how things move, this should be here' and doing it by hand. If you were drawing, you'd have to draw it again! Ya know? I'm really glad you watched the footage again and again. I wish I was there in person so I could show you and we could understand it together! It's quite hard to explain things by essay.",
        "ts": "1548235085.002400",
        "username": "Dani Abram (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-23\/530642617011_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "But you're doing SO WELL, I hope I am coming across as positive! You seem so hungry to understand motion and I love it!",
        "ts": "1548235127.002500",
        "username": "Dani Abram (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-23\/530748477666_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thank you for your feedback! Defo you’re coming across as positive. I wish every padawan would have an Animation master like you :slightly_smiling_face:\nI believe in horoscopes a bit. So, as Aries – I born in April. That means (at least in my case) that I’m always strict to myself (disciplined), direct and straightforward.\n\nIf the right people are strict to me, I take it in a good way. They spend their time on me. I respect and appreciate it. Cos again, time is the most valuable thing we, as human, have.\n\nDani, thank you very much indeed for your time and experience!",
        "ts": "1548266986.002600",
        "username": "Adam (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-23\/530660757969_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I'm trying to approach animation as my work, rather than just a personal project.\n\nI agree with the animation process automation. People become dependent on these tools. When it comes to me, I try to automate the process to save my time and time for production.\nNowadays, the industry wants more and more. As a human being, it's hard to keep up with that pace. Quality or quantity will suffer.\nBtw, Me and 2 of my acquaintances (programmer and animator) found some grey hairs. They are 20, I'm 25. Haha, it comes with the territory apparently.\nPersonally, I try to find a way to do the same operation more efficiently. At least for now. Cos everywhere (companies) could be different - from apps used for projects to different approaches. It's good to know how to achieve the required result using different methods.",
        "ts": "1548267265.002700",
        "username": "Adam (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-23\/532324468535_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yes, I do agree with you, there are some extremely beneficial plug-ins and tools that make our favourite softwares more production friendly. I think for Maya there was an animation plug-in called 'Pi' that we used on some jobs, it copies poses and animation from multiple bones and pastes them correctly, or mirrors them correctly. I wonder if that might help you? I'm not 100% sure if it was free... but I think so! (gosh you think you're grey! I'm going senile!)",
        "ts": "1548275576.002800",
        "username": "Dani Abram (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-23\/531259064964_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "However, every studio has a different way of working and you can not learn them all. It is all moving at quite a pace, there are advances and new styles being explored all the time, but the consistent element is always characterful and emotive, wonderful, correct animation, ya know? Have you any acting assignments at all? focusing on performance, rather than mechanics? Or do you feel like you belong to the realistic, more anatomically-focused style of animation (I guess things like games cycles and actions etc) i would love to see you tackle an acting shot :slightly_smiling_face:",
        "ts": "1548275754.002900",
        "username": "Dani Abram (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-23\/531427149554_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "When I worked in games, they company had so many of their own proprietary tools, that all I used 3DS Max for was opening and closing scenes!!! They had plugin after plugin loaded so that I worked from a separate window! Very funny :stuck_out_tongue: And I worked at Aardman too, and they had much the same. It was a Maya pipeline but the animation I was working on worked out of a 'Pose library' that they had created! So you can never really learn that - just learn the habit of being open and ready!",
        "ts": "1548275910.003000",
        "username": "Dani Abram (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-23\/531629619717_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "PS. I'm a Leo! I don't know what that makes me :stuck_out_tongue:",
        "ts": "1548275950.003100",
        "username": "Dani Abram (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-23\/532485742519_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]