[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I don't think it matters, there's a deadline to allow for as many people to apply as possible, so from a company perspective it truly doesn't matter. I think if you feel you can get together an application you will be proud of, in the time before the deadline, then take it and use it :slightly_smiling_face:",
        "ts": "1549018326.006700",
        "username": "Dani Abram (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-02-01\/538907295601_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "But be careful it doesn't sneak up on you! It would be so great for you to get an internship, rather than work experience! There will be pay and you'll be treated like a proper member of the team, so awesome that there's opportunities like that.",
        "ts": "1549018418.006800",
        "username": "Dani Abram (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-02-01\/539714442437_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thank you, Dani! Thank you so much for sharing a link. I'm trying to find some more as well. I have found one at Ubisoft. You won't believe - it's in the same city - Leamington Spa. But the deadline is on the 11th of February. So, I'm not sure. I mean I know I can do better regarding the showreel. However, now I spend all of my time for Motion Builder and MoCap. But it's nothing to do with animation skills. It's more technical. But even so - let's see how it goes.",
        "ts": "1549024242.006900",
        "username": "Adam (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-02-01\/538841202800_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "To get an internship would be absolutely terrific. Don't get me wrong, I'm not (never) complaining. I need an internship - therefore I have to do everything I can. I'll do my best.",
        "ts": "1549024499.007000",
        "username": "Adam (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-02-01\/540643730055_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]