[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "They are very industry focused in this course. They try to teach us as much as possible for the first year and a half, a bit of everything, modelling, texturing, rigging, comp, lighting, but now it's up to us to get better in one area. This semester we have to do a group short film, a personal project and  we also have the luck to do a live project with a well known company in London. Next year is going to be mostly the whole year to develop a short film I think and maybe some personal projects. It is a bit frustrating now to be honest because I'm so used to having so much teaching and now this semester is all of the sudden my responsibility how much I learn",
        "ts": "1582713523.003900",
        "username": "Lucia Soares (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-26\/959634837201_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "The lecturers also arranged a lot of company tours",
        "ts": "1582713549.004000",
        "username": "Lucia Soares (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-26\/969747242608_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I'm actually going to visit the mill London in a few weeks",
        "ts": "1582713560.004100",
        "username": "Lucia Soares (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-26\/956958767074_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "One thing of this course is that there is a lot of amazing students here and that in one hand is really good but in the other hand makes me feel I'm not good enough if I don't make that type of work",
        "ts": "1582713755.004200",
        "username": "Lucia Soares (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-26\/969751638304_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "We use Maya and Zbrush, Mari. A bit of substance painter although they advise not to use it for film ( only for games students) , lighting is now taught in Houdini",
        "ts": "1582714089.004300",
        "username": "Lucia Soares (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-26\/969304323924_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "We also learn a bit of nuke",
        "ts": "1582714110.004400",
        "username": "Lucia Soares (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-26\/959647254673_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "But people who specialise in comp\/lighting have more classes about it",
        "ts": "1582714146.004500",
        "username": "Lucia Soares (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-26\/959648005937_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Yeah I can see how it might be a bit overwhelming to be taught how to do things, then being left alone to try it yourself. lol But that's kind of how it can be in the industry too. For example, The Mill in LA worked on the Apex Legends trailer. Which I'm not sure if you know much about, but it's a very \"stylized digital painting\" look. Well when we first started making it, we really had NO idea how to make that look they wanted and it's not like anyone made any online tutorials to how to make that look, we had to develop it ourselves. The supervisors all kind of had to work together and figure out how we can make a consistent look to tons of different assets. In the end we obviously figured it out, but the way we did our first trailer is extremely different to how we made it for our more recent (the 4th) trailer. We found better efficient methods on the 2nd and 3rd trailer that made the work a lot easier, and the \"look\" a lot cleaner. So definitely take what they are having you do at uni to heart! :slightly_smiling_face: You'll be a better problem solving artist, which is an ideal trait to have!\n\nAh I am so excited for you to visit The Mill London! I have never been there before but a few of my friends are out there right now helping on a project. I hear it's in the middle of a tons of shopping spots lol Let me know how it goes when you visit!\n\nI definitely understand how you feel about not feeling good enough compared to your peers. I feel that way too at work often, especially seeing junior artists coming in and seeing how naturally talented they are straight out of school! It definitely can get you feeling down and question your abilities, but it's normal to feel that way! What I've learned is that there is ALWAYS going to be someone better than you, it can't be helped. What's important is whether you let that feeling hold you back from trying, or have it motivate you to learn from them as well! Don't be afraid to befriend them or ask how they do things. Not everything is a competition, and you never know if you will end up working with them in the future at a company! When it comes to job prospects I hear a lot of supervisors say they rather have a junior artist who doesn't have much skill but is eager to learn\/improve, compared to a junior artist who thinks they know everything and doesn't want to take any creative criticism or learn more things. \"You can teach skill, but you can't teach personality\" is what one of my first supervisors told me. :slightly_smiling_face: So hang in there! You never know who may be thinking the same as you lol\n\nThat's great to hear that you're learning Maya, Zbrush, and Mari!! Definitely the most important programs you should be learning. Are they teaching you about colorspace for texturing as well? It's a bit technical but extremely important to nail as a junior artist. Ah yeah Substance for film isn't really ideal, but for commercials we use it often because of how quick it is to texture things. We use both Mari and Substance here at The Mill LA. I forgot to ask, what you do enjoy modeling\/texturing? Do you enjoy hard surface,r orangic elements or characters? I prefer hard surface but am learning to be more proficient for character modeling lol",
        "ts": "1582761072.004600",
        "username": "Samantha (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-26\/970667975620_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]