[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Ok! Great start! Looks like you're getting to grips with most of it. You've got a lot of overlap in there (which I like a lot) but there are a few fundamentals you need to polish up on.\nThe most obvious thing is the root\/hips. You don't have enough up and down movement on pretty much all the clips.\nThe root control is the centre of all your movement. Think of the body like a chain with all the bones connected being links in the chain. For the most part your root will be the first link in that chain and everything else will react to the root moving.\nWith that in mind you can animate the overlap properly which, as I said, you've made a good start on.\nBut the root also drives the motion of the body (most of the time).\nSo. Taking your jump example, it looks like your most of the way there but the guy just doesn't jump high enough. For a jump you want a really nice arc on the root as you jump from one place to another. At the moment it's quite flat and linear. If you get a nice big arc on it everything will work much better and you'll get the weight on the landing nicer too. Do you know about motion trails? If you select the root and then turn on a motion trail you can see how the root is moving through space. That will help you see what trajectory the root is taking and you can adjust it in real time (although Mayas version of the motion trail is really laggy).\n\nThe same is true for the climb up the wall. Everything looks amazing up until the \"landing\" at the top. Instead of the root going up and then down to a nice settle at the end, the root just kind of slides into the last pose. Think about how you would do this in real life. After pulling yourself up your hips will go up and then down into your resting pose at the end. Again, if you track the root control you can see how the hips are moving.\n\nThe dance is ok but I think they feet planting needs work. The problem with doing these sorts of exercises is that often dances look good because they have crazy moves in there which don't always look so good when you animate them. It's definitely a good start but I think you might need to do a little \"physics\" pass and think how the feet would be lifting and landing because of their weight and the body come down on them.\nAgain, check out the hips and see how they're moving as well. I bet they go up and down a bit more.\n\nThe standing up is probably the best one. Nice overlap (maybe a touch too much but it looks good). Did the tutor tell you to animate without the arms? (I know they like to do that sometimes). If you need to do it that way for the submission then ok but I reckon would could animate them in your spare time and make this look really nice.\n\nI've included a few screenshots. Sorry for the bad lines but I hope they illustrate what I was talking about in the first two examples. In both cases the red is what you currently have for your root arcs and the blue is what it should look like. This kind of motion for the hips is kind of fundamental. You'll find these kinds of arcs all over animation. If you did and remember the bouncing ball exercises that's basically how a lot of thing act in animation.\n\nI hope I've explained things ok. I have a tendency to waffle on a lot so I've tried to keep it concise but if anything is confusing or you want me to go into greater detail then let me know.\nFor now it's important to get the root moving properly. Then things will start to fall in place afterwards.\n\nHope this helps. Please keep asking questions if you have them. I'm happy to help.",
        "ts": "1585906645.002700",
        "username": "Steve Kimbrey (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-03\/1039420068625_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thank you so much for this its great help! As for the stand up, my tutor told us to not animate the arms as it was to just focus on the body movements but i will definitely go back and add them in! Presume the motion trails is a feature already included in maya?  I also cant seem find where you've added the screenshots",
        "ts": "1585923209.002800",
        "username": "izzy hudson (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-03\/1035618546194_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]