[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey, so sorry I missed these messages. This silly app doesn’t alert you when there is a new message!\n\nFirst thing to say is, if you’re looking for a permanent contract, you’re in the wrong industry. Visual effects is 95% short term contracts. You can expect 6 months up to a year as standard. Only after you’ve been at one company for 4-5 years will you have any chance at getting a permanent contract. And even then it’s not guaranteed. You’ll probably have more chance at a longer contract working as a department manager than as an artist. \n\nIf you’re still interested in becoming an artist then you’re in the right place at least. The Mill is a good company and there are good artists working there who I am sure will be happy to help you learn stuff in your spare time if you reach out to them and ask. I haven’t actually been given any info about your current experience in terms of education so I don’t know if you’ve done a degree anywhere? Or what subjects you’ve already studied? A degree isn’t essential for VFX but it definitely helps to get your application past the recruiters. After that the main thing will come down to your showreel, so you could work on that in your spare time.\n\nNow that you’re working within the industry the main thing will be to let the asset artists at the Mill know that it’s your interest and you would like to work with them. Tell them often and remind them all the time! Ask for advice and offer to pick up simple props to help them out in your spare time. Make contacts and show eagerness to learn. That’s your best shot I would say. Don’t give up learning in your spare time if texturing is what you really want to do. You can always send me work you’ve done personally and I’m happy to give feedback if that helps. \n\nGood luck",
        "ts": "1568656255.000200",
        "username": "Sally Wilson (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-16\/763810566471_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]