[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey! :wave: finally, some quiet time to think!\n\nSo here are the details : the situation has evolved since I wrote my application for this mentorship.\nAt the time, I was looking for a job as a Texture Artist but I started taking short-term contracts in admin support to pay my rent. Virtually everywhere the agency sends me, the company wants to keep me haha!\nHowever, those companies are in various industries such as finance, insurances, etc.. nothing close to artistic! Even if the team is super nice and they offer me a great salary and a role tailored to my wishes, it will never be the field that inspires me.\nBut all the appreciative comments I got on my work and professional attitude really lifted my spirits and it felt so good after all the fruitless efforts in finding a role as an artist!",
        "ts": "1567976565.000300",
        "username": "marie-line.despres (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-08\/755084114038_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Therefore, lately I decided to broaden out and maybe consider other roles than just Texture Artist. And since I had a wide experience in Admin support, I thought my skills could be of service in the VFX industry AND I could work in an artistic context. So I applied for a PA role at The Mill Film.\nThey did not shortlist me for that, however they submitted my name to interview again, but this time for an Asset Manager role.\nThe interview was on Thursday and I felt it went really well. I think I will get an answer at the beginning of this week. But I have been told that if I pick a job on the managing side, I will be labelled and it will be hard to go back as an artist...\nIn the meantime, before I contemplated the idea of a PA role, I signed up for a ZBrush class at my uni, just for fun and to gain more artistic skills which I think could help with my artist job hunt. I love it so much, it is incredible!\nSo now I feel that I am entangled in all those disparate options and I don't know what to do... All I know is that I am tired of the short-term contracts. I long to find a permanent job where I can finally settle and grow with an awesome team...",
        "ts": "1567977256.000400",
        "username": "marie-line.despres (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-08\/746467426017_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thank you so much for reading! I hope I didn't bore you with all my details! Have a great evening :slightly_smiling_face:",
        "ts": "1567977292.000500",
        "username": "marie-line.despres (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-09-08\/752407945204_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]