[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "_<@U5WMH4QGK|christian>.jeffery has joined the group_",
        "ts": "1507539259.000165",
        "username": "smooz (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-09\/254416462471_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "_@amysheikh05 has joined the group_",
        "ts": "1507539277.000018",
        "username": "smooz (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-09\/253329848098_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "text": "<!channel>, Iram we have matched you with Christian as your E-Mentor. Feel free to introduce yourselves and continue chatting within this channel. Why not send a quick video to say hello! :wave:\n\nI will now be leaving the channel, but please direct message myself or Emma if you have any questions. All the best! :smile:",
        "user": "U4VR52RQE",
        "ts": "1507539392.000177",
        "team": "T4UUTPV18",
        "user_team": "T4UUTPV18",
        "source_team": "T4UUTPV18",
        "user_profile": {
            "avatar_hash": "d730c1e93535",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-06-20\/201542361287_d730c1e93535ae06c852_72.png",
            "first_name": "Dexter",
            "real_name": "Dexter",
            "display_name": "dexter-prospela",
            "team": "T4UUTPV18",
            "name": "dexter-prospela",
            "is_restricted": false,
            "is_ultra_restricted": false
        }
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "_@dexter has left the group_",
        "ts": "1507539453.000245",
        "username": "smooz (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-09\/252680740688_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi. How are you? I am going to be busy for the next hour or so, but it would be great if you could introduce yourself, maybe say a few words about you're interests, what you would like to get out of this program etc. Looking forward to getting to know you and what you want in life!",
        "ts": "1507543400.000233",
        "username": "christian.jeffery (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-09\/254241693126_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hello Mr Christian. Im doing great thanks. \nIm looking forward to this programme and its really a pleasure to be mentored by you. \n\nFor my introduction - my name is Iram and im currently doing A-levels in English Biology and Mathematics. I've recently dropped Philosophy as an A-level because I felt the subject content was a bit nerve wracking hence chose Biology in its place as Im more familiar with the subject. However I do plan to get into a Russel Group University and obtain a Law degree. \n\nIve always been a very argumentative person and one of my major strengths has been English in terms of essay writing and analysis so keeping this in mind I plan to obtain a law degree.\n\nI do a alot of extracurricular activities such as sport, watching anime (japaneese animation) and Drawing. I also write fictional and nonfictional stories but i dont really publish them on sites such as Whatpad but i do plan to finish the book im writing now and publish it very soon on Whatpad.\n\n\n\n\n\n\n",
        "ts": "1507546964.000110",
        "username": "amysheikh05 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-09\/253306711251_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I do have questions -but ill ask them when your free. :)",
        "ts": "1507547078.000025",
        "username": "amysheikh05 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-09\/253383135730_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thanks for the introduction - hopefully I have some useful insights that I can offer over the next month or so. I thought it would be useful to tell you a bit about myself and what I do so that you understand where I am coming from and what I might be able to offer you in terms of advice.\n\nI am an Associate Director in a large consultancy based in London. We are hired by clients to provide knowledge or experience that they don't have themselves. Most of my work is in international disputes. When two companies disagree or go to court, each hires an \"Expert\" to present the facts and argue their case. That is my role. Basically I am paid to argue with the expert on the other side of the dispute - I put forward a case, they say why it is wrong, and I say why they are wrong. It's very fun, can be very hard work, and is very rewarding!\n\nMost of my work is in the energy industry, but I also work in transport, banking, and other sectors\n\nMy background - I have a Masters in Maths, as well as two in Philosophy. I think continuing in education is very important to keep developing as a person, so my two Philosophy Masters were done part time while I worked, mainly or fun! (Although they were useful at work as well, as I'm sure I'll explain at some point)\n\nSo, that's a brief (ish) introduction to me. If you've got any questions about that, or about anything else let me know! I'll try to post updates about what I'm up to at work regularly - it's not all glamorous, as my current activity shows - entering 17 years of corporate bank account data into a spreadsheet and trying to match amounts that should have been pain in to what was actually paid in. Very tedious!",
        "ts": "1507552043.000037",
        "username": "christian.jeffery (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-09\/254505530967_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thats really great. I do have many questions but to start off - What skills should a person have or need to become a lawyer or solicitor? And are there any specific things I would or should do in order to seperate me from every other law applicant? (Things that boost my personal statement perhaps) ",
        "ts": "1507561309.000415",
        "username": "amysheikh05 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-09\/253559672676_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": ":) it would be great if you could give me some tips on this. ",
        "ts": "1507561334.000252",
        "username": "amysheikh05 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-09\/252987688097_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I should have said in my intro - the disputes I work in are driven largely by the legal team, so I work closely with lawyers as well as our clients. Hopefully that means I can bring something useful to discussing law as a career.\n\nIn terms of separating yourself from other applicants, it all comes down to thinking about the skills that you need. Have you had any thoughts about that yourself? Obviously a large part of law is arguing a case - take relevant law, relevant facts, and use them to build an argument supporting your clients position. So being able to argue well is one very important skill, but there are lots of other skills that go into being able to do that effectively in the context of a law firm.",
        "ts": "1507563766.000201",
        "username": "christian.jeffery (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-09\/254416125062_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Ah, I understand. Thanks. \nMay I ask what A-levels you picked in your journey to become an 'Associate Director'. ? ",
        "ts": "1507566380.000411",
        "username": "amysheikh05 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-09\/254443203878_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "And Have you always wanted to become what you are today? If not, what made you change? ",
        "ts": "1507567389.000367",
        "username": "amysheikh05 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-09\/254653897175_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I should start by saying that I never planned on my career - it was never something that came up.\n\nI did maths, physics and chemistry, and AS further maths, psychology and geography. I did maths at university and got offered a job at a consultancy when I finished that, and that led to where i am today.",
        "ts": "1507571472.000392",
        "username": "christian.jeffery (Mentor)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-09\/253744714405_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Mhm, I see.\nWhat tips would you give to an average maths student like me in order to achieve the best grades possible in maths. Any specific\/particular revision tips from your experience? ",
        "ts": "1507582223.000471",
        "username": "amysheikh05 (Mentee)",
        "icons": {
            "image_48": "https:\/\/slack-files2.s3-us-west-2.amazonaws.com\/bot_icons\/2017-10-09\/254784743351_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]