[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Okay cool! I can absolutely help here. When do you actually graduate? A lot of the big studios do internships, which is actually how I got into Framestore. Unfortunately you’ve missed them this year but it would be a good thing to aim for next year. Otherwise you are looking at starting out as a runner or maybe in a roto\/prep department. But they are great ways to get into a company as well as you get to learn about everything from the bottom up!\n\nThe other thing to consider is other smaller studios. The big names are great and they work on exciting things but they are difficult to get into and you will just be a small cog in a big machine. What’s good about the smaller studios is that you can be more involved in the projects and you’ll often progress a lot quicker. There is a website called artofvfx which I think has a list of most of the vfx studios, film and tv. It would be worth checking out every single company so you know what kind of thing they do and there may be some that you really like the work of!\n\nAs for your showreel, my biggest tips for showreels is put your best work first and keep them short. I think that you have some good stuff on yours but they transition very quickly. Do you have any more film work to put on? As you want to get into film it’s best to try and keep the reel full of photorealistic film comp work and maybe have a separate reel with more graphics work. I would choose three of your best shots and put them together so they all transition in the same way, the length should be about a minute and don’t worry about editing it to music, the recruiters watch them on mute anyway! (Although obviously it’s nice for Vimeo if it’s well made). Keep your name and email\/phone number on screen all the way through and put a small description of the work that you did on the shot. If\/when you get to interview stage recruiters will ask about your showreel so it’s worth having stuff on there that you can talk about too. I really could talk about showreels and applying for jobs all day! :joy: so ask any questions!",
        "ts": "1562312510.004500",
        "username": "David Sheldon (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-07-05\/674227052675_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]