[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Katie! wow it's been a tough week! We have been handing in assignments every Friday since that first one I showed you...:zany_face: I haven't even touched my laptop because by the end of the day I am so tired of screens I just can't take it. I'm glad you liked it! It has evolved a lot more now that the rest of the group's work has been added. I am trying to escape now that class time is officially over, all though most of my group is staying. I just feel I have done my part (and more) so it's ok if I leave for today.",
        "ts": "1554481955.000100",
        "username": "Laura (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-05\/593205609105_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Anyways, I will try to send you some of the latest renders we will be getting next week. I am just excited to finish it!",
        "ts": "1554482008.000200",
        "username": "Laura (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-05\/599519954000_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I am currently not working on any personal projects but now that I have some knowledge I do want to start something. Not sure what though... It would be great to get some ideas from you. I guess I will start looking at some artists profiles at ArtStation to get some inspiration. I could probably start it over the break, I know my uni will be open during most of it.",
        "ts": "1554482208.000300",
        "username": "Laura (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-05\/588109052594_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Agh it sucks I didn't get to see these messages before because I would have loved to meet some of your friends before the Rezzed event! Something happened with the email notifications I had set because I didn't get the email until just now... I'll check. But anyways, I still definitely want to meet them (and you IRL if that's ok with you...not sure if there are any rules on the program about that). I will be tomorrow at EGX Rezzed with a couple of my course friends, I'll tel you how it goes after :blush:",
        "ts": "1554482625.000400",
        "username": "Laura (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-05\/588116495218_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "It's great what you say about being able to shuffle around different departments at Framestore, I am sure it makes it a lot more fun for everyone and it's great to be able to keep learning new things! I love learning. And it is true: the more skills you get the more employable you are!",
        "ts": "1554482778.000500",
        "username": "Laura (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-05\/602431455045_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Well talk soon! hope you have a great weekend!",
        "ts": "1554482792.000600",
        "username": "Laura (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-05\/588016703011_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]