[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "This is amazing!! already signed up for the Q-VFX mailing list! I had seen some info about it from the Access VFX Instagram and is definitely the type of thing I am interested in joining :grin:\nMondays are better for me from 7:30pm. So chat next Monday?",
        "ts": "1558532238.001100",
        "username": "Laura (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-05-22\/644793957319_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "This term's project is another group one, we are all working on the same concept but are having a little bit more independence within it so we don't have the same problems we had last term. We will be working on what our lecturer calls a non destructive pipeline, starting with a low poly model in Maya, taking it into Z brush to do surface sculpting on our most important assets and then putting it all together in Unreal (as far as I understand).",
        "ts": "1558532601.001200",
        "username": "Laura (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-05-22\/631529230067_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hope everything is going well for you at work! There are so many events now that summer is kicking in, I am struggling a bit focusing on just my project. I still think about it all the time and manage to gather all types of inspiration everywhere I go. I am excited with where our concept is going and hope to be able to get all the first stage planning and concept sketches done by Wednesday next week.\nAlso, let me know if you get some time to meet face2face too, would be nice to talk IRL :slightly_smiling_face:",
        "ts": "1558532965.001300",
        "username": "Laura (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-05-22\/631537228771_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]