[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Good morning Sam! :wave:",
        "ts": "1554974216.001700",
        "username": "Katie (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-11\/593620880274_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I hope EGX Rezzed was good fun, did you get to meet any developers?",
        "ts": "1554974220.001800",
        "username": "Katie (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-11\/608568221943_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Sorry it has taken me a while to respond - Slack stopped working on our browsers until we updated recently and I have been quite busy with work and life!\nMoving forward I wondered if maybe it would be beneficial for us to take an hour once a week\/fortnight to sit and chat real-time? Let me know what you think!",
        "ts": "1554974242.001900",
        "username": "Katie (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-11\/608568647655_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "In our chats I think I can provide some insight into workplace experiences and ways in which you can stay inspired and motivated to achieve your goals, (and I can definitely introduce you to my network and critique your portfolio if you'd like!) but the technical knowledge of how to use 3D software etc. is something you can look up online or be taught at University so I don't think we will need to go into that in too much detail. Unless of course you have a particular question you're struggling with!",
        "ts": "1554974297.002000",
        "username": "Katie (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-11\/598721364193_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I'd be happy to meet face to face too - as you are over 18 this is all fine according to the programme rules. I have a busy couple of weeks though over the next few months and I wouldn't want to rush a lunchtime meet-up so lets keep chatting on here until we free up! :coffee:",
        "ts": "1554974323.002100",
        "username": "Katie (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-11\/598721893681_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Your cave project is looking really interesting - are you enjoying working in a team?",
        "ts": "1554974344.002200",
        "username": "Katie (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-11\/598722175969_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Regarding finding inspiration for personal projects; it might be tempting to look at other people's work on ArtStation (and sometimes this _can_ be a fantastic way to get inspired and motivated!) but beware you could fall into the trap of copying other artists work (even if you don't realise you're doing it) because it's popular or impressive.\nYou're always going to find a richer source of inspiration when getting out into the real world, visiting historic places, observing animals or going to museums\/libraries etc. If not, google and pinterest will help! Depends on what you personally find interesting and cool :alien:",
        "ts": "1554974780.002300",
        "username": "Katie (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-11\/593540227267_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Katie! just got home from a horribly long day... it's pretty much been a whole week of long days. But we are almost done with our final animatic, and I am happy because almost all of our renders came out clean on the first take! We are now editing the audio and working on getting the edit clean and looking nice with some last feedback we got from our lecturer. I have enjoyed working in a team except for one person (there is always that one person, right?)... she has a big attitude, a big ego, is late all the time and very very messy with her files, has even missed a ton of classes and is now trying to come back in to criticize it all. Of course we have done our best to address it properly but it's tough, specially now that we are so close to the end and need to prioritize to make the most of the time left. *sigh*",
        "ts": "1555022603.002400",
        "username": "Laura (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-11\/599767865857_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Good thing I have had quite a bit of experience before with that type of situation and my other teammates are cool... so we are keeping strong and not letting that ruin our good mood and rhythm.",
        "ts": "1555022711.002500",
        "username": "Laura (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-11\/606087334560_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I am totally on for the one hour real-time chat every week\/fortnight, it will definitely be very helpful. I will get me portfolio updated as soon as I am on break so you can take a look at it. And I would love to have more insight into workplace and industry related info. So yes to all of that :slightly_smiling_face:",
        "ts": "1555023031.002600",
        "username": "Laura (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-11\/606090760880_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I am falling asleep! but let me know when would be best to get our first real time chat and I can show you my final animatic. Hope you have a good end of the week! :space_invader:",
        "ts": "1555023204.002700",
        "username": "Laura (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-04-11\/594585506627_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]