[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "It's okay! Take your time.\n\nNo, that's not a problem at all. I wouldn't recommend copying someone elses code 1 for 1 generally speaking, but if there is any cause for that, check wherever it is you're copying it from for fair use rules and the like. But re-using your own similar code, absolutely no problem, that's just being efficient.\n\nYeah, both companies and teams within companies will have their own way of writing and setting up code, you'll do code reviews for stuff like that typically.\n\nRig layout is quite specific as well. Early in the project it is up to the lead to determine what the layout is going to be, and that's decided base upon design requirements. Whether that's bones for hair, breasts, muscles or accessories is determind by gameplay features typically so thats where you have to work with the whole game team to decide what you need to factor in to a character rig.\n\nBut it differs for certain games. Games where there is character customisation the rig has to be quite robust and able to easily interchange customisation, rigs for games with one or two main hero characters tend to be very complicated and detailed with lots of blendshapes and corrective joints, because they don't have the be shared and re-used. They're built to purpose rather than multi-purpose. But either way, you will have a set way to build the rig, that is normally determined by the initial rigging tool that the team is using\/creates. The benefit and one of the main points of using a rigging tool is you can use it to rig several different charaters and they will all have the same joint structure. This allows them to share animations and so on and so forth.",
        "ts": "1581877645.002600",
        "username": "Daniel Seager (IntoGames (Mentors))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-16\/941920403426_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]