[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "No problem at all, ask questions as and when you can and I'll check in from time to time :grin:\n\nSo, with your example, your rig structure needs to be the same consistently, and not differ in order. So for example, if your original rig's joint order is 1&gt;2&gt;3 then your second rig needs to be 1&gt;2&gt;3. You can  add additional joints at each level so as long as 3 is parented to 2, you can also add for example 2a, 2b etc.\n\n            2a\nSo 1 &gt; 2 &gt; 3 would be what the structure should be in terms of hierarchy\n            2b\n\nYou're also fine to add on to the end of the chain, so 1&gt;2&gt;3&gt;4 and the rig would still work. There'd be no animation data for 4, but the animation existing for bone 1-3 would work fine.\n\nWith your example, as long as the hierarchy was the same for the joints, from head to toe, then only the extra joints would not be able to share animation data. You could even make use of that informatino data deliberately, say you wanted to retargeting animation from somethings legs but have a totally different upper body. You would keep the legs the same structure wise and then do whatever it is you needed to do for the spine upwards.\n\nHope that helps, this slide show has a good explanation of these principles, I know Uncharted 2 is a slightly older game at this point, but we're just building on top of ideas like this, and a lot of studios aren't in the position to implement ideas as complicated as this even now. (it is Naughty dog after all). <https:\/\/www.gdcvault.com\/play\/1012552\/Uncharted-2-Character-Pipeline-An>",
        "ts": "1584573701.000300",
        "username": "Daniel Seager (IntoGames (Mentors))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-18\/1010417584288_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "title": "Uncharted 2 Character Pipeline: An In-depth Look at the   Creation of U2's Characters",
                "title_link": "https:\/\/www.gdcvault.com\/play\/1012552\/Uncharted-2-Character-Pipeline-An",
                "text": "Some of the topics covered will include how we used our propriety modeling and UV tools to deal with output a variety of meshes in an efficient manner. How we use Maya referencing to allow us to maintain one skeleton for all the different outfits....",
                "fallback": "Uncharted 2 Character Pipeline: An In-depth Look at the   Creation of U2's Characters",
                "from_url": "https:\/\/www.gdcvault.com\/play\/1012552\/Uncharted-2-Character-Pipeline-An",
                "service_icon": "https:\/\/www.gdcvault.com\/img\/favicon.ico",
                "service_name": "gdcvault.com",
                "id": 1,
                "original_url": "https:\/\/www.gdcvault.com\/play\/1012552\/Uncharted-2-Character-Pipeline-An"
            }
        ],
        "edited": {
            "user": "B6CS60LDU",
            "ts": "1584573703.000000"
        }
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Wow thank you, this was very helpful :+1:\nI hope you are well during these Corona days",
        "ts": "1584586253.000500",
        "username": "Katherine Padley (IntoGames (Mentees))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-18\/1010699620165_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]