[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Alev!\n\nHappy weekend! Hope you are having a lovely one, and taking some time to rest! You sound like you try to keep very busy and keep learning, which is brilliant! But I would caution you that the animation industry is very much one where you can burn yourself out by trying to do too much. So do work hard to make time to step away from it all every week too. I know many people, myself included, who burned themselves out and had to take time off to regroup. So yes, keep busy and try lots of things, but your health both mental and physical is the most important thing, so make sure to take care of yourself!\n\nSo, as I'm sure you were told, my background is predominantly in 2D, with a little bit of 3D thrown in. I have no experience in stop-motion. Dexter told me they would try and find you someone else to give you advice in that area so I hope that happens. I do know that Aardman in Bristol do summer courses. They are pretty expensive, but if you wanted to learn stop-motion from the masters, that's something you could look into! I would say that if you know your love lies with stop-motion &amp; 2D, then try and focus on that. Don't give too much of your time to outside things like live action or any of that stuff. You already know it, so at this time of learning, it would be a waste of your energy and valuable time.\n\nWithin stop-motion &amp; 2d, you need to learn as much as you can about them to figure out what you would most like to do. For me, I knew I wanted to be a great 2D animator. So I worked hard on the 12 principles of animation and did a lot of figure studies (drawing people in their day to day lives) and life drawing to improve my draftmanship. Being a great animator did not come naturally to me, so it took a lot of work to be average at it and get employed. And my career threw other opportunities at me, which I took because I needed work and money to pay bills. So I worked a lot in After Effects doing motion graphics and comp type work, worked in Flash as a animator a few times, and eventually was offered the chance to be a rigger, which is a job I love. I love it because it is both creative and technical, which is what is suited to me. I was never an excellent artist but my skills are enough to make me very comfortable and happy in rigging.\n\nSo what I mean to say really is that even if you decide you want to be a storyboarder now, you will have plenty of opportunist to try new things later too, so don't be scared about that. That animation industry is very organic. So if you tried stop-motion first and wanted to do 2d later, that would also be a possibility.\n\nBUT, and this is a really big one, studios need skilled workers. They don't need people who can use every single kind of software. Anyone can learn software. They need you to bring your craft and skills to them. So if you want to be a storyboarder, you need to study film A LOT. You need to have a strong command of drawing, camera angles, perspective and above all, storytelling. You don't need to be the best artist, but you need to be able to tell stories. So study the greatest movies - why were they so great? What are you favourite movies\/shorts\/cartoons - study them and try figure out why they spoke to you so much. Read books. Follow great storyboarders on social media. Talk to them if you can. Be a sponge to all the information you can get. Anyone can learn how to use Storyboard Pro. You need to learn how to tell great stories.\nThe same goes for any area you think you would love to get into. You can chose a few areas in stop motion or 2D that you can try, but don't spread yourself too thin and try too many things. You won't learn properly if you can't give a decent amount of time and energy to it.\n",
        "ts": "1584298873.005700",
        "username": "Niki Kehoe (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-15\/1000926031924_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "You could also consider being an editor full time in animation if that was still an area you would really enjoy. Your previous experience combined with your studies in animation would stand to you and I'm sure studios would be willing to give you a junior role or internship in that. Also, compositing is really fun! So that could be something for you too if you enjoy a combination of technical and artistic :slightly_smiling_face: Compositing is a role for someone with an eye for detail, so you might love it. These are roles that would build on the skills you gained from working in live action. All of these things are on the way in your journey, not in the way. So do make use of those skills too.\n\nI would love for you to tell me some more about your MA that you are doing now. What MA is it exactly? What is the presentation you have to give? What do you mean by hand-out and what are you thinking you will do for that? Let's focus on that a bit and see if we can get a concrete plan for you :smile: Take some stress away!\n\nAfter, we can talk about jobs, internships and portfolios! But for the moment, lets deal with your projects!\n\nYour age is not an issue in animation. It is your skill that matters. The industry is extremely accepting and welcoming, though it can be very challenging in the first few years. There are few permanent roles in animation, so while you try make a name for yourself, it can be difficult to have steady work. It is all contract to contract. But the industry is booming at the moment, so it's a great time to get into it!\n\nOne thing I would like you to consider is when you're helping the BA students with their work, are you getting enough from it to forward your own learning and career prospects? Are you helping them with storyboarding, prop &amp; set design and other things you outlined that you love doing? You need to make sure that you are getting a good balance in return for your time. The answer may be yes, but I want you to REALLY think about it. Because if you're helping on multiple projects, maybe you don't have enough time or energy to build your skills in the areas you really want to develop.\nFor example, if you are helping as an editor but you don't want to be an editor in the animation industry, is that the best thing for you to be doing right now?\nI am not for a moment saying you shouldn't help out on the BA films. You obviously love the collaboration and you said you're learning a lot. So that is brilliant. But when you finish your MA, will it have served you? Can you show something to potential employers from it? Do you have enough time to develop the skills you want to develop to have a strong portfolio at the end? If the answer is yes, that you are gaining a lot from helping others and you do still have the time you need to study other things too and get your own project work done well, then please do keep going! I am not saying to stop. I just want you to check in with yourself about it all, and ask yourself these questions you might not have thought to ask yourself before. Maybe you have asked them before and you are very happy with the way things are going. So that would be great! :smile: But, just in case you are doing too many things and don't have enough time, I would recommend making a plan to cut out the things you don't have time for to make time for the things that are really important.",
        "ts": "1584298873.005800",
        "username": "Niki Kehoe (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-15\/1000926031924_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Super long message, but you had a lot to say and I had a lot of thoughts about it!!! :joy: But some stuff is just for you to think about. As I said, I would love to focus on your 2 projects mostly for now, so I look forward to hearing about those!",
        "ts": "1584298938.005900",
        "username": "Niki Kehoe (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-15\/1001400868853_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]