[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Alev,\n\nI really appreciate you being so honest with me about everything you are going through right, now, including the personal information about BPD and also your anxieties and concerns about your family. While I am no doctor or psychologist or anything like that, I will of course strive to help you in any way I can. I have an interest in human behaviour and took some courses by Dr John Demartini last year. I believe strongly in what I learned from him and use it daily on myself to balance my mind. So something you should know about me is that I am a very direct person. I will say what I mean and mean what I say. And I mean every word from the best place possible, and only say something if I think it can help get you, whether that is about your career, or about your anxieties or whatever it is we are talking about. Over message especially, but sometimes in person, maybe what I say can sound a little strong, or insensitive, but that is most assuredly not what I want. Mostly I think that our anxieties can be greatly alleviated by thinking differently and refocusing our minds.\n\nSo to start, of course I understand 100% about your anxieties over your parents. I too am worried for my parents and grandmother in Ireland. So lets start there. The Turkish government have done your parents a great kindness by having a curfew. It is something they are doing to try and protect the older generation. So the curfew is something to be grateful for, not something to worry about. I would hope that your father isn't leaving the house anyway, with his underlying health conditions. A curfew will be good for him if it stops him from being silly and spending too much time outside. This move by the government will hopefully limit the spread of the virus so your parents can get back to normal life sooner. It also makes the younger generation more aware of the vulnerable in society. You can call your parents every day. Maybe have dinner \"together\" some evenings so you don't feel so apart.\nIt was my very good friends birthday yesterday. We all raided our wine cabinet and had drinks \"together\" over Skype! It was so much fun!\n\nYou did not mention you were married! It must be difficult to be separated from your husband right now. At this crazy time, I'm sure it would be really nice to have his comforting support nearby. But he is young enough and healthy, so you don't have to worry about him that way. So maybe you miss his support especially. But you can obviously do extremely well on your own. You need to give yourself some credit about how strong and independent you are! Which is obvious, since you made the extremely courageous decision to go to Bournemouth to study and follow your dreams. You have obviously come very far since you started in Turkey, live in Germany and are studying in the UK!\nWe all have anxiety about the current situation. It is an unknown for all of us and there is a lot to be scared of. It is okay to feel anxious. I do sometimes too. So I do mentally regulate. And you, if you suffer from BPD need to take extra care of yourself. So do that. No excuses. Make a daily plan for yourself and do it! On the days that you don't manage to do it, remember you are only one meditation away from being back on track! There is no point in being hard on yourself. Be kind to yourself!\nDownload something like Headspace or Moodfit and meditate every morning before you start your day. Exercise! I am doing Joe Wicks (The Body Coach) every day in the flat to keep healthy at home. I go for walks - just for half an hour during the work day, and if I can, a longer one in the evening. I also love doing Yoga With Adriene on Youtube! She is the best! Yoga clears my mind and helps my back a lot, so it's one of my favourites! Eat well! Drink lots of water! It will help with the migraines too, though in all likelihood, they come from anxiety.",
        "ts": "1584910157.008700",
        "username": "Niki Kehoe (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-22\/1006371535891_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "These are basic healthy things that may not seem like they help your mind, but they do. A happy body helps to have a happy mind :slightly_smiling_face: Or at least I firmly believe that!\n\nTo deal with anxiety, I am sure doctors have told you a lot more than I can. But I have had anxiety in my life and I consider myself quite good at dealing with it. So I will tell you how I do that, and hopefully you will find some value in it.\nBalance is everything. It can be very challenging to do when you get to the real emotional stuff, but I try and balance each and every situation. For example, about 3 or 4 weeks ago, my housemate (who is a very close friend) told me she was going to move out of our flat at the end of July (end of our lease) to move in with her boyfriend. No problem. But less than 2 weeks later she told me shes moving out now and went behind my back and organised for a friend of hers to move in. Around the same time I found out that my housemate had gone behind my back again and booked accommodation for her and another friend but not asked me if I wanted to book too. We are supposed to be going on holidays in June. We are on the same flight. But now I will have to look into accommodation by myself which will be more expensive and I don't even know which hotel she's staying in. All of this was extremely hurtful to me at the time.\nBut, despite what I have just told you, this girl really is a good friend of mine. And she has been going through a very hard time recently with work and things.\nI know what the bad sides of this are. But how do I balance this? What are the good sides? Well, with the house, I get lonely sometimes because my housemate is at her boyfriends place all the time. I am really excited I will have a housemate who is around soon. And I know the girl moving in. She is extremely lovely and very sociable. She works in marketing so has had to organise tonnes of events in London, so she will be able to show me lots of cool new places! There are lots and lots more reasons why it is good.\nWith the accommodation, well its good because I will have my own room! I am a light sleeper, so that's better for me! Also, the holiday is at the start of June, so maybe we won't be even going now. So I didn't waste money. As well, there was a big football tournament there that weekend but it has been cancelled. So if I do go, I will have a better choice of accommodation and it will be a lot cheaper. The fact that my housemate went behind my back was a good thing too, because it made me pay a lot more attention to how she was doing. And she was really struggling. I have been a much better friend to her since I realised that she was struggling and she was obviously angry with me for not noticing. We are in a much better place now :slightly_smiling_face:\n\nSo it can be hard to see the positives sometimes, in difficult situations. But there are always positives, not just negatives. The curfew is protecting your parents. Your husband has company with your cat and he is healthy. So now you need to look after you! What are the positives of your situation? Well there are lots! You have tonnes of free time! So what have you been meaning to do that you've been putting off? Your 2 projects? Some fitness thing? Learning baking? Developing  a new project? Learning to animate in Harmony? Calling your parents? Or a friend you haven't been in touch with for a while? Make a list of all the things. We all have those lists!!! So write out your list. And then make a plan to start checking things off the list. The human mind works best when it is challenged and supported equally. So challenge yourself to do something. Then break it down into small, manageable tasks. Tomorrow, I will get up, do a half hour Joe Wick session, have a shower, have breakfast, and for work I will finishing rigging the front view of the character I'm working on and send it for review. I will take my lunchbreak at 1pm. I will go for a little walk if I can. Or make myself a n",
        "ts": "1584910158.008800",
        "username": "Niki Kehoe (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-22\/1006371535891_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "ice lunch and sit away from my desk. Then I will work again until 6. After that, I will make a nice dinner, and maybe watch some Supernatural, cuz I've just gotten into that show! I will also call my mam, cuz I didn't get to talk to her much today cuz she was busy.\n\nSo I would like you to make a plan. And I would love for you to share it with me. Every day if you like. I am here to support you as much as I can.\nAlso, I do not know anything about BPD, aside from what you told me and what I just googled. So please be patient with me if I am clumsy or stupid about it, and please educate me. I want to know more about it, so if you care to share more info about it, I would be an eager listener.\n\nBe kind to yourself at this hard time. Take care of yourself. You are not alone x",
        "ts": "1584910158.008900",
        "username": "Niki Kehoe (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-22\/1006371535891_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Niki! I just read your BEAUTIFUL and KIND and INFORMATIVE Email briefly. Before going to bed, I just wanted to tell you that I am really very grateful. Grateful for your support and understanding and sharing. It means a lot and it makes me feel less lonely, indeed...",
        "ts": "1584919385.009000",
        "username": "A. (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-22\/1017955957477_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "...I am a HUGE FAN of Headspace! As well as Adriene!",
        "ts": "1584919413.009100",
        "username": "A. (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-22\/1017935828912_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "It is really silly to see how small the world is. :)",
        "ts": "1584919429.009200",
        "username": "A. (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-22\/1017935994624_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "And I am well aware of Supernatural. Hahahahaha!",
        "ts": "1584919471.009300",
        "username": "A. (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-22\/1017483203172_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I did not finish all the seasons yet. No spoiler pleaseQ",
        "ts": "1584919485.009400",
        "username": "A. (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-22\/1006470136675_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Well, my guilty pleasure is Teen Wolf. Hihihihhihihihihi! And Gilmore Girls!",
        "ts": "1584919518.009500",
        "username": "A. (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-22\/1019708202535_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I really do hope that your family is OK in Ireland. :\/ These are really tough times... And I am really sorry to hear that you had a rough patch with your friend and also with the flat. But it seems like, everything will work out at the end, therefore I am happy for you!",
        "ts": "1584919592.009600",
        "username": "A. (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-22\/1017958193189_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thanks a lot for sharing!!!",
        "ts": "1584919597.009700",
        "username": "A. (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-22\/1017958255829_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hmmm, Joe Wick? I will look at it. His name sounds like John Wick, hahahaha! :)",
        "ts": "1584919642.009800",
        "username": "A. (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-22\/1020150526166_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "On Tuesday, we were actually going to have a talk and portfolio day from Blue Zoo. There was a sign-up per Email. I don't know if I got in, but I need to gather few things tomorrow, just in case. I have to prepare my website and portfolio anyways!",
        "ts": "1584919722.009900",
        "username": "A. (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-22\/1020151394982_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Therefore, I am going to concentrate (try to) on that tomorrow. And I definitely like the idea of sharing a schedule with you. Or a daily plan.",
        "ts": "1584919767.010000",
        "username": "A. (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-22\/1019710937879_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "To be honest, lists don't work with me or on me. While I tend to get more anxious. I have recently discovered that MindMapping is much more suitable for my chatty brain. And it is more flexible for me as well. Also, it does not tend to make me that stressful.",
        "ts": "1584919831.010100",
        "username": "A. (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-22\/1007881222465_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "But still, I may give making a list a try again. I just don't want to disappoint you in the end, in case it does not work out.",
        "ts": "1584919878.010200",
        "username": "A. (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-22\/1017941154400_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Therefore, I just wanted to inform you ahead.",
        "ts": "1584919892.010300",
        "username": "A. (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-22\/1017961760837_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I will get back to you again about other few points that you have shared but just wanted to say 'keep safe' and thank you very very much...",
        "ts": "1584919938.010400",
        "username": "A. (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-22\/1005157365042_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Take care!!!",
        "ts": "1584919944.010500",
        "username": "A. (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-22\/1019713173927_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]