[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I’m glad to hear it’s not a fault on my end then. I like that idea and I think I’ll implement it. \nThat’s very true, I just wanted to ensure my reel stood out from other people using readily available rigs. \nThe completely honest answer is that I don’t 100% know. I’d love to be able to say yes but I don’t think I’ll get the most out of speaking to you if I just give the ‘easy’ answer. So far I’ve narrowed it down to facial animation because I’ve found a strength in picking up on subtle movements. \nOn a slightly different note, when would you advise would be the best time for starting to apply for jobs? I finish in September 2019 but I want to apply before then. How long before can you realistically apply when you still have commitments in university?\nSorry for the late replies recently too. I work full time in a bar whilst in uni so Christmas comes with a lot of long shifts back to back.\n",
        "ts": "1545582412.000300",
        "username": "Tom (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-23\/510741761507_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Good work will always stand out to the right people. The animation supes have a great eye for that kind of thing. When you have something ready I'll stick it in front of one of them. He's a good mate of mine and he will give you a great set of feedback.\n\nWhen I was at uni I applied in the first couple of weeks of the final term of my msc. Which was July i think. I got the job fairly soon after and just went with it. I admit I took my foot off the gas at that point at uni ;) how have you found uni in general as a preparation for industry? I'm sure you already said but Which uni is it? I went to Brighton and Bournemouth unis for my degrees. But that was literally 20 years ago! ",
        "ts": "1545609633.000400",
        "username": "Alan Woods (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-23\/510927310642_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]