[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "That’s fantastic thank you. \nI’m not surprised! My BA course in Wrexham wasn’t great actually but I had to use it as a stepping stone due to the fact that I didn’t have any UCAS points. It got me in to uni and I spent a huge portion of my time there teaching myself or fighting to get guest lecturers and better equipment for the course. My MA course in Cardiff however is worlds apart and I’m learning far more which is giving me more confidence for moving in to the industry. They have a higher standard of work so it’s making me push more and raise my game to be honest. \nI know it’s not a simple question to answer but what are the quality expectations for someone who’s just started in the industry? More specifically on the amount of work produced and the targets set in comparison to someone who’s been working there for a few months or even a few years.\nMerry Christmas by the way. I hope you’re having a good day with your family and the young kids you mentioned aren’t bouncing off the walls too much!",
        "ts": "1545761214.000500",
        "username": "Tom (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-25\/510844030848_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi tom hope you're having a great Xmas break. It's hard for me to answer what expectations would be for an animator straight in from uni. I can certainly ask the question though. If the supes have seen something they like in your work they will be giving you work pitched at the right level. They want you to succeed! They won't expect the world. They will just want to see enthusiasm and willingness to get to grips with stuff. Small companies may be able to offer more diverse work at a larger company you might be asked to just muck in with some smaller tasks until you get your feet wet. Glad the Cardiff course is going well. Bournemouth was great for me. Really set me on a good path. Looking forwards to seeing your work in the new year! ",
        "ts": "1545777036.000600",
        "username": "Alan Woods (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2018-12-25\/511821291157_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]