[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "It surprises me that they’re quite flexible, I always imagined they’d be much stricter than the uni deadlines I’m used to. \n\nThat arvel comment really tickled me :joy: why do they delay approval so much?\n\nI have until Monday to gather it all together in a bible to submit. Once I finish the animatic, I’d love for you to take a look at it and give some feedback. \n\nThe film is about educating the audience on the disease through people’s recollections of their own experience. I’ve been speaking about it with my lecturers so much though that I’m not sure if the film is effective or whether they’ve just learnt through me pitching my work this year. \n\nHow much of the preproduction do you tend to get involved with in a company the size of Framestore? ",
        "ts": "1547125996.001100",
        "username": "Tom (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-10\/520935953109_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Well it depends on the project but on my current project we have been quite involved. Character design, fx design etc. Sometimes the clients are really up for collaboration sometimes not.\n\nMarvel delay things because multiple vendors are doing the same assets. So if one vendors hits on something good they make everyone else follow suit. So by leaving approvals open this can go right to the end of the show.\n\nHappy to look at the animatic next week. I'll show it to a couple of the anim supes and see if they have any comments for you. \n",
        "ts": "1547136643.001200",
        "username": "Alan Woods (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-10\/520150136080_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]