[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Alan, I’ve just had a notification to say my message couldn’t send (5 days later!) I’m going to resend it to make sure it all came through, sorry if it didn’t.\n\nOh I wish haha I think that’s exactly what I’ll be doing now thank you. Each character has different hair and a slight costume change eg. A scarf\/nurses badge and watch. The faces will be tweaked slightly but each will be modified from the same almost complete model with the same rig in all of them. \n\nI’m sure it’ll be well worth the time in the end :)\n\nI have a bit of a big favour to ask too. Is there any chance I could come up to the studio for a visit in the next few weeks please? Possibly even shadow you for a while or chat to some people in the team? \n\nWe have a module running concerning professional practice so I’ll be using our conversation as one way in which I’m speaking to professionals (if you don’t mind). The module is all about gaining a better understanding of the job you wish to peruse and get feedback on work to help you get that job. This conversation has been perfect for it but an independent visit to the studio however without 20 students walking with me in a herd would be hugely beneficial.",
        "ts": "1551255080.000200",
        "username": "Tom (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-02-27\/562052477810_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi tom I am away next week but I can see if I can hook that up. Framestore always has work experience people in so it shouldn't be a problem. Let me talk to folks at work and see what they say. ",
        "ts": "1551257375.000300",
        "username": "Alan Woods (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-02-27\/562034358660_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Should be fine Tom. Let me know some dates you'd like to come. You'll need to. Sign an NDA which will mean you can't discuss specific project details. You will need to make sure you can still get what you need from it within those constraints.",
        "ts": "1551270122.000400",
        "username": "Alan Woods (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-02-27\/562243179330_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]