[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Alan, I hope you had a good New Years. I’ve got my 1st term deadline coming up so I may take longer to reply. It’s good to know that enthusiasm and willingness play such a big role. I think there’s a slight fear of the unknown in terms of expectations that I’ve seen in my classmates as well. \nAm I right in saying that you lead a team? How have you found managing people working in the creative industry?\nI’ve been a team leader\/supervisor in previous jobs before going to uni. After taking a leading role in several projects throughout uni, I’ve found the differences between the 2 to be huge. The biggest challenges for me have been getting people at uni to meet deadlines, stop making little adjustments to work and to not go off on tangents during meetings.",
        "ts": "1546543949.000700",
        "username": "Tom (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-03\/516026832754_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Tom, yes New Year and Xmas were relatively relaxing :wink: I don't miss the days of uni deadlines though! There's nothing to be gained from having fear of it. We all started somewhere. Just be enthusiastic and willing to try.\n\nI am a CG Supervisor so all of the 3d teams report to me. They have their own leads and department heads but for the project I get to be in charge. The problem with uni projects is that everyone is out for themselves in many ways I found. Unless you get a bunch of like minded people who all share the creative vision it can be hard. Finding out when something is 'good enough' is a problem for us as well. VFX Supervisors can noodle projects forever. But that's where someone like me comes in and hopefully convinces them it's good enough as it is! For meetings it's good to have an agenda and a clear idea of who is running the meeting. It's up to them to keep it on track and productive!\n\nSo what is the deadline? What's the assignment?",
        "ts": "1546548204.000800",
        "username": "Alan Woods (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-01-03\/515984520931_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]