[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Billy, no worries at all! Sorry, I usually try and get away from my PC on the weekends so I've only caught this now.\n\nI'm sorry there are so many questions all at once so please feel free to take your time with answering them!\nI've stalked you online a bit last week just to see what kind of stuff you've been up to (I hope you don't mind) and I was super impressed. Just looking at your early stuff on Vimeo it was clear to me that I need to do a lot more animation tests! I don't have much to show at the moment unfortunately, but you can find my 2019 showreel and some tests <https:\/\/vimeo.com\/user98087883|here>. The little black cat videos you will need a password for and it's AnimTest. Otherwise I post mostly on my <https:\/\/www.instagram.com\/sarcartsticfringehead\/|instagram>, and I have some work I've done at university <https:\/\/noranadvegi.wixsite.com\/noranadvegi|on my now fairly outdated website.> I also have a <https:\/\/www.linkedin.com\/in\/nora-na%C4%91vegi-097162178\/|LinkedIn>, but not a whole lot to brag about just yet! I'd really like to hear your opinions!   I've not done much freelance animation work, I've done illustration commissions here and there in the past but nothing major. Freelancing seems really daunting, from disciplining yourself to work from home, building a brand, doing your own taxes, I don't really know where I'd start. I assume since you had 5 years experience in the industry, you'd already built a name for yourself, but how did you manage the rest? I'm\n\nI'm currently working on a little loop for an animation challenge hosted by motionapetit and <http:\/\/buda.tv|buda.tv> over on Instagram. I've just finished my roughs and am about to start cleaning it up. I've posted the rough preview <https:\/\/vimeo.com\/410243732|here>  for you if you want to have a peek and tell me what you think?\nAs you could probably tell by now, I try to use ToonBoom for both traditional and rigged. At the moment I'm definitely doing traditional more because I'm revisiting my fundamentals (and I'm just more comfortable with it at the moment). I've recently been given some feedback that I'm trying to act upon such as working on my keys, breakdowns and timings. During uni I used to always get away with animating straight-ahead so I feel like I need to re-teach myself the pose-to-pose workflow.\nI would definitely love to learn more about 2D rigging and rigged animation. I've tried to teach myself how to do it during my final year of uni, but due to time constraints I've only managed to get the basics down really. I did learn how to work the node view, so in the end it did kind of pay off!\n\nIt would be really interesting to hear how you got from uni to the animation supervisor position. What part of the journey was the most fun for you and vice versa? As a graduate being launched into the world is daunting. The field is really competitive and it's very easy to feel intimidated. I've applied for a few internships but wasn't successful unfortunately, that's the main reason why I decided to sit down and work on my portfolio. Have you done any work placements or internships after graduation or did you go straight into a junior position? I've seen that you've also done the Gobelins Summer School programme. Gobelins is an absolute pipe dream for me, do you feel like it's been a valuable experience for you or do you think you could have done just as well without it?\n",
        "ts": "1587491166.002100",
        "username": "Nora (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-21\/1075489817845_48.png"
        },
        "bot_id": "B6CS60LDU",
        "attachments": [
            {
                "service_name": "Vimeo",
                "title": "Nora Nadvegi",
                "title_link": "https:\/\/vimeo.com\/user98087883",
                "text": "Nora Nadvegi is a member of Vimeo, the home for high quality videos and the people who love them.",
                "fallback": "Vimeo: Nora Nadvegi",
                "thumb_url": "https:\/\/i.vimeocdn.com\/portrait\/defaults-blue_640x640.png",
                "from_url": "https:\/\/vimeo.com\/user98087883",
                "thumb_width": 640,
                "thumb_height": 640,
                "service_icon": "https:\/\/i.vimeocdn.com\/favicon\/main-touch_180",
                "id": 1,
                "original_url": "https:\/\/vimeo.com\/user98087883"
            },
            {
                "title": " Login • Instagram ",
                "title_link": "https:\/\/www.instagram.com\/sarcartsticfringehead\/",
                "text": "Welcome back to Instagram. Sign in to check out what your friends, family &amp; interests have been capturing &amp; sharing around the world.",
                "fallback": " Login • Instagram ",
                "from_url": "https:\/\/www.instagram.com\/sarcartsticfringehead\/",
                "service_icon": "https:\/\/www.instagram.com\/static\/images\/ico\/apple-touch-icon-76x76-precomposed.png\/666282be8229.png",
                "service_name": "instagram.com",
                "id": 2,
                "original_url": "https:\/\/www.instagram.com\/sarcartsticfringehead\/"
            },
            {
                "service_name": "Nora Nadvegi",
                "title": "Animation | SarcARTstic by Nora",
                "title_link": "https:\/\/noranadvegi.wixsite.com\/noranadvegi",
                "text": "SarcARTstic by Nora offers quirky animation with a fresh style.",
                "fallback": "Nora Nadvegi: Animation | SarcARTstic by Nora",
                "from_url": "https:\/\/noranadvegi.wixsite.com\/noranadvegi",
                "service_icon": "https:\/\/www.wix.com\/favicon.ico",
                "id": 3,
                "original_url": "https:\/\/noranadvegi.wixsite.com\/noranadvegi"
            },
            {
                "service_name": "Vimeo",
                "service_url": "https:\/\/vimeo.com\/",
                "title": "SHSP roughs",
                "title_link": "https:\/\/vimeo.com\/410243732",
                "author_name": "Nora Nadvegi",
                "author_link": "https:\/\/vimeo.com\/user98087883",
                "thumb_url": "https:\/\/i.vimeocdn.com\/video\/881840591_295x166.jpg",
                "thumb_width": 295,
                "thumb_height": 166,
                "text": "Rough animation for a little personal project.",
                "fallback": "Vimeo Video: SHSP roughs",
                "video_html": "<iframe src=\"https:\/\/player.vimeo.com\/video\/410243732?autoplay=1&amp;app_id=122963\" width=\"400\" height=\"225\" frameborder=\"0\" allow=\"autoplay; fullscreen\" allowfullscreen title=\"SHSP roughs\"><\/iframe>",
                "video_html_width": 400,
                "video_html_height": 225,
                "from_url": "https:\/\/vimeo.com\/410243732",
                "service_icon": "https:\/\/a.slack-edge.com\/80588\/img\/unfurl_icons\/vimeo.png",
                "id": 4,
                "original_url": "https:\/\/vimeo.com\/410243732"
            }
        ],
        "edited": {
            "user": "B6CS60LDU",
            "ts": "1587491169.000000"
        }
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "In terms of studios I'm looking at, my top choices would definitely be The Line Animation, Cartoon Salloon\/Lighthouse, Boulder, Giant, Sun Creature Studio, Shotopop, Sun and Moon to name a few. I've been following Sun and Moon for a while on Instagram and I really liked how they worked in a lot of different styles but they all still looked very on brand. The animation is very bouncy and lighthearted and I love the aesthetic of clean designs and limited color palettes that they use quite often (at least in their social media posts). I also really liked the fact that they offer fairly affordable animation courses that pretty much anyone can take part in. Internships can be really selective and hard to come by, so it's great to have an option to do an in-studio course and get a feel for their pipeline that way.\n\nAs far job preferences go, I definitely see myself as a character animator. I would be willing to look more into character design and 2D rigging as a fallback. Currently I am most comfortable with traditional animation, but I'm working on getting a better grip on 2D rigged animation. I'd say I'm struggling with clear posing and getting deformers to do what I want them to do without breaking the model. The people I'm learning from at the moment (on youtube) are Toniko Pantoja for traditional animation, StylusRumble, Frank Summers and Oli for rigging etc.\n\nPhew! That was a lot of writing, I really hope I haven't put you to sleep!\nPlease take your time with the replies, I know you're super busy so there's absolutely no rush! If you feel like tackling one question at a time is more manageable, that's fab with me.\n\nHope you have a good one, looking forward to chatting again! :smile:",
        "ts": "1587491166.002200",
        "username": "Nora (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-04-21\/1075489817845_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]