[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi there Holly, nice to meet you! Thanks for your interest in talking to us at access vfx and for putting all this effort into studying animation by yourself! I wish you luck finishing your work, hope everything goes well :)\n I hope I can help you with any questions you have! I'll try and answer you as well as I can based on my experiences, but if we come across some subject I'm not well aware I can search some resources for you to look into.\nIt's been 6 months I'm working in the UK, before that I had been living and working in Brazil, where I'm from. I have worked on several stages of animation productions, but especially with storyboards and 2d traditional and cut out animation. I'm currently doing animation on a new tv series called It's Pony that just launched last week on nickelodeon.",
        "ts": "1580289777.001700",
        "username": "Marcelo Perin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-29\/926883696885_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Before I came to the UK I had been storyboarding for animation for 5 years. It's sometimes hard to do only only thing in animation because you never know what's next and what shows will be in production. I've started in animation, but moved to storyboard and I'm back to animation now. I really like storiboarding though, mostly because I get to draw free hand (since most productions are cut out animation now) and also because you usually get to do a whole episode by yourself, and I like the idea and the process of reading a script and translating it in its entirety to schemes, shots and acting.",
        "ts": "1580290297.001800",
        "username": "Marcelo Perin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-29\/929085937430_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Thank you. :) It's cool to see you have a range of experience and are often changing between things- I get bored pretty quickly haha. That's definitely the reason I'm interested in storyboarding- I like making text into art amd juat general storytelling. How did you get into the industry? ",
        "ts": "1580301411.001900",
        "username": "Holly Raidl (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-29\/929312154214_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "My first job happened while I was attending an animation course and one of the guys there got a freelance he needed help with, it was a month only, many overnights, but it was a good experience. After that I found some offers online for several studios that were about to start to produce TV series, it was after the first public funding in Brazil for TV series, so it was luck to have like more than 5 studios starting up at the same time. I did tests for some of them and got one position. I had to move 500km away from home though, but that was where I learned most.",
        "ts": "1580325334.002000",
        "username": "Marcelo Perin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-29\/927394647492_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "ah thats cool! Yeah the travelling for jobs is definitely something I've noticed, it's slightly worrying but I feel like I'm lucky to be in the U.K. because its pretty small haha. How was the testing process for you? ",
        "ts": "1580330647.002100",
        "username": "Holly Raidl (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-29\/915218696946_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]