[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Holly, sorry for the late response. Hope you're doing well with your work.\nIt's quite a rough time now since the project is coming to an end and they just announced we're \"free to go search for new opportunities\", hehe\nSo I'm in the process of sending portfolio around and taking tests. It seems I'll need to move again.\nYou have a good question there, and it all comes to when would it be. When I started there was only a tiny fraction on the internet of what you can find now, and no such free or cheap courses like the ones on <http:\/\/udemy.com|udemy.com> and domestika. Not to mention how easy it is now to take pictures and edit in phone now, for stop motion. \nI'd certainly start from the same book, though, the anomator's survival kit by Richard Williams. It's the greatest thing on animation. \nI'd learn paper cutout animation first, I think, because when I tried it it really helped me understand timing and how important it is to build the animation in your head before you shoot\/draw it. I think it's a very underestimated approach but it's very cheap and you can make some simple setup with a phone or camera to take the pictures and then to edit it together you just need any software where you can import pictures and adjust the timing per frame. Adobe premiere, flash, after effects would do, but there's  certainly many others even mobile apps that must adjust picture length by each frame.\nIt's good because you skip the time of drawing stuff and focus on motion only. Whether you make a character out of separate paper cuts or just use simple forms to experiment with acceleration, arcs and basic stuff.",
        "ts": "1583861340.000100",
        "username": "Marcelo Perin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-10\/991871263381_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Of course you can do it digitally, but my point is that having physical paper cuts and having to plan it out in your head and shooting the animation straight ahead will force you to first understand the most basics, then do anything else",
        "ts": "1583861416.000200",
        "username": "Marcelo Perin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-10\/981770947345_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "If I were young as just out of high school I would go to an animation uni, because being young and having time to decide, it's good to get to know the variety of stuff you learn there.\nIf you need to work straight away, I'd take short online or traditional courses on animation or animation softwares that cover basic animation so you can start to work already.\nOther than that, I certainly believe you learn the most of your career at work, so the sooner you get to it, the better. Most positions are for people starting, that's also a sad truth when you're older and can only find junior roles, but for people starting it's great.",
        "ts": "1583861636.000300",
        "username": "Marcelo Perin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-10\/979077508514_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]