[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Holly, hope you're well. Definitely a course is great benefit especially if you know what you want from it and can set goals and try to meet your expectations.\nSome studios say what they want t see in the portfolios, but in general it depends on the position you're looking for. An animation role will usually require an animation reel only. A storyboard role may require landscape\/perspective drawings apart from pages of storyboards and animatics. If it's illustration, like concept art, background or character design it will go mostly in those directions.\nCourses are much more specific and often tell you the exact amount of drawings for each category the want to see, or a minimum\/maximum drawings, ie 8 landscapes, 10 life drawings, 6 acting poses, and so on.\nIf I had no clue and had to send a bit of everything, I'd try to pick about 5 of my best drawings of each category and put them in max 2 pages per category, if possible. Character poses may fit all in one page, for example.\nAn animation reel of max 2mins ideal, you really don't need more than that. And a general rule is to only pick the ones you think are the best ones, even if you end with not that many.\nFor a reel, be it animation or animatic, you'd start and end with your very best shots, so you grab anyone's attention from the start - don't think they'll start to watch whatever and \"by the end they'll see how good it gets\" understand? :)\nI think that's it, the shorter you can make it with the best you have is way better than a long portfolio full of white space and stuff that you're not sure is really good.\nThe same goes for your CV, if you can fit it in 1 page, it's great.\nAlso whenever you get to show it to someone else to have some opinions and critique before you send it, it's a nice thing to have.\nI hope that helps you!",
        "ts": "1581326381.002700",
        "username": "Marcelo Perin (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-02-10\/944540878997_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]