[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hey Simone, I'm sorry I appear to have had problems with notifications again, I've only just seen your most recent messages. I'll answer your questions shortly, sorry again!",
        "ts": "1574434149.003200",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-22\/837691939777_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Ok, so! When we hire junior animators they have to have a fairly decent knowledge of body mechanics but we also look at potential. You can tell when someone is on their way to understanding the mechanics of something but is just a bit junior vs someone who hasn't understood it at all. We'd also look at interesting acting choices. We get hundreds of applications so it's really worth thinking up something original so you're not just another \"box lifting exercise\" or \"walk cycle\".\n\nWhen looking for your first job it's also really worth looking at the smaller studios too as well as the big ones. You might get lucky but there's also a lot more competition and any experience is good experience! In fact here's my little industry story...",
        "ts": "1574435542.003300",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-22\/832876831426_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "When I was still studying I was always applying to Pixar, Disney, Framestore, Dneg etc and rarely even getting a \"thanks but no thanks\". I only applied as \"animator\" and never a runner. More on that in a sec.\n\nEventually I got my first job at a tiny studio in London Bridge called Impossible TV. There was four of us all sitting around one table making a tv show together and it is still one of the most fun experiences I've had in my career. It was a perfect first job as it almost felt like making a student project because it was such a small production and you had to get your hands dirty and figure out all your own problems.\n\nI stayed with that studio for about a year then reapplied to Dneg and got a job there straight away! I have a few theories about why this is:\n\n- Any animation industry experience is good experience and much better than being a runner. As a very junior animator you get paid about the same as a runner but you're getting paid to animate every day and improve, not trying to fit in some animation in your spare time.\n\n- TV experience makes you a very efficient animator which was a good selling point even though I didn't have feature experience. I was animating 30-40 seconds per week. On a feature it'd be way less.\n\n- Dneg at the time were crewing up for John Carter (remember that one? Nope!) which had a ton of background crowd animation to do so there was also a bit of \"right place at the right time\" too but because of my TV experience I think they knew I could knock out lots of animation quickly at a \"good enough\" level for background characters.",
        "ts": "1574436638.003400",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-22\/847551113415_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Why'd I leave Dneg? That's another story!",
        "ts": "1574436648.003500",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-22\/847900012342_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Going back to your original question! - So the freshest animators are not expected to be perfect and we actually give them less work and simpler work as well as more feedback so you're not dropped in the deep end.",
        "ts": "1574437116.003600",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-22\/845716423669_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "And yes we do! I've recently looked back on books for certain techniques and recently i was animating a badminton match so needed to look at reference for that. As long as your end result is done well and done on time nobody cares how you got there.",
        "ts": "1574437220.003700",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-11-22\/837782495985_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]