[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Simone, this animation's looking great, you picked something very challenging, something slow and mechanics-based doesn't leave you anywhere to hide!  I agree about the legs though, it appears to be mostly down to you having to fight the IK legs, here's my thoughts...",
        "ts": "1575483378.004400",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-04\/847198988770_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "• f13 the right leg in the air's knee wobbles. This is caused by the leg's sudden change of direction over 1 frame. Look at the knee and you'll see it travels screen left then immediately on f14 goes screen right, which will feel like a bump\n• f57 the spacing of the left knee goes from slightly bent on f56 to totally straight on f57 giving you a knee pop. On f58 it then immediately changes direction. As with anything you want nice gradual spacing and to avoid sudden direction changes unless you want the feel of hitting a wall. This is tricky though, if you have trouble think about how many controllers are affecting the knee eg foot, heel roll, hips, root and maybe simplify the motion over those frames. Good luck! I hate knee pops!\n• f64 same sort of spacing problem with the knee\n• f87 wobbly knee on the left leg. Look at the spacing of the knee, you want it to be gradual and almost constant.",
        "ts": "1575483778.004500",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-04\/859990898464_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "With all these you'll want to keep an eye on the graph editor but don't forget also to look at it visually as it actually is in-camera :slightly_smiling_face: Hope that helps, let me knw if you need anymore thoughts on it!",
        "ts": "1575483844.004600",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-04\/848525849027_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Oh and you mentioned the landing. For me I just felt like it could be pushed more with a bit more down and back up motion. By the way did you use reference?",
        "ts": "1575483965.004700",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-04\/859540163636_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Your potential question! - We look for someone with some good understanding of body mechanics and who shows interesting acting ideas. For us also cartoony comic timing is great to see too. That book I mentioned character animation crash course is great fo rthat. They need to be enthusiastic and willing to learn (we don't want people who come out of uni thinking they already know everything with a cynical attitude. It happens and it doesn't get you far!)",
        "ts": "1575484142.004800",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-04\/859544997444_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Sorry for my slow reply too, again I'm still not getting notifications. I had a look in settings and it seems to be everything or nothing which isn't ideal.",
        "ts": "1575484199.004900",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2019-12-04\/862211856838_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]