[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Simone. The eyes were just standard eyes that you could rotate but the riggers left most of the scale attributes on the controllers unlocked because they new we'd be doing whacky stuff. So no clever mods or deformers just old fashioned scaling!",
        "ts": "1579601715.000400",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-21\/917128330630_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Drawing over does happen here but not to the extent that you might see on a feature film behind the scenes, like what Glen Keane did on Tangled, although I'd love that! At most you tend to get a couple of key drawings if necessary but more often than not it's easier just to grab the director and talk to them, we're a relatively small studio so we're all in the same room.",
        "ts": "1579601879.000500",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-21\/916783892007_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "TV animation is all about efficency and putting effort in the right places. So that's keeping the number of poses as strong as possible but to a minimum number and spending the most time on parts of the body that the audience will be draw to, which tends to be head and hands. And along with that you want to make sure that the movements between poses have a strong breakdown and start and stop smoothly. Audiences are more likely to notice jerky animation than floaty animation although of course we aim not to have either!",
        "ts": "1579602139.000600",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-21\/914474326980_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "There's also the thing of chosing which shots are more important than others, both for the episode and for your demoreel. What you don't want to do when you submit your 2 minutes of animation for an episode is to have 1 amazing shot and 15 that suck. So rather than compromising *quality* on the less important shots it's best to compromise on *complexity.* That way every shot has clean and smooth motion but some will have more going on than others.",
        "ts": "1579602408.000700",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-21\/904741826497_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "I love TV animation though, I think it's great especially for juniors even if you ultimately want to work in features, it's like an animation bootcamp, the time pressure forces you to think creatively to get the best bang for the buck out of your shots.",
        "ts": "1579602481.000800",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-21\/904743253025_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Oh and I'm working on The Adventures of Paddington, which just started airing on Nick Jr in America, not sure when it airs over here but I don't think it's got long to go. We've got Ben Wishaw doing the voice which is amazing to work with!",
        "ts": "1579602580.000900",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-21\/914483259844_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "And to a degree, yes, we do get a say, which is a luxury we didn't have when we were a smaller studio but now there tends to be more than one show going on at a time they ask us if we have a  preference.",
        "ts": "1579602694.001000",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-21\/903471385267_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Oo and I forgot another thing about planning for TV animation. I find it really helps to animate your entire allocation shots at the same rate so if you have 10 shots do all the layout for all 10 shots, then put all the key poses in, then all the breakdowns, then antics, settles all the passes across the entire chunk that you've been given. That way your whole sequence builds up at the same rate and you wont run the risk of running out of time because you spent too long on one shot before you moved on to the next.",
        "ts": "1579602909.001100",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-21\/902159180098_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "You're like a fountain of knowledge! Honestly, thank you so much for all the advice and tips -- I hope it doesn't seem like I'm wasting your time with all the questions, I will do my best to put your advice into practice. :slightly_smiling_face: I've been working on a sequence of shots recently and tried to keep some of the things you mentioned in mind - when animating in the past it has usually been a battle against time for me, and thus I have always tried to get something done quickly that will look passable. But now that I have had some time to learn a bit more about how to approach a shot and then trying it out for myself, and with your suggestions, I feel like I'm finally starting to get it (Although now I feel even more that I can see how much work I still have ahead. I guess that is just the way it works :sweat_smile:).\nI can see why you would like TV animation so much; it sounds really exciting to be able to tackle new shots all the time, at some point you must have tried animating nearly everything. When you switch between multiple shots all the time, do you also avoid getting too used to seeing the same shot over and over? (Is there a name for that thing where you stop being able to see what your animation really looks like? Eye fatigue?)\nI saw the ads for the new Paddington, it looks absolutely adorable - my first thought was that this must be such fun to work on. It made me all nostalgic, I remember reading the stories back when I was younger. What is it like to work on a such a famous character? It looks like it's going to be so good, best of luck with it :slightly_smiling_face:\nBy the way, I just came across the 2019 children's BAFTA results today. I know it's a bit late, but I saw that you won for Numberblocks - that's really impressive and super cool! Last time I was back in Denmark, I saw some kids from the British pre-school watching the show. They even sell Numberblocks learning books in the bookshops over there - it must be amazing to be behind a series that has reached so many! I hope you'll keep having fun making cool stuff",
        "ts": "1579661048.001200",
        "username": "Simone Jahn (Prospela Students (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-21\/915921611860_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]