[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Simone hope your deadlines are going ok! Ah so on More Stuff I just asked if i could do a few shots, as did many others and my name got picked out of the hat. The sequence I animated was the bit with the Elf singing \"you're killing the planet you're killing my back\" who then gets squashed by the globe, followed by the 2 Elves singing and trying to hold the door closed.  As with a lot of the work we do, time pressures were high so you go for the simple but effective approach, which usually means moving smoothly between a few strong key poses with the most detail in the head and face as that's where's you're eye tends to be drawn.",
        "ts": "1579009501.000300",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-14\/905638012192_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "And yes Simone's great, he's got very good cartoony sensibilities, he helped me out with the bit where the 2 Elves get their heads squashed together so it was funny rather than \"realistic\". He did me a drawing then it was up to me to figure out how to break the rig to make it happen!",
        "ts": "1579009690.000400",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-14\/894173915875_48.png"
        },
        "bot_id": "B6CS60LDU"
    },
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "When it comes to animating lots of characters in the same shot we actually had to do that a lot on Numberblocks. The best approach is to approach it one character at a time while you're animating or it'll just be too slow. So you'd position all the characters, get the camera in the right place, then block each character individually, checking at each stage the shot still works with all the characters there. You wouldn't want to fully finish one character before moving onto the next.",
        "ts": "1579009840.000500",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-01-14\/905645810352_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]