[
    {
        "type": "message",
        "subtype": "bot_message",
        "text": "Hi Simone! No need to apologise one day we'll both work out how notifications work on here! How are you doing by the way in these tricky times have you had to stay at home? Most of us at Blue Zoo are working from home now with thankfully they've been amazing at setting up and it works really well.\n\nGlad you like the clip, that was a fun one to do, I learnt loads on Tree Fu Tom. Great question about the lip sync! Have you heard about the \"rule\" about sliding your mouth animation keys 2 frames early? If not that's because if you key your mouth pose exactly where the sound is it will feel late because you mouth actually hits the shape early to prepare for the sound. Personally I don't like sliding my keys around if i can help it so I put my key poses on the frame I want them to be then listen to the audio that's 2 frames after my pose and pose the mouth based on that, not the audio that's actually on that frame, if that makes sense.\n\nI wouldn't sacrifice anything on that checklist because not only is it a checklist it's also designed to keep your workflow effecient and organised, so I think cutting anything out would make things worse. If I sacrifice anything though when things are tight it's probably things like the subtler overlaps and settles, things that are nice to have but you can get away with not having in a pinch. That varies from production to production though and you just get used to it :slightly_smiling_face:\n\nI used to animate outside of work, particularly when I was working on a 2D show and wasn't using my Maya skills for a while, I also did a short film a few years ago but since becoming a dad I don't have as much time or energy for it!\n\nfeedback to follow!",
        "ts": "1584557648.001000",
        "username": "Simon Taylor (Prospela Mentors (beta))",
        "icons": {
            "image_48": "https:\/\/s3-us-west-2.amazonaws.com\/slack-files2\/bot_icons\/2020-03-18\/1012001702486_48.png"
        },
        "bot_id": "B6CS60LDU"
    }
]